
[
    {
      "id": 101321,
      "url": "https://jobicy.com/jobs/101321-care-navigator",
      "jobSlug": "101321-care-navigator",
      "jobTitle": "Care Navigator",
      "companyName": "Curative",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/07/5b596d503f4d8f3eee6a0bd247e5d6a8.jpg",
      "jobIndustry": [
        "Customer Success"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Curative has launched a health plan unlike any other. Curative Medical* and Care Navigators are at the core of the Curative member-oriented health plan. The Care Navigator is assigned member accounts and they are responsible to help patients navigate healthcare, engage in preventative care and partner with them in achieving their health goals. ESSENTIAL DUTIES&#8230;",
      "jobDescription": "<p>Curative has launched a health plan unlike any other. Curative Medical* and Care Navigators are at the core of the Curative member-oriented health plan. The Care Navigator is assigned member accounts and they are responsible to help patients navigate healthcare, engage in preventative care and partner with them in achieving their health goals.</p>\n<h2>ESSENTIAL DUTIES AND RESPONSIBILITIES:</h2>\n<ul>\n<li>Ensure your assigned members have great experiences seeking and receiving care.</li>\n<li>Encourage your members to engage more with their health by providing them the tools and educational courses needed to embrace healthy lifestyle behaviors.</li>\n<li>Work with Curative physicians and other Curative clinical staff to administer personalized, preventative care.</li>\n<li>Optimize the care and health outcomes of your member</li>\n<li>Support operations of the practice by assisting with care coordination Working with the health plan, suggest and develop metrics which can be used to track member engagement and identify members with unmet healthcare needs.</li>\n<li>Improve patient experience by anticipating care interventions before serious issues arise Educate patients on components of their health plan and answer any relevant questions</li>\n<li>Follow up with patients after their health appointments to assist with any follow-up steps, questions, and concerns to ensure all their needs have been met</li>\n<li>Be knowledgeable about our technology products, clinical programs, and policies and is able to communicate them effectively</li>\n<li>Use Electronic Health Records to fetch and complete patient records</li>\n<li>Greet patients in a warm and friendly manner as well as provide tours of Curative facilities</li>\n<li>Manage patient communications and answer messages in a timely manner</li>\n<li>This is a full-time position and may at times require working evenings and/or weekend hours</li>\n<li>Shift option are Pre 6am &#8211; 2:30 cst AM 8:30am &#8211; 5 cst Mid Shift 12:30 &#8211; 9pm cst Days of the week shifts are: Monday &#8211; Friday Tuesday &#8211; Saturday Sunday &#8211; Thursday</li>\n<li>Work adhering to US regulatory and Quality System requirements (21 CFR 820, etc).</li>\n<li>This position assumes and performs other duties as assigned.</li>\n</ul>\n<h2>QUALIFICATIONS:</h2>\n<p>To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions:</p>\n<ul>\n<li>3+ years of experience in case management/care navigation/health plan/medical office role</li>\n<li>At least 1 year of experience working in a clinical setting</li>\n<li>Fluent in English (Spanish fluency a plus but not required)</li>\n<li>Outstanding written and verbal communication in both languages</li>\n<li>Analytical mindset</li>\n<li>Strong ability to use and learn new technology tools</li>\n<li>Strong interpersonal skills</li>\n<li>Exceptional attention to detail and organizational skills</li>\n<li>Willingness to continually self-educate</li>\n<li>Capable of working independently with minimal supervision and also as part of a team</li>\n<li>Skilled with standard computer programs</li>\n<li>Remote and hybrid position available. Based in the Austin, TX area and able to travel regularly to our clinic in downtown Austin</li>\n</ul>\n<h2>PREFERRED (NOT REQUIRED) SKILLS &amp; EXPERIENCE:</h2>\n<p>Understanding of medical terminology Experience working in healthcare, hospitality or customer service. Familiar with phlebotomy and/or injections</p>\n<h2>EDUCATION and/or EXPERIENCE:</h2>\n<p>Associate&#8217;s degree (A. A.) or equivalent from two-year college or technical school; or six months to one year related experience and/or training; or equivalent combination of education and experience.</p>\n<p>Bachelor&#8217;s degree (B. A.) from four-year college or university; or one to two years related experience and/or training; or equivalent combination of education and experience.</p>\n<h2>WORK ENVIRONMENT:</h2>\n<p>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this Job, the employee is using a computer and typing. The employee is frequently required to stand, walk, and sit. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus. The noise level in the work environment is usually Mild  For this position the percentage of expected Travel is: 25% of the time, Austin local *Curative has no ownership interest in Curative Medical. Curative Medical is a separate, physician-owned entity. A Curative affiliate exclusively manages the non-clinical business operations of Curative Medical.</p>",
      "pubDate": "2024-02-15 07:47:26"
    },
    {
      "id": 101323,
      "url": "https://jobicy.com/jobs/101323-customer-support-representative-mexico",
      "jobSlug": "101323-customer-support-representative-mexico",
      "jobTitle": "Customer Support Representative (Mexico)",
      "companyName": "Shopmonkey",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/baf27bf7e7c0ff8017f9d4271ae886a6.jpeg",
      "jobIndustry": [
        "Customer Success"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Mexico",
      "jobLevel": "Any",
      "jobExcerpt": "As a customer service enthusiast based in Mexico, you will recognize that our shops network is the cornerstone of our business and is the key to our ongoing growth and success. With your knack for solving tough problems and your focus on delivering exceptional customer service, you will thrive in a Customer Support job with&#8230;",
      "jobDescription": "<p>As a customer service enthusiast based in Mexico, you will recognize that our shops network is the cornerstone of our business and is the key to our ongoing growth and success. With your knack for solving tough problems and your focus on delivering exceptional customer service, you will thrive in a Customer Support job with Shopmonkey.  As the driving force in building shop loyalty and growing our existing shop base, you’ll deliver effective relationship-based customer service in support of the department. You’ll tackle challenges that will continually spark your intellect, fuel your passion and drive your professional growth. Liaise between shops and cross-functional internal teams to ensure innovative, individualized solutions, satisfying the ever-changing needs of our shop base. Through it all, your ability to form a trusted bond, listen attentively, and respond to shop inquiries will make you the critical touchpoint between Shopmonkey and our valued shops.</p>\n<p>Shopmonkey is a growing and changing startup, so this role will include variety, change, challenges, and creativity in designing solutions, which goes beyond the typical support role. <strong>**This is a long-term contract position**</strong></p>\n<h2><strong>You Will Have The Opportunity To</strong></h2>\n<ul>\n<li>Learn all about the Shopmonkey product suite and automotive industry</li>\n<li>Use a relationship-based approach, deliver best-in-class service to our shops</li>\n<li>Thoroughly and efficiently gather Shop information, access and fulfill shop needs, educate the shop where applicable to prevent the need for future contacts, and document interactions through contact tracking</li>\n<li>Respond to shop complaints and service-related inquiries professionally and compassionately. Work with the Customer Support Management team to successfully address escalated shop concerns<strong>.</strong></li>\n<li>Effectively manage workload, maintain assigned schedule, and attendance standards.</li>\n<li>Professionally handle incoming requests from shops and ensure that issues are resolved both promptly and thoroughly.</li>\n<li>Utilize tools and resources on every email, call or chat to make appropriate recommendations to shops</li>\n<li>Maintain a balance between company policy and shop benefit in decision making</li>\n</ul>\n<p><strong>Support Metrics</strong></p>\n<ul>\n<li>Meet department performance standards for servicing and responding to all service call queues, chat, and email while adhering to schedules, and maintaining attendance standards</li>\n<li>Analyze and report trends from shops feedback, to determine needed process improvements</li>\n</ul>\n<p><strong>Communication</strong></p>\n<ul>\n<li>Ensure that all business-related items are successfully and professionally communicated either verbally or in writing, both internally and externally</li>\n<li>Continuously evaluate and identify opportunities to drive process improvements that positively impact the shops experience</li>\n</ul>\n<p><strong>Bonus Points</strong></p>\n<ul>\n<li>Experience in hospitality, automotive industry, call center, or fast-paced startup</li>\n<li>Able to take direction from peers and managers</li>\n<li>The ability to speak Spanish is a plus</li>\n<li>Truly appreciate cars and/or are familiar with the automotive industry</li>\n</ul>\n<h2><strong>To Be Successful In This Role, You Will</strong></h2>\n<ul>\n<li>Be available to work either Monday through Friday or Tuesday through Saturday shifts</li>\n<li>Be fluent in speaking and writing English</li>\n<li>Have 1-3 years of customer support experience in a high volume call center environment, supporting clients by phone, email and chat</li>\n<li>Have a clear, professional, friendly and informative communication style</li>\n<li>Enjoy creative problem solving and experiencing new and different challenges everyday</li>\n<li>Are self-directed learners and highly motivated</li>\n<li>Thrive in a dynamic &amp; collaborative startup environment, and are comfortable with ambiguity and seizing opportunity.</li>\n<li>Adapt quickly to changing priorities and evolving customer needs</li>\n</ul>\n<div class=\"content-conclusion\">\n<h3><strong>Why Shopmonkey? </strong></h3>\n<p>Shopmonkey has become an amazing environment where employees feel that they are valued as people, and not just worker bees. To ensure that our team thrives, we invest in the following perks (benefits may vary upon location and employment status):</p>\n<h3><strong> Fully Remote Work!</strong></h3>\n<ul>\n<li>$1,000 to set up your home office</li>\n<li>$20 phone/internet monthly reimbursements</li>\n<li>Virtual activities and in-person meet-ups</li>\n<li>Laptop and super rad swag provided</li>\n<li>Unique opportunity: This is the <em>best </em>form of hybrid! All teams get to travel and meet up for collaboration at least once/year. Shopmonkey also hosts an annual company-wide get together we call <em>Rally</em></li>\n</ul>\n<h3><strong> Health &amp; Wellness </strong></h3>\n<ul>\n<li>Medical, dental, vision, and life insurance benefits available the 1st of the month following hire date</li>\n<li>Short term and long term disability</li>\n<li>Employee assistance program</li>\n<li>Generous parental leave</li>\n<li>401(k) available upon hire</li>\n</ul>\n<h3><strong>✈️ Time Off </strong></h3>\n<ul>\n<li>11 paid holidays</li>\n<li>Flexible time off &#8211; take the time off you need!</li>\n</ul>\n<h3><strong> Giving Back </strong></h3>\n<ul>\n<li>Matching donations for approved charitable organizations</li>\n<li>Group volunteer efforts</li>\n</ul>\n<h3><strong> Personal &amp; Professional Development </strong></h3>\n<ul>\n<li>Weekly internal product &amp; company training sessions</li>\n<li>Monthly events &amp; education activities focused on DEIB, personal and/or professional development</li>\n<li>Individual career progression plans and leadership/management training</li>\n</ul>\n</div>",
      "pubDate": "2024-02-15 07:46:49"
    },
    {
      "id": 103135,
      "url": "https://jobicy.com/jobs/103135-onboarding-manager",
      "jobSlug": "103135-onboarding-manager",
      "jobTitle": "Onboarding Manager",
      "companyName": "1Password",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200909195848-296323.png",
      "jobIndustry": [
        "Customer Success"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Canada,  USA",
      "jobLevel": "Any",
      "jobExcerpt": "We all have important information we need to manage, and protecting it should be easy. Over 100,000 businesses and millions of people log in to 1Password to unlock smart, simple access to everything they care about. Our vision is to create a safer, simpler digital future for everyone, and our culture values simplicity, honesty and&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>We all have important information we need to manage, and protecting it should be easy. Over 100,000 businesses and millions of people log in to 1Password to unlock smart, simple access to everything they care about. Our vision is to create a safer, simpler digital future for everyone, and our culture values simplicity, honesty and a human-centric approach to solving problems. Come help us unlock peace of mind so everyone can stay safer online.</div>\n<div></div>\n<div>Our Onboarding team is responsible for understanding the relationships and desired outcomes started during the sales process, building a launch plan for success, and helping customers get the most out of 1Password.</div>\n<div></div>\n<div>As a Customer Onboarding Manager, you&#8217;ll be helping our customers harness the full potential of 1Password by working with teams within 1Password as well as the client company to support them in a smooth implementation of 1Password while providing them with an exceptional customer experience. In this role you will be responsible for managing the communications between 1Password and the customer, and ensuring a timely implementation process.</div>\n<div></div>\n<div>This is a remote opportunity within Canada and the US.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What we&#8217;re looking for:</h2>\n<ul>\n<li>5 years of experience in a Customer Success or Project Management function; Onboarding, Implementation, Account Management, Professional Services or equivalent B2B SaaS experience.</li>\n<li>Strong communication and training skills over email, phone, and video. Presenting and speaking to new people each day excites you. Your style is concise and empathetic – with a balance of teaching and listening/learning yourself, as well as the ability to lead a conversation.</li>\n<li>Experience with and passion for helping people or businesses use software to be more productive and efficient. You’re passionate about discovering a team’s needs, and you ask strong, open-ended questions that help you learn more about them. You enjoy translating technical terms for customers who find technology confusing or intimidating.</li>\n<li>A proven track record in onboarding or implementing multiple client projects ranging in size and complexity.</li>\n<li>Conceptual or functional understanding of Project Management methodologies and/or Implementation frameworks.</li>\n<li>Familiarity with the acronyms SCIM, AD, CLI, SSO, and SaaS.</li>\n<li>Feedback, learning, and growing are some of your favorite words and you advocate for this in others. A keen interest in growing within Customer Success; whether that be into a leadership role, additional CS departments or more!</li>\n<li>Someone who works well with internal teams, balancing individual customer’s success with company needs and opportunities.</li>\n<li>A knack for learning things on your own and quickly adapting to new environments. Since 1Password is remote, it’s important to be independent in your research, but also have the humility to ask for help when you aren&#8217;t sure about something.</li>\n<li>The thought of tracking minute details doesn’t make you cringe and you’re able to organize yourself and your tasks so customers don’t get missed or dropped.</li>\n<li>It’s a bonus if you have personal experience with 1Password or another password manager. While not required, it will allow you to quickly gain confidence in this role.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What you can expect:</h2>\n<ul>\n<li><b>Month 1</b></li>\n<li>Get to know the product, our culture, the Onboarding processes, and the people you&#8217;ll be working with.</li>\n<li>Learn our CRM, what and how we track, and keep customer information and project tracking updated.</li>\n<li>By the end of the first month, you’ll be able to onboard a small-sized customer through at least one level of the defined Customer Success process.</li>\n</ul>\n<div></div>\n<ul>\n<li><b>Month 3</b></li>\n<li>Can independently onboard a small-medium sized customer through multiple levels of the defined Onboarding process.</li>\n<li>Supporting existing customers with advanced and ongoing training needs.</li>\n<li>Proactively report on customers’ needs and sharing valuable feedback to enhance and improve processes and the product.</li>\n</ul>\n<div></div>\n<ul>\n<li><b>Month 6</b></li>\n<li>Lead large customers through multiple levels of the Onboarding process.</li>\n<li>Maximize customer engagements and collaborate with cross-functional peers to ensure a successful launch, long-term engagement, and wall-to-wall adoption.</li>\n<li>Onboard customers, build rapport, and put success plans in place that influence the broader Customer Success metrics and processes.</li>\n<li>Collaborate with team members and cross functionally to improve processes internally and externally, acting as a voice-of-the-customer across the organization.</li>\n<li>Partner with leadership to coach fellow team members through their day to day organization, customer strategy and proactively pitch new ideas.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<div>USA-based roles only: The Annual base salary for this role is between $75,000 USD and $101,000 USD, plus immediate participation in 1Password&#8217;s benefits program (health, dental, 401k and many others), utilization of our generous paid time off, an equity grant and, where applicable, participation in our incentive programs.</div>\n<div></div>\n<div>Canada-based roles only: The Annual base salary for this role is between $71,000 CAD and $97,000 CAD, plus immediate participation in 1Password’s generous benefits program (health, dental, RRSP and many others), utilization of our generous paid time off, an equity grant and, where applicable, participation in our incentive programs.</div>\n<div></div>\n<div>At 1Password, we approach each individual&#8217;s compensation with a promise of fair market value and internal equity commensurate with experience and specific skill set.</div>\n<div></div>\n<div>We believe in the power of remote work, but we also recognize that some in-person connection with team members and customers is important to help us achieve our mission. While we are a remote-first company, occasional travel for in-person engagement will be a part of this role. This may include but is not limited to bi-annual department-wide offsites, quarterly department meetings and periodic customer events. These events will typically be held in varying locations across Canada and the USA. In leadership roles, you can expect to travel once per month on average.</div>\n<h2><b>What we offer:</b></h2>\n<div>We believe in working hard, and resting hard. We’re always looking for new ways to support our team members, but here’s a glance at what we currently offer:</div>\n<div></div>\n<div><b>Health and wellbeing</b></div>\n<div>&gt;  Maternity and parental leave top up programs</div>\n<div>&gt;  Wellness spending account</div>\n<div>&gt;  Generous PTO policy</div>\n<div>&gt;  Company-wide wellness days off scheduled throughout the year</div>\n<div>&gt;  Wellness Coach membership</div>\n<div>&gt;  Comprehensive health coverage</div>\n<div></div>\n<div><b> Growth and future </b></div>\n<div>&gt;  Employee stock option program for all full time employees</div>\n<div>&gt;  Retirement matching program</div>\n<div>&gt;  Training budget, 1Password University access, and learning sessions</div>\n<div>&gt;  Free 1Password account (and friends and family discount!)</div>\n<div></div>\n<div><b>Flexibility and community</b></div>\n<div>&gt;  Paid volunteer days</div>\n<div>&gt;  Employee-led DEI&amp;B programs and ERGs</div>\n<div>&gt;  Fully remote environment</div>\n<div>&gt;  Peer-to-peer recognition through Bonusly</div>\n</div>",
      "pubDate": "2024-02-15 07:45:41",
      "annualSalaryMin": "75000",
      "annualSalaryMax": "101000",
      "salaryCurrency": "USD"
    },
    {
      "id": 103134,
      "url": "https://jobicy.com/jobs/103134-member-services-coordinator",
      "jobSlug": "103134-member-services-coordinator",
      "jobTitle": "Member Services Coordinator",
      "companyName": "Curative",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/07/5b596d503f4d8f3eee6a0bd247e5d6a8.jpg",
      "jobIndustry": [
        "Customer Success"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Curative wants to change the view on what a health plan can be. Born out of the pandemic, we created a health plan reinvented for a post-pandemic world that is built around whole-person affordable preventive care featuring more benefits. Curative is looking for a Member Services Coordinator who is passionate about helping the company as&#8230;",
      "jobDescription": "<p>Curative wants to change the view on what a health plan can be. Born out of the pandemic, we created a health<br />\nplan reinvented for a post-pandemic world that is built around whole-person affordable preventive care featuring<br />\nmore benefits. Curative is looking for a Member Services Coordinator who is passionate about helping the<br />\ncompany as we work to reinvent healthcare options. Candidates will be able to utilize their previous experience in<br />\nthe medical field/Customer Care by increasing satisfaction and retention by providing Curative health plan<br />\nMembers, patients, and providers with accurate, consistent, timely and meaningful information. They will provide<br />\nsupport to Members’ while building rapport and collaborative relationships with current and prospective Members<br />\nin accordance with compliance guidelines. This is a remote position with multiple shift options in a 24/7 call<br />\ncenter.</p>\n<h2>ESSENTIAL DUTIES AND RESPONSIBILITIES</h2>\n<ul>\n<li>Answering high volume phone calls and emails, assisting and resolving Member related requests regarding but<br />\nnot limited to the following:</li>\n<li>Building and maintaining solid member relationships by handling questions, concerns, resolving<br />\nissues/complaints with speed and professionalism while maintaining confidentiality per HIPAA guidelines<br />\nin a fast paced inbound and outbound phone, email, and text message call center environment.</li>\n<li>PPO Insurance plan interpretation and benefits</li>\n<li>Managing and updating database Member information with 100% accuracy</li>\n<li>Enrollment, claims, benefit interpretation, EOB’s, provider selection, and referrals/authorizations for<br />\nmedical services and prescriptions.</li>\n<li>Flexibility with changing process and policies requiring excellent organizational skills for immediate<br />\nrecall of information</li>\n<li>Handling calls and emails for all inquiries, we are a one stop shop for support and issue resolution</li>\n<li> Documents provider and member complaints, determines appropriate course of action, and<br />\nfollows-up to ensure the complaint is resolved.</li>\n<li>Provides Member/Provider outreach calls for issue resolution and follow ups</li>\n<li>Documents all interactions and transactions with the member in the appropriate areas.</li>\n<li>Assists Members with Provider assignments and re-assignments.</li>\n<li>Work adhering to US regulatory and Quality System requirements.</li>\n<li>This position assumes and performs other duties as assigned.</li>\n</ul>\n<h2>WORK SHIFTS AVAILABLE</h2>\n<p>Shift flexibility required. Shift availability based on staffing needs, no guaranteed shifts</p>\n<ul>\n<li>Available shifts options are:<br />\n○ Pre 6am &#8211; 2:30 cst<br />\n○ AM 8am &#8211; 4:30 cst<br />\n○ Mid Shift 10am &#8211; 6:30 cst<br />\n○ PM shift 3:30-midnight cst</li>\n<li>Available Days of the week options are:<br />\n○ Days of the week: Sunday &#8211; Thursday<br />\n○ Days of the week: Tuesday &#8211; Saturday<br />\n○ Days of the week: Friday &#8211; Monday</li>\n</ul>\n<h2>QUALIFICATIONS</h2>\n<p>To perform this job successfully, an individual must be able to perform each essential duty with excellence. The<br />\nrequirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable<br />\naccommodations may be made to enable individuals with disabilities to perform the essential functions:</p>\n<ul>\n<li>Excellent attendance is critical to success in this position</li>\n<li>High volume Call Center phone, email, and text messaging experience</li>\n<li>Previous healthcare/Insurance experience preferred</li>\n<li>Excellent computer and phone skills, attention to detail, process and policy adherence</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Strong interpersonal skills.</li>\n<li>Active listening skills to accurately respond to inquiries and requests.</li>\n<li>Exceptional organizational skills, retention of policy and process a must</li>\n<li>Intermediate skills minimum in google and microsoft office suite of products a must</li>\n<li>Experience with internal communication systems such as Slack, Microsoft Team, etc&#8230;</li>\n<li> Internal candidates must have been in their current role for at least 6 months and have no performance or<br />\nattendance actions in effect.</li>\n</ul>\n<h2>EDUCATION and/or EXPERIENCE</h2>\n<ul>\n<li>Only candidates meeting experience requirements will be considered</li>\n<li>One year minimum related experience in a high volume phone, email, text messaging call center<br />\nenvironment</li>\n<li> Call center experience in healthcare, medical device, and/or biotech industries preferred</li>\n</ul>\n<p>CERTIFICATES, LICENSES, REGISTRATIONS &#8211; Administrative/Healthcare a plus but not required</p>\n<h2>WORK ENVIRONMENT</h2>\n<ul>\n<li>Remote position</li>\n<li>Must have password protected, stable high speed internet access &#8211; stipend will be provided</li>\n<li>Must have a quiet place, with no distractions to perform duties for work from home</li>\n<li>Work location MUST be secure and private to maintain HIPAA compliance for work from home</li>\n<li>Office equipment will be supplied including: PC, monitor, keyboard, mouse, headset</li>\n<li>While performing the duties of this Job, the employee is regularly required to sit; use hands to handle or<br />\nfeel; talk; and hear.</li>\n<li> The employee is frequently required to reach with hands and arms.</li>\n<li>Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral<br />\nvision, depth perception and ability to adjust focus.</li>\n<li>We also request, with the exception of emergencies, that you do not request any time off within the first<br />\n120 days of employment. Any request within the first 120 days if approved will be unpaid</li>\n<li>For this position the percentage of expected Travel is:0% of the time</li>\n</ul>\n<h2>TRAINING EXPECTATIONS</h2>\n<ul>\n<li>You will attend a 4-5 week minimum remote training program.</li>\n<li>Attendance is mandatory for the full training program</li>\n<li> Training will be Monday through Friday 8:30am &#8211; 5pm PST</li>\n<li>You will be required to take regular open book competency and retention exams intermittently during all<br />\nweeks of training. Passing grades are 90% or above.</li>\n<li>We also request, with the exception of emergencies, that you do not request any time off within the first<br />\n120 days of employment. Any request within the first 120 days, if approved, will be unpaid</li>\n</ul>",
      "pubDate": "2024-02-15 07:43:07"
    },
    {
      "id": 103133,
      "url": "https://jobicy.com/jobs/103133-social-media-specialist-3",
      "jobSlug": "103133-social-media-specialist-3",
      "jobTitle": "Social Media Specialist",
      "companyName": "Nelnet",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/6b0b3d004b42e9ac89966d54ab7d0bd0.png",
      "jobIndustry": [
        "Social Media Marketing"
      ],
      "jobType": [
        "part-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Nelnet is a diversified and innovative company committed to enriching lives through the power of service as a student loan servicer, professional services company, consumer loan originator and servicer, payments processor, renewable energy solutions, and K-12 and higher education expert. For over 40 years, Nelnet has been serving its customers, associates, and communities. The perks&#8230;",
      "jobDescription": "<p>Nelnet is a diversified and innovative company committed to enriching lives through the power of service as a student loan servicer, professional services company, consumer loan originator and servicer, payments processor, renewable energy solutions, and K-12 and higher education expert. For over 40 years, Nelnet has been serving its customers, associates, and communities.</p>\n<p>The perks of working at Nelnet go beyond our benefits package. When you join the Nelnet team, you&#8217;re part of a community invested in the success of each individual. That support comes through in our work, as we are united by our mission of creating opportunities for people where they live, learn, and work.</p>\n<p>Nelnet’s in-house marketing agency is looking for a social media specialist. Our team, comprised of over 30 marketing professionals, supports the marketing, advertising, and branding efforts for Nelnet’s 24+ businesses. We produce effective, award-winning creative that helps move Nelnet forward.</p>\n<p>The social media specialist reports directly to the social media manager. This position works closely with other members of the marketing team and is responsible for managing the day-to-day operations of projects. The social media specialist is expected to assist in developing and executing social strategies that drive sales, increase brand awareness, and support business goals for individual Nelnet business lines.</p>\n<h2><b>RESPONSIBILITIES:</b></h2>\n<ul>\n<li>Utilize Nelnet (NN) social media management platform (SMM) to:</li>\n<li>Schedule bi-weekly/monthly organic content across all NN social channels.</li>\n<li>Monitor daily conversation and exchanges across all NN social channels.</li>\n<li>Engage in daily conversation and exchanges across NN social channels (when appropriate).</li>\n<li>Pull monthly social metrics and track growth of NN business and competitor accounts.</li>\n<li>Prepare monthly social media reports and provide recommendations based on the data.</li>\n<li>Assist in developing and refining social media strategies, policies, content calendars, and campaigns as directed by the social media manager.</li>\n<li>Prepare and monitor paid social advertising campaigns to ensure budget recommendations are met.</li>\n<li>Leverage our project management and planning system to help manage and organize projects.</li>\n<li>Research current social trends and new social platforms, and provide recommendations.</li>\n<li>Help maintain enterprise social media governance and moderation standards.</li>\n<li>Learn about Nelnet’s various businesses, product/service offerings, markets, and competition.</li>\n<li>Other duties or special projects as may be assigned.</li>\n</ul>\n<p>**Pay Range for this position is &#8211; $17-$18/hr</p>\n<h2><b>EDUCATION</b>:</h2>\n<p>A bachelor’s degree in marketing, advertising, journalism, or related field preferred.</p>\n<h2><b>EXPERIENCE</b>:</h2>\n<p>1-3 years of experience (professional or internship) in social media or digital marketing.</p>\n<h2><b>COMPETENCIES</b>:</h2>\n<ul>\n<li>Quick to learn with strong problem-solving skills.</li>\n<li>Highly organized with excellent attention to detail.</li>\n<li>Excellent customer service and communication skills.</li>\n<li>Ability to successfully manage multiple projects.</li>\n<li>Ability to follow directions and then work independently.</li>\n<li>Active learner who stays up-to-date on social media trends and best practices.</li>\n</ul>",
      "pubDate": "2024-02-15 07:39:55"
    },
    {
      "id": 96038,
      "url": "https://jobicy.com/jobs/96038-accounting-manager-9",
      "jobSlug": "96038-accounting-manager-9",
      "jobTitle": "Accounting Manager",
      "companyName": "CrossFit",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/6966c9ea04a0e651f69f113113a45e27.png",
      "jobIndustry": [
        "Finance &amp; Legal"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "CrossFit is looking for an experienced Accounting Manager to join our dynamic team. You will be responsible for handling the day-to-day accounting operations and month-end tasks, including account reconciliations, journal entries, daily cash and weekly cash reporting, interacting with third party tax provider on all sales &amp; Use tax, interacting with our international third-party accounting providers&#8230;",
      "jobDescription": "<div>CrossFit is looking for an experienced Accounting Manager to join our dynamic team. You will be responsible for handling the day-to-day accounting operations and month-end tasks, including account reconciliations, journal entries, daily cash and weekly cash reporting, interacting with third party tax provider on all sales &amp; Use tax, interacting with our international third-party accounting providers primarily for VAT tax reporting and ad-hoc research and analysis. The<b> </b>Accounting Manager will report to the Vice President of Accounting + Controller, working closely with others in the organization through analysis &amp; reconciliation of accounts and through development &amp; implementation of accounting policies, procedures, and controls. The ideal candidate will possess leadership capabilities, solid knowledge of technical accounting, a high level of attention to detail as well as the ability to multi-task and juggle priorities. This role has opportunities to grow along with the company&#8217;s expansion.</div>\n<h2><b>RESPONSIBILITIES</b></h2>\n<ul>\n<li>Lead monthly close activities and preparation of financial statements</li>\n<li>Prepare all monthly journal entries with supporting backup, ensuring that transactions are accurately explained and supported</li>\n<li>Analyze and reconcile all general ledger accounts</li>\n<li>Record and reconcile intercompany transactions</li>\n<li>Post cash and balance cash accounts daily for all accounts US and Foreign</li>\n<li>Reconcile Corporate Credit Card transactions</li>\n<li>Record and reconcile all payrolls including the foreign entities</li>\n<li>Record all Fixed Assets and run depreciation expense</li>\n<li>Responsible for monthly sales &amp; use tax reporting as well as VAT reporting and relationship with third party interface Avalara</li>\n<li>Manage two junior accountants</li>\n<li>Identifies opportunities and implements process improvement and automation in an ambiguous dynamic environment</li>\n<li>Assist in the gathering of audit requests</li>\n<li>Assist in other projects as assigned</li>\n</ul>\n<h2><b>KNOWLEDGE AND SKILL</b></h2>\n<ul>\n<li>Experience with NetSuite and intermediate Excel skills strongly preferred</li>\n<li>Strong understanding of US GAAP, accounting concepts, and financial statements</li>\n<li>Strong interpersonal skills to enable effective interaction with all levels of personnel</li>\n<li>Adaptable to a changing, fast-paced work environment</li>\n<li>Exceptional analytical, problem-solving, and organizational skills</li>\n<li>Display appropriate ethical knowledge through extraordinary confidentiality, integrity and professional presentation and conduct</li>\n<li>Ability to work effectively both within a team environment and independently</li>\n</ul>\n<h2><b>EDUCATION/EXPERIENCE</b></h2>\n<ul>\n<li>Bachelor&#8217;s degree in accounting</li>\n<li>CPA or Masters preferred</li>\n<li>7-10 years of accounting experience, preferably at least 2 in public accounting</li>\n</ul>\n<h2><b>WHAT WE OFFER</b></h2>\n<ul>\n<li>Rich Medical, Dental, and Vision plans</li>\n<li>Unlimited Paid Time Off––empowering you to unplug whenever and however you need to</li>\n<li>Flexible spending account and 401(k) with employer matching at 5%</li>\n<li>CrossFit Gym Membership Reimbursement</li>\n<li>CrossFit Courses Benefit</li>\n<li>Partnership Perks</li>\n</ul>",
      "pubDate": "2024-02-15 07:36:33"
    },
    {
      "id": 89580,
      "url": "https://jobicy.com/jobs/89580-head-of-performance-marketing",
      "jobSlug": "89580-head-of-performance-marketing",
      "jobTitle": "Head of Demand Generation",
      "companyName": "Close",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/Closeio.png",
      "jobIndustry": [
        "Marketing &amp; Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Close is a bootstrapped, profitable, 100% remote, ~90 person team of thoughtful individuals who value autonomy and impact. We ❤️ startups &amp; SMBs. Since 2013, we’ve been building a CRM that focuses on better communication, without the hassle of manual data entry or complex UI. Our goal: double the productivity of every sales rep. As Close’s Head&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>Close is a bootstrapped, profitable, 100% remote, ~90 person team of thoughtful individuals who value autonomy and impact.</div>\n<div></div>\n<div>We ❤️ startups &amp; SMBs. Since 2013, we’ve been building a CRM that focuses on better communication, without the hassle of manual data entry or complex UI. Our goal: double the productivity of every sales rep.</div>\n<div></div>\n<div>As Close’s Head of Demand Generation, you and your team will be responsible for driving new free trial sign ups for Close. You will manage and grow a team of experts that will help drive new free trials from channels such as paid digital, sponsorships, partnerships, emails, field events, and more.</div>\n<div></div>\n<div>Close does not have an outbound sales team, so this pivotal role will be responsible for creating and capturing demand for our sales team by way of free trials.</div>\n<div></div>\n<div>We’re looking for an individual that is an expert in paid digital programs, but is eager to test new channels and tactics to drive demand. You will start with one direct report and build your team as you develop conviction in the channels and tactics that drive results.</div>\n<div></div>\n<div>You will report to the Senior Director of Marketing and collaborate with marketing leads across product marketing and content marketing.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Who you are:</h2>\n<ul>\n<li>6+ years of experience working as a demand generation, campaign manager, or performance marketer in B2B SaaS, preferably with experience marketing to broad SMB audiences.</li>\n<li>3+ years of experience in a marketing leadership role.</li>\n<li>An expert at defining audiences and experimenting with a wide variety of marketing channels to produce results, for our team that means generating trials.</li>\n<li>Comfortable modeling and managing efficient spend and able to be highly critical of all marketing resources.</li>\n<li>You’re an expert in SEM and analytical tools for marketers. At Close, this includes Google’s product suite (Analytics, AdSense, Search Console), Ahrefs, Customer.io.</li>\n<li>A thoughtful leader that can motivate and grow a team</li>\n<li>You’re physically based in the US.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What you&#8217;ll do:</h2>\n<ul>\n<li>Manage, test and optimize channels and programs to drive new free trials</li>\n<li>Lead and grow a team of demand generation leaders &#8211;  supporting them in their day-to-day work and their career growth.</li>\n<li>Identify, test, and iterate on a wide variety of customer acquisition campaigns with your team of individual contributors.</li>\n<li>Provide detailed results and recommendations to the leadership team on where the company should deploy its resources to acquire more customers.</li>\n<li>Assist the Marketing and Sales teams by helping them identify and implement new strategies and tactics to achieve better results within our existing channels.</li>\n<li>Manage and report out on demand generation campaign spend and ROI</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2> Why Close?</h2>\n<ul>\n<li>Watch our most recent culture video featuring our annual team retreat in Italy</li>\n<li>100% remote company</li>\n<li>5 weeks PTO + Winter Holiday Break with 2 additional PTO days for every year with the company</li>\n<li>1 month paid sabbatical every 5 years</li>\n<li>Paid parental leave</li>\n<li>Medical, Dental, Vision with HSA option (US residents)</li>\n<li>401k matching at 6% (US residents)</li>\n<li>Dependent care FSA (US residents)</li>\n<li>Contributor to Stripe&#8217;s climate initiative</li>\n<li>Our story and team </li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2> Our Values</h2>\n<ul>\n<li>Build a house you want to live in &#8211; Examine long-term thinking and action</li>\n<li>No BS &#8211; Practice transparency and honesty, especially when it’s hard</li>\n<li>Invest in each other &#8211; Build successful relationships with your coworkers and customers</li>\n<li>Discipline equals freedom &#8211; Keep your word to yourself and others</li>\n<li>Strive for greatness &#8211; Constantly challenge yourself and others</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2> How We Work Together</h2>\n<ul>\n<li>Productivity, Quality &amp; Impact &#8211; We don’t track hours. We trust you’re an adult and know best how to prioritize, meet your goals and contribute at a high level.</li>\n<li>Asynchronous communication &amp; collaboration &#8211; We have team members all over the world. We don’t expect anyone to work untraditional hours, that means our default is async. Most teams have 2-5 hours of internal meetings weekly.</li>\n<li>Appreciation for Deep Work &#8211; During your normal work day, not after a day a meetings!</li>\n<li>Autonomy &amp; Freedom &#8211; Create a work environment that is sustainable for you. We place a high amount of trust and responsibility with our team members from the start.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<div>Working from 22+ countries, we’re a collection of talented humans rich in diverse backgrounds, lifestyles, and cultures. Close has been 100% remote since 2016, creating an intentional workplace around asynchronous communication and collaboration. Every year we meet up somewhere around the world to spend time with one another. These gatherings are an opportunity to strengthen the relationships within our global community.</div>\n<div></div>\n<div>We practice a mature approach to the workplace &#8212; manage your time effectively, communicate thoughtfully with your teammates and customers, and produce high quality work. We have impressive tenure amongst the team; we stay at Close because we love working with our colleagues, we appreciate the autonomy and we thrive in an environment that challenges us to do our best work.</div>\n<div></div>\n<div>Unanimously, our favorite value is “Build a house you want to live in.” We make decisions that are rooted in helping our customers become more successful. We care equally about the health of our business and the wellbeing of our people.</div>\n<div></div>\n<div><i>Our application process was designed to promote equitable and unbiased hiring practices. We ask a small series of questions that are similar to what would be asked in the first interview. This helps us learn more about you right from the start so please be sure to answer each question thoughtfully. Each application will receive two screens by two different reviewers. Regardless of fit, you will hear back from us letting you know if we&#8217;ll be moving forward.</i></div>\n</div>\n</div>",
      "pubDate": "2024-02-15 07:35:34"
    },
    {
      "id": 89579,
      "url": "https://jobicy.com/jobs/89579-frontend-engineer-3",
      "jobSlug": "89579-frontend-engineer-3",
      "jobTitle": "Frontend Engineer",
      "companyName": "Chameleon",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/01/WRILS-210110043732-738929.jpg",
      "jobIndustry": [
        "Software Engineering"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Brazil,  Canada,  USA",
      "jobLevel": "Any",
      "jobExcerpt": "We are concurrently hiring another designer, and another PM so we can build two pods of work (core and growth/new). We raised a Series A last year after years of bootstrapped and sustainable growth, so are in a financially strong position. We have never conducted layoffs and believe in thoughtful hiring. We are looking for&#8230;",
      "jobDescription": "<p>We are concurrently hiring another designer, and another PM so we can build two pods of work (core and growth/new).</p>\n<p>We raised a Series A last year after years of bootstrapped and sustainable growth, so are in a financially strong position. We have never conducted layoffs and believe in thoughtful hiring.</p>\n<p>We are looking for a <strong>Frontend Engineer</strong> who excels in a fast pace remote environment, is enthusiastic about building excellent software, and enjoys tackling a diverse range of problems.</p>\n<p>Users now expect personalized software, catering to their specific needs and context. This is hard to build and manage at scale, but the companies that succeed with this product-led approach are the winners. This provides us the opportunity to create a category-shaping company that is a part of every company’s product stack! </p>\n<h2>What your day might include (+our stack)</h2>\n<p>You will be primarily working closely with the Product team (~10 Engineers, 3 QAs, 1 PM, 2 designers) on our <strong>React</strong> web-app.</p>\n<ul>\n<li>Collaborating with the Product team to review product specs (Notion)</li>\n<li>Review designs and help shape the eventual UX of new features (Figma)</li>\n<li>Work on your Sprint backlog; highlight your questions, document your progress (Trello)</li>\n<li>Review pull requests of other engineers (Github)</li>\n<li>Record “product walk” videos to solicit feedback and to show off newly built things (Loom)</li>\n<li>Low-latency pairing with other Engineers to make progress with the high context (Tuple)</li>\n<li>2-3 scheduled calls per week (<em>yes only 2-3</em> ) everything else covered ad-hoc, async, through peer pairing or monthly 1-1s with your manager (Slack, Google Meet, Lattice)</li>\n<li>Work on our customer dashboard building new UI/UX (React, Rails, Node.js)\n<ul>\n<li>Create, build and maintain reusable React components</li>\n<li>Write testable well documented code (Cypress, Jest)</li>\n<li>Make customer experience with Chameleon memorable and lovable</li>\n<li>Support keeping our platform secure and reliable (MongoDB, Heroku, AWS)</li>\n</ul>\n</li>\n</ul>\n<h2>Skills and experience that will aid success in this role</h2>\n<ul>\n<li><strong>4+ years</strong> working full-time as an Engineer and <strong>2+ years</strong> of React experience</li>\n<li>Experience collaborating with other Engineers</li>\n<li>Fluency with React / JS / HTML / CSS. Opinionated about the right way to JS.</li>\n<li>Independent and self-motivated mindset; proactive in finding solutions while able to structure your own work with minimal management</li>\n<li>Be able to provide guidance and answers the first time, see blind spots and complexity before it impacts the flow of work</li>\n</ul>\n<h2>Other requirements</h2>\n<ul>\n<li>You have a fully functioning workstation and a quiet place to work (and take calls) with a high-speed internet connection (we’ll send you a new M2 Macbook air with 16GB ram)</li>\n<li>You are located in the US , Canada , or Brazil </li>\n<li>Fluency (written and verbal) in English</li>\n</ul>\n<h2>Timeline</h2>\n<p>We expect to reply to you within ~1 week of you submitting the application form <strong>IF</strong> we are interested in setting up a call. Once we agree on the offer, we hope you can begin as soon as possible!</p>",
      "pubDate": "2024-02-15 07:34:46"
    },
    {
      "id": 103132,
      "url": "https://jobicy.com/jobs/103132-senior-software-engineer-cloud",
      "jobSlug": "103132-senior-software-engineer-cloud",
      "jobTitle": "Senior Software Engineer - Cloud",
      "companyName": "Oracle",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/08/30162ed78b6c10f731411f2fc440c24f.png",
      "jobIndustry": [
        "Software Engineering"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Senior",
      "jobExcerpt": "Building off our Cloud momentum, Oracle has formed a new organization &#8211; Oracle Health Data Intelligence. This team will focus on product development and product strategy for Oracle Health, while building out a complete platform supporting modernized, automated healthcare. This is a net new line of business, constructed with an entrepreneurial spirit that promotes an energetic&#8230;",
      "jobDescription": "<div class=\"cc-row\">\n<div class=\"cc-row__content cc-columns-count-1\" data-bind=\"class: 'cc-columns-count-' + columns.length\">\n<div class=\"cc-column cc-column--default\" data-bind=\"style: { backgroundColor: params.backgroundColor, backgroundImage: backgroundSrc }, class: 'cc-column--' + size()\">\n<div class=\"cc-column__content\">\n<div class=\"component-styling-wrapper-108030\" data-bind=\"class: uniqueWrapperClass\">\n<div class=\"job-details__section\" data-bind=\" class: customizationParams.commonParams.cssClass, attr: { id: customizationParams.commonParams.cssId }, customStyles: customizationParams.commonParams, \">\n<div class=\"job-details__description-content basic-formatter\" data-bind=\"html: pageData().job.description\">\n<p>Building off our Cloud momentum, Oracle has formed a new organization &#8211; Oracle Health Data Intelligence. This team will focus on product development and product strategy for Oracle Health, while building out a complete platform supporting modernized, automated healthcare. This is a net new line of business, constructed with an entrepreneurial spirit that promotes an energetic and creative environment. We are unencumbered and will need your contribution to make it a world class engineering center with the focus on excellence.</p>\n<p>Oracle Health Data Intelligence has a rare opportunity to play a meaningful role in how Oracle Health products impact and disrupt the healthcare industry by transforming how healthcare and technology intersect.</p>\n<p><strong>You will have the opportunity to:</strong></p>\n<ul>\n<li>Reach billions of people with our products &amp; services</li>\n<li>Create technology in which truly impacts the world</li>\n<li>Ability to have immediate impact on developing technology</li>\n<li>Unlimited growth potential with inspiring work</li>\n<li>Work with the best minds in the industry</li>\n<li>Enjoy working in an open, diverse, and productive environment</li>\n</ul>\n<h2><strong>About the Job</strong></h2>\n<p>Oracle Health Data Intelligence is growing and looking for a Senior Software Engineer to join the HealtheIntent – HealtheRegistries Platform Team – HealtheRegistries aggregates data across multiple disparate sources and normalizes the data, enabling advanced decision support, predictive algorithms, population identification, and advanced analytics.</p>\n<h2><strong>What You&#8217;ll Do</strong></h2>\n<p>As a member of the software engineering division, you will apply intermediate to advanced knowledge of software architecture to perform software development tasks associated with developing, debugging, or designing software applications or operating systems according to provided design specifications. Build enhancements within an existing software architecture and suggest improvements to the architecture. Work involves problem solving, understanding, and applying company policies and processes.</p>\n<ul>\n<li>High level of fluency with Java, C++, C#, Python, etc.</li>\n<li>Experience working with distributed systems.</li>\n<li>Experience building cloud-based platforms that enable application design like AWS, GCP, Azure, OCI, etc.</li>\n<li>Experience working with large, enterprise, scalable applications</li>\n<li>Experience building and maintaining RESTful APIs</li>\n<li>Experience in working with big data processing tools like spark, hive, presto, etc.</li>\n<li>Experience using RSpec to write tests ensuring code meets quality standards.</li>\n<li>Experience using Active Record to interact with database and perform data modeling.</li>\n<li>Intimate, working understanding of modern web applications from database to user interface.</li>\n<li>Proficient in object-oriented programming and MVC architecture</li>\n<li>Expertise in writing well-modularized, maintainable software.</li>\n<li>Excellent communication skills in both technical and non-technical contexts</li>\n<li>Experience building cloud-based platforms that enable application design, development, testing, and distribution.</li>\n</ul>\n<h2><strong>Knowledge of</strong>:</h2>\n<ul>\n<li>Knowledge of design patterns and SOLID principles</li>\n<li>Knowledge of DevOps technologies such as Jenkins, Kubernetes, Spinnaker, Maven etc.</li>\n<li>Knowledge of software engineering best practices across the development lifecycle, including agile methodologies, coding standards, code reviews, source management, build processes, testing, and operations.</li>\n<li>Familiarity with technologies and design concepts around Big Data Processing and Relational Databases such as: ETL, Hadoop Ecosystem, structured data, SQL schemas and queries etc.</li>\n<li>Familiarity with micro-services architecture</li>\n</ul>\n<h2><strong>Required Qualifications:</strong></h2>\n<ul>\n<li>4+ years of technical experience relevant to this position</li>\n<li>Ability to communicate effectively and build rapport with team members</li>\n<li>BS or MS in Computer Science, or equivalent</li>\n</ul>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<div class=\"cc-row\">\n<div class=\"cc-row__content cc-columns-count-1\" data-bind=\"class: 'cc-columns-count-' + columns.length\">\n<div class=\"cc-column cc-column--default\" data-bind=\"style: { backgroundColor: params.backgroundColor, backgroundImage: backgroundSrc }, class: 'cc-column--' + size()\">\n<div class=\"cc-column__content\">\n<div class=\"component-styling-wrapper-108042\" data-bind=\"class: uniqueWrapperClass\">\n<div class=\"job-details__section\" data-bind=\" class: customizationParams.commonParams.cssClass, attr: { id: customizationParams.commonParams.cssId }, customStyles: customizationParams.commonParams, \">\n<h2 class=\"job-details__description-header text-color-secondary font-family-secondary\" data-bind=\"i18n: 'job-details.job-qualifications-title'\">Qualifications</h2>\n<div class=\"job-details__description-content basic-formatter\" data-bind=\"html: pageData().job.qualifications\">\n<p>Disclaimer:</p>\n<p><b>Certain US customer or client-facing roles may be required to comply with applicable requirements, such as immunization and occupational health mandates.</b></p>\n<p><b>Range and benefit information provided in this posting are specific to the stated locations only</b></p>\n<p>US: Hiring Range: from $74,800 to $178,200 per annum. May be eligible for bonus and equity.</p>\n<p>Oracle maintains broad salary ranges for its roles in order to account for variations in knowledge, skills, experience, market conditions and locations, as well as reflect Oracle’s differing products, industries and lines of business.<br />\nCandidates are typically placed into the range based on the preceding factors as well as internal peer equity.</p>\n<p>Oracle US offers a comprehensive benefits package which includes the following:<br />\n1. Medical, dental, and vision insurance, including expert medical opinion<br />\n2. Short term disability and long term disability<br />\n3. Life insurance and AD&amp;D<br />\n4. Supplemental life insurance (Employee/Spouse/Child)<br />\n5. Health care and dependent care Flexible Spending Accounts<br />\n6. Pre-tax commuter and parking benefits<br />\n7. 401(k) Savings and Investment Plan with company match<br />\n8. Paid time off: Flexible Vacation is provided to all eligible employees assigned to a salaried (non-overtime eligible) position. Accrued Vacation is provided to all other employees eligible for vacation benefits. For employees working at least 35 hours per week, the vacation accrual rate is 13 days annually for the first three years of employment and 18 days annually for subsequent years of employment. Vacation accrual is prorated for employees working between 20 and 34 hours per week. Employees working fewer than 20 hours per week are not eligible for vacation.<br />\n9. 11 paid holidays<br />\n10. Paid sick leave: 72 hours of paid sick leave upon date of hire. Refreshes each calendar year. Unused balance will carry over each year up to a maximum cap of 112 hours.<br />\n11. Paid parental leave<br />\n12. Adoption assistance<br />\n13. Employee Stock Purchase Plan<br />\n14. Financial planning and group legal<br />\n15. Voluntary benefits including auto, homeowner and pet insurance</p>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>",
      "pubDate": "2024-02-15 07:32:33",
      "annualSalaryMin": "74800",
      "annualSalaryMax": "178200",
      "salaryCurrency": "USD"
    },
    {
      "id": 103136,
      "url": "https://jobicy.com/jobs/103136-spain-community-operations",
      "jobSlug": "103136-spain-community-operations",
      "jobTitle": "Spain Community Operations",
      "companyName": "Reddit",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/Reddit.jpg",
      "jobIndustry": [
        "Product &amp; Operations"
      ],
      "jobType": [
        "contract"
      ],
      "jobGeo": "Spain",
      "jobLevel": "Any",
      "jobExcerpt": "Reddit is a community of communities where people can dive into anything through experiences built around their interests, hobbies, and passions. Our mission is to bring community, belonging, and empowerment to everyone in the world. Reddit users submit, vote, and comment on content, stories, and discussions about the topics they care about the most. From&#8230;",
      "jobDescription": "<div class=\"content-intro\">\n<p>Reddit is a community of communities where people can dive into anything through experiences built around their interests, hobbies, and passions. Our mission is to bring community, belonging, and empowerment to everyone in the world. Reddit users submit, vote, and comment on content, stories, and discussions about the topics they care about the most. From pets to parenting, with over 100,000 active communities and over 70 million daily active users, it is home to the most open and authentic conversations on the internet. For more information, visit redditinc.com.</p>\n</div>\n<p><strong>This is a contract role.</strong></p>\n<p>We are searching for a strategic community management and operations expert to join the International Community team and help grow Reddit outside of the US. As an integral part of the Product organization, the International Community team plays a key role in helping Reddit realize its mission: bringing community and belonging to <em>everyone in the world</em>.</p>\n<p>As the Spain Community Operations, you will be at the forefront of jumpstarting and fostering local communities. Your fluency in Spanish, coupled with your in-depth understanding of Spanish-speaking communities, positions you as an expert capable of spearheading initiatives to connect with local volunteer moderators on the platform. Your insights and the initiatives you launch in the market will be instrumental in refining, iterating, and scaling our international consumer playbook. The insights derived from your relationships and experiments will help accelerate our growth in Spain.</p>\n<p>As one of the first employees in Spain, this is a rare opportunity to join a new team at one of the most influential consumer products on the internet. If developing and proving out a community relations and growth playbook <strong>in close tandem with Product</strong> that unlocks the next hundreds of millions of global Redditors excites you, then you’ve found the right place!</p>\n<h2><strong>Responsibilities</strong>:</h2>\n<ul>\n<li>Be a public face with our local volunteer moderators to build trust and drive engagement, mediating conflicts and helping drive solutions</li>\n<li>Cultivate, recruit, educate, and grow a local community of moderators, content creators, influencers, etc.</li>\n<li>Gain a deep understanding and specialized market knowledge to understand user and moderator pain points, competitors, and market opportunity</li>\n<li>Iterate, innovate, and scale the consumer growth playbook by recognizing new opportunities, suggesting bold ideas, and programs, and persuading internal teams to align on new plans</li>\n<li>Communicate quantitative and qualitative insights to optimize and improve the international consumer growth playbook</li>\n<li>Identify the best channels to seed new communities and increase supply in existing communities: grow verticals of communities using any means at your disposal</li>\n<li>Be obsessive about achieving aggressive goals and outcomes</li>\n<li>Run reports, build dashboards, analyze data, set KPIs, and execute impactful community initiatives</li>\n<li>Work cross-functionally with Product, Community, Engineering, Marketing, Safety, and BD</li>\n</ul>\n<h2><strong>What We Can Expect From You:</strong></h2>\n<ul>\n<li>2-3 years of operations management, product consulting, community operations, or tech background</li>\n<li>A healthy blend of operations, growth, project management, and community management expertise</li>\n<li>Deep knowledge and understanding of Spanish culture, including current events, politics, customs, traditions, language, topics of interest, taboos, etc.</li>\n<li>Data-driven and analytical mindset to assess process performance and financial viability (excel modeling skills necessary, SQL knowledge helpful)</li>\n<li>Succinct and persuasive communicator: collaborate effectively across internal teams, local users, moderators, partners, content creators, influencers, etc.</li>\n<li>Results-obsessed: outstanding execution and high attention to detail</li>\n<li>Deep interest in developing and driving independent projects, framing issues, testing hypotheses, and iterating on process improvements</li>\n<li>Proficiency in both Spanish and English and resident of Spain</li>\n</ul>\n<h2><strong>Bonus Points:</strong></h2>\n<ul>\n<li>Engineering, product or similar technical background</li>\n<li>Proficient in SQL</li>\n</ul>",
      "pubDate": "2024-02-15 07:27:00"
    },
    {
      "id": 103131,
      "url": "https://jobicy.com/jobs/103131-content-writer-ai-researcher",
      "jobSlug": "103131-content-writer-ai-researcher",
      "jobTitle": "Content Writer (AI Researcher)",
      "companyName": "Blavity",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/c4139b3e6879448bfada1ac3306695ba.jpg",
      "jobIndustry": [
        "Copywriting &amp; Content"
      ],
      "jobType": [
        "contract"
      ],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "Blavity, Inc. is a venture-funded media and technology company, founded in 2014 around a simple idea: enable Black millennials to tell their own stories. Today, we are home to the largest network of platforms and lifestyle brands serving the multifaceted lives of Black millennials &amp; Gen Z through original content, video, unique experiences, and product&#8230;",
      "jobDescription": "<p>Blavity, Inc. is a venture-funded media and technology company, founded in 2014 around a simple idea: enable Black millennials to tell their own stories. Today, we are home to the largest network of platforms and lifestyle brands serving the multifaceted lives of Black millennials &amp; Gen Z through original content, video, unique experiences, and product solutions. Blavity Inc. has evolved into a market leader for Black media, reaching 250 million users per month through our growing brand portfolio, including Blavity, Blavity360º, AfroTech, Talent Infusion, 21Ninety, Travel Noire, Home &amp; Texture, and Blavity House Party. Our Blavity, Inc. employee community is composed of passionate, energetic, and culturally conscious individuals working together to deliver value to each other, the company, and our clients. We are always searching for new additions to our community that will help us continue to scale, contribute meaningfully to our culture, and advance our strategic direction.</p>\n<h2>Job Summary:</h2>\n<p>Blavity Inc. seeks a tech-savvy Content Writer (AI Researcher) to join our editorial team in an impactful role harnessing the power of AI to enhance and expedite writing. The Content Writer (AI Researcher) will focus on integrating the latest Artificial Intelligence tools into our research, drafting, and publishing processes to reduce production time frames while expanding creative boundaries.</p>\n<p>This position is a (1099) contractor.<br />\nThis role will report directly to the SEO Editor and the Associate Director of SEO.</p>\n<p>Contractors will be responsible for providing their own equipment, including but not limited to laptop computers, cell phones, or any other electronic equipment required to perform their role.</p>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Employ AI assistants for rapid information discovery and context-building on assigned topics</li>\n<li>Leverage AI drafting capabilities for foundational content structure and voice</li>\n<li>Validate AI-generated outputs for factual reliability, ethical standards, and brand alignment</li>\n<li>Ensure that content is structured and well optimized for performance and adheres to SEO best practices</li>\n</ul>\n<h2>Qualifications:</h2>\n<ul>\n<li>Education: Bachelor&#8217;s Degree</li>\n<li>Required Experience:\n<ul>\n<li>1+ years experience using WordPress (or other Content Management Systems) to author, publish, and edit content</li>\n<li>Knowledge of the latest AP Style guidelines and best practices for writing online</li>\n<li>Basic understanding of core SEO concepts</li>\n<li>Exemplary writing and content creation skills as demonstrated by an online portfolio</li>\n<li>Command balancing automation efficiencies with human creativity and oversight</li>\n<li>Diligence vetting usage against misinformation and plagiarism risks</li>\n</ul>\n</li>\n<li>Preferred Experience:\n<ul>\n<li>2+ years of writing</li>\n<li>Prior experience updating content or working with a digital publisher</li>\n</ul>\n</li>\n<li>Technologies: Fluent in Google Suite, Asana and WordPress CMS or comparable Content Management System</li>\n<li>Additional Qualifications:\n<ul>\n<li>Excellent organization and time management skills, with the ability to manage multiple projects simultaneously</li>\n<li>Ability to work both independently and collaboratively with a positive, can-do approach</li>\n<li>Comfort performing research to ensure our information is accurate and highly useful to readers</li>\n<li>Entrepreneurial self-starter who is comfortable taking on a high level of responsibility</li>\n<li>Motivated to work hard in a fast-paced environment</li>\n<li>Excellent communication and analytical skills; willing to wear multiple hats</li>\n<li>A healthy appreciation of GIFs and Black culture</li>\n</ul>\n</li>\n</ul>\n<h2>Details:</h2>\n<ul>\n<li>This is a fully remote role, occasional travel may be required.</li>\n<li>Candidates must be available to work at least 80% in alignment with the Eastern Time Zone.</li>\n<li>The hourly rate for this role is $15 &#8211; $20.</li>\n</ul>",
      "pubDate": "2024-02-15 07:22:14"
    },
    {
      "id": 79923,
      "url": "https://jobicy.com/jobs/79923-account-manager-sales",
      "jobSlug": "79923-account-manager-sales",
      "jobTitle": "Account Executive",
      "companyName": "WorkWave",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/78458cfe50d13ec79a5afc7a7a557272.jpeg",
      "jobIndustry": [
        "Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "We empower our Field Service, Pest Control, Logistics customers, and more to reach their full potential with powerful software (SaaS). WorkWave is looking for a driven Account Executive that possesses strong consultative and presentation skills. In this role, you will understand how our client&#8217;s field service companies operate and speak to their common business objectives. You will&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div class=\"section page-centered\" data-qa=\"job-description\">\n<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>We empower our Field Service, Pest Control, Logistics customers, and more to reach their full potential with powerful software (SaaS). WorkWave is looking for a driven <b>Account Executive</b> that possesses strong consultative and presentation skills. In this role, you will understand how our client&#8217;s field service companies operate and speak to their common business objectives. You will be responsible for learning how to navigate a Field Service software solution, provide online demonstrations, and consistently achieve a monthly quota.</div>\n<div></div>\n<div>If you are great at what you do, creative in your approach, and passionate about sales, come join an amazing team in a fun, open environment.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>WHAT YOU&#8217;LL DO:</h2>\n<ul>\n<li>Conduct discovery calls to consult with prospect&#8217;s on business objectives</li>\n<li>Educate customers on how our solution will drive the success of their business</li>\n<li>Prepare and deliver product demonstrations, solution recommendations, and close deals</li>\n<li>Achieve a monthly reoccurring revenue quota</li>\n<li>Create opportunities through proactive effort including but not limited to cold calling, emailing, lead generation, and networking</li>\n<li>Build and maintain sales pipeline, sales contracts, within a CRM System (Salesforce.com).</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>WHAT YOU&#8217;LL NEED:</h2>\n<ul>\n<li>2+ years of proven success as a sales representative</li>\n<li>Excellent communication, negotiation, and interpersonal skills</li>\n<li>Ability to act independently, multi-task, and handle prospective clients and issues simultaneously</li>\n<li>Experience driving a sales pipeline</li>\n<li>Bachelor&#8217;s degree or equivalent experience</li>\n<li>Experience selling within the field service or T&amp;L industries is a plus</li>\n<li>This is an inside sales role</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<div><i>Currently not accepting candidates located in NY for this position.</i></div>\n<h2><b>A GLOBAL COMPANY WITH A LOCAL PRESENCE:</b></h2>\n<div> • We know that there are benefits of being in the office and working from home.  WorkWave promotes a healthy work/life balance and provides employees with the flexibility of collaborating in the office or the option to work virtually if desired.</div>\n<div>• We have employees in over 30 states, 7 countries and many regional offices &#8211; each with their own set of perks and opportunities to give back to the local community.</div>\n<div>• Whether you work remotely or take advantage of one of our offices, you’ll find a community of WorkWavers that value diversity, and care deeply about our products, clients, our communities and each other.</div>\n<h2><b>LOVE WHAT YOU DO, NO MATTER WHERE YOU DO IT:</b></h2>\n<div>• Our HQ is based at our state of the art home office in the historic Bell Works complex located in Holmdel Township, New Jersey</div>\n<div>• With everything you could find in a great downtown &#8212; from restaurants and retail to art and culture the Bell Works “Metroburb” is a microcosm of innovation, possibility, and inspiration and WorkWave is proud to be a part of it</div>\n<div>• Pharmacy, urgent care, bank, restaurants, florist, gym, dentist, outdoor patio bar and weekly farmers market all conveniently located on the first floor &#8211; making running errands on a break a breeze.</div>\n<div>• We work hard but play hard too&#8230;need a break? When in the office kick back in our common area, play a game of arcade basketball, video games in our game rooms or face off in a ping pong match</div>\n<div><b>WORKING REMOTE? </b>Great! Our teams are well versed at working collaboratively in a fully virtual environment.  We keep our offices available to all to use when working remotely isn’t feasible, or to help with cross training, team building and/or brainstorming.</div>\n<h2><b>RELAX, WE&#8217;VE GOT YOU COVERED:</b></h2>\n<div>• Employees can expect a robust benefits package, including health and dental and 401k with company match</div>\n<h2><b>AND BEYOND&#8230;</b></h2>\n<div>• Find your perfect work/life balance with our Flexible Time Off policy or generous PTO plan (role dependent) and paid holidays</div>\n<div>• Tuition reimbursement</div>\n<div>• Robust Employee Assistance Program through TotalCare offering free counseling 24/7/365, plus financial counseling, legal guidance, adoption assistance services and much more!</div>\n<div>• 24/7 access to virtual medical care with Teladoc</div>\n<div>• Quarterly awards based on peer nominations</div>\n<div>• Regional discounts and perks</div>\n<div>• Opportunities to participate in charitable events and give back to the community</div>\n<h2><b>GROW WITH US:</b></h2>\n<div>• We understand the impact of attracting and keeping top talent and reward intellectual curiosity and a thirst for personal and professional growth</div>\n<div>• Encouraging our employees that already have an intimate knowledge of and passion for our products to apply for other roles within our walls just makes sense!</div>\n<div>• Our employees have access to extensive video libraries for soft skill and role specific training available 24/7 and live trainings are provided throughout the year</div>\n<h2><b>JOIN OUR WINNING TEAM!</b></h2>\n<div>• 10 Time winner of Best Place to Work in New Jersey by NJBiz!</div>\n<div>• WorkWave has been recognized with multiple awards for its outstanding products, growth and culture, including the Inc. 5000, SaaS Award, IT World Awards, Globe Awards, Silver Stevie Award for Employer of the Year, and Best Place to Work Inc. Magazine</div>\n<div>• Recently named one of The Software Report&#8217;s 3rd annual list of the Top 100 Software Companies of 2022 (worldwide!)</div>\n</div>\n</div>\n</div>",
      "pubDate": "2024-02-15 07:20:24"
    },
    {
      "id": 79921,
      "url": "https://jobicy.com/jobs/79921-regional-hr-manager-apac",
      "jobSlug": "79921-regional-hr-manager-apac",
      "jobTitle": "Regional HR Manager - APAC",
      "companyName": "Canonical",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/07/9f3fda2fef6dda85970e12ce9a9b8cbe.png",
      "jobIndustry": [
        "HR &amp; Recruiting"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "APAC",
      "jobLevel": "Any",
      "jobExcerpt": "With 1,000 colleagues across 70​ ​countries, we require an HR function that thinks and acts globally.​ We&#8217;re looking for three regional leads that will all report into our Global Head of People who can help build our company as we go through continued growth plans. It&#8217;s an exciting time to join with the opportunity to&#8230;",
      "jobDescription": "<p>With 1,000 colleagues across 70​ ​countries, we require an HR function that thinks and acts globally.​ We&#8217;re looking for three regional leads that will all report into our Global Head of People who can help build our company as we go through continued growth plans. It&#8217;s an exciting time to join with the opportunity to help shape and create an HR function for the future. You will lead the APAC team of HR professionals to provide precise, compliant and scalable HR operations to the business, advise and execute on HR issues across the whole employee life-cycle, and partner with senior leadership in your region. You will have an analytical approach, a keen eye for detail and the ability to interpret data trends and themes.</p>\n<h2>What your day will look like:</h2>\n<ul>\n<li>Lead and scale Canonical’s regional HR team</li>\n<li>Deliver precise and compliant HR operations in a timely manner and with the highest degree of accuracy</li>\n<li>Interact closely with Talent Acquisition and Workplace Engineering teams and create tight-knit processes across all HR regions</li>\n<li>Be accountable for HR processes such as talent development, succession planning, performance assessments, onboarding, culture and engagement initiatives that drive a high performing team</li>\n<li>Work with senior managers across the business on performance management, organizational design, employee engagement, rewards- and workforce planning</li>\n<li>Coach and advise people managers on the full spectrum of employee relations issues across multiple countries</li>\n<li>Partner with people managers to support the delivery of appropriate training and development programs</li>\n<li>Establish a trusted partnership with the business in your region</li>\n<li>Drive diversity, equity, and inclusion initiatives</li>\n<li>Design new policies and deliver on business-critical HR related projects globally</li>\n<li>Present at Canonical events to articulate Canonical’s HR practices</li>\n</ul>\n<h2>What we are looking for in you:</h2>\n<ul>\n<li>Degree qualified</li>\n<li>HR experience leading initiatives across regions within a technology business</li>\n<li>Labor law experience in Taiwan, Australia, Japan or China</li>\n<li>People management experience</li>\n<li>Experience in business partnering with senior stakeholders</li>\n<li>A good balance between leading and executing, in this role you will need to be hands-on involved in the daily HR routines, too</li>\n<li>Experience in working in a remote first organization</li>\n<li>Able to leverage data to make informed decisions</li>\n<li>Fluent in business English (written and spoken)</li>\n<li>Self motivated, organized, accurate, confident, authentic,  results-orientated, open-minded, enthusiastic and energetic</li>\n<li>Willingness to travel up to 4 times a year for internal events</li>\n</ul>\n<h2><strong>Additional skills that you might also bring:</strong></h2>\n<ul>\n<li>Experience with immigration policies and mobility processes</li>\n<li>Professional HR qualification</li>\n<li>Facilitation skills</li>\n</ul>\n<h2>What we offer you:</h2>\n<p>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits below, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilization. Canonical’s compensation philosophy is to ensure equity right across our global workforce.</p>\n<p>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, please ask your Talent Partner.</p>\n<ul>\n<li> Fully remote working environment &#8211; we’ve been working remotely since 2004!</li>\n<li> Personal learning and development budget of 2,000USD per annum</li>\n<li> Annual compensation review</li>\n<li> Recognition rewards</li>\n<li> Annual holiday leave</li>\n<li> Parental Leave</li>\n<li>‍ Employee Assistance Programme</li>\n<li> Opportunity to travel to new locations to meet colleagues at ‘sprints’</li>\n<li>✈️ Priority Pass for travel and travel upgrades for long haul company events</li>\n</ul>",
      "pubDate": "2024-02-15 07:19:54"
    },
    {
      "id": 18738,
      "url": "https://jobicy.com/jobs/18738-account-executive-18",
      "jobSlug": "18738-account-executive-18",
      "jobTitle": "Account Executive",
      "companyName": "WorkWhile",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201029094500-271242.jpg",
      "jobIndustry": [
        "Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "WorkWhile is on a mission to help workers earn a better living and live better lives. 83 million Americans work hourly jobs, often with unpredictable schedules that pay close to minimum wage and offer limited benefits, leading to financial instability. WorkWhile hires the best hourly workers and matches them with shifts that fit their skills,&#8230;",
      "jobDescription": "<p>WorkWhile is on a mission to help workers earn a better living and live better lives. 83 million Americans work hourly jobs, often with unpredictable schedules that pay close to minimum wage and offer limited benefits, leading to financial instability.</p>\n<p>WorkWhile hires the best hourly workers and matches them with shifts that fit their skills, location, and life. Employers get access to a quality workforce, while employees get stable income and unmatched benefits, including access to credit and savings tools.</p>\n<p>We have the audacious goal to align incentives and solve inefficiencies in the labor market while disrupting the $140BN temporary staffing industry.</p>\n<h2><strong>About the Role:</strong></h2>\n<p>WorkWhile is looking for an experienced Account Executive with a proven track record of success to join our rapidly growing team. This role is responsible for strategic new business sales and expansion. As an Account Executive you will manage all aspects of the sales process including prospecting, lead management, qualification, customer evaluation, closing new business, and expansion. This role will be focusing on the light industrial, hospitality, and retail verticals.</p>\n<p>The ideal candidate must have an entrepreneurial mindset, a hunger for success, and a consultative customer-centric approach.</p>\n<ul>\n<li>Demonstrate a strong business case for WorkWhile through a consultative and value-driven sales process</li>\n<li>Establish a collaborative business relationship between WorkWhile and key decision makers within target accounts</li>\n<li>Meet and exceed your goals through prospecting, qualifying, managing, and closing new sales opportunities</li>\n<li>Partner with account management, operations, and sales development teams to drive revenue</li>\n</ul>\n<h2><strong>About you:</strong></h2>\n<ul>\n<li>3-5+ years of sales experience in a quota carrying, closing role.</li>\n<li>A track record of success – consistently exceeding quota.</li>\n<li>Experiencing breaking down accounts to identify multiple decision makers.</li>\n<li>Strong presentation and communication skills with the ability to influence others over the phone.</li>\n<li>Strategic and creative thinking that enables you to understand industry and customer trends and apply those insights to deliver business results.</li>\n</ul>\n<p>WorkWhile has a diverse, mission-driven, and supportive culture—we look for people who want to take ownership, are energized by ambiguity, and strive to make a lasting impact. If this resonates with you, we’d love to chat!</p>",
      "pubDate": "2024-02-15 07:18:04"
    },
    {
      "id": 11128,
      "url": "https://jobicy.com/jobs/11128-account-manager-6",
      "jobSlug": "11128-account-manager-6",
      "jobTitle": "Sales Development Representative",
      "companyName": "WorkWhile",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201029094500-271242.jpg",
      "jobIndustry": [
        "Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "WorkWhile is looking for an exceptional Sales Development Representative to reach out to potential new clients and set qualified appointments with clear next steps. As an early member of the team you will help create repeatable actions in the daily SDR process that lead to success and shape all aspects of SDR culture. You will&#8230;",
      "jobDescription": "<div class=\"section page-centered\">\n<div class=\"section page-centered\">\n<p>WorkWhile is looking for an exceptional Sales Development Representative to reach out to potential new clients and set qualified appointments with clear next steps. As an early member of the team you will help create repeatable actions in the daily SDR process that lead to success and shape all aspects of SDR culture. You will be responsible for all sales outreach and will partner closely with our sales team to drive success in acquiring new business for WorkWhile.</p>\n<p>WorkWhile has a diverse, mission-driven, and supportive culture—we look for people who want to take ownership, are energized by ambiguity, and strive to make a lasting impact. If this resonates with you, we’d love to chat!</p>\n<p>WorkWhile is an Equal Opportunity Employer. Women, minorities, individuals with disabilities and protected veterans are encouraged to apply.</p>\n<h2><strong>About this role:</strong></h2>\n<ul>\n<li>Manage a list of contacts from different company profiles and reach out to these contacts in a timely manner</li>\n<li>Identify and understand WorkWhile’s ideal potential client and reach out to similar companies.&amp;nbsp;</li>\n<li>Create outreach to companies and contacts in an organized manner by geo location.&amp;nbsp;</li>\n<li>Use outreach tools and job boards to identify new leads and reach out to them via call and email.</li>\n<li>Set qualified appointments by setting the right expectation and finding pain points.</li>\n<li>Exceed monthly appointment setting goals.&lt;/li&gt;&lt;li&gt;Place detailed email and call notes in our CRM for the sales team to make sure that next steps are clear.</li>\n</ul>\n<h2><strong>About you:</strong></h2>\n<ul>\n<li>Goal and solutions-oriented professional who is creative, ambitious.</li>\n<li>Self &#8211; motivated who is hungry and scrappy in finding a way to hit monthly goals.</li>\n<li>Detailed and Organized when setting up priorities for the week and month.</li>\n<li>Able to pick things up quickly and work in a fast paced ever changing environment.</li>\n<li>Someone who is open to new ideas and able to implement and test those ideas.</li>\n</ul>\n</div>\n</div>",
      "pubDate": "2024-02-15 07:17:35"
    },
    {
      "id": 79097,
      "url": "https://jobicy.com/jobs/79097-worker-success-specialist",
      "jobSlug": "79097-worker-success-specialist",
      "jobTitle": "Worker Success Specialist",
      "companyName": "WorkWhile",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201029094500-271242.jpg",
      "jobIndustry": [
        "Technical Support"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "WorkWhile is a worker-first labor platform that connects the best hourly workers with shifts that fit their skills, schedule, and location. We’re looking for an experienced support specialist to help our workers achieve their goals on our platform. As a Worker Success Specialist, you’ll be responsible for managing incoming support requests and designing outreach to&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<p>WorkWhile is a worker-first labor platform that connects the best hourly workers with shifts that fit their skills, schedule, and location. We’re looking for an experienced support specialist to help our workers achieve their goals on our platform. As a Worker Success Specialist, you’ll be responsible for managing incoming support requests and designing outreach to help workers.</p>\n<p>WorkWhile is an Equal Opportunity Employer. Women, minorities, individuals with disabilities and protected veterans are encouraged to apply.</p>\n<h2><strong>About the Job:</strong></h2>\n<ul>\n<li>Provide best-in-class support to workers on the WorkWhile platform</li>\n<li>Manage support tickets and troubleshoot technical issues</li>\n<li>Document and communicate feedback to the rest of the team about the worker experience to help inform improvements to product and processes</li>\n<li>Communicate new opportunities to workers</li>\n<li>Work in tandem with Operations to achieve business objectives</li>\n</ul>\n<h2><strong>About you:</strong></h2>\n<ul>\n<li>Passionate about helping hourly workers earn a better living</li>\n<li>2-3 years of experience in customer support or service for a technology company</li>\n<li>An extroverted people person who loves helping folks achieve their goals</li>\n<li>Comfortable with support ticketing systems and technology in general</li>\n<li>Excellent verbal and written communication skills.</li>\n<li>Fluent in emoji</li>\n<li>College degree a plus</li>\n</ul>\n</div>",
      "pubDate": "2024-02-15 07:17:17"
    },
    {
      "id": 16835,
      "url": "https://jobicy.com/jobs/16835-technical-writer-17",
      "jobSlug": "16835-technical-writer-17",
      "jobTitle": "Technical Writer",
      "companyName": "Designit",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/0802726040e35f2f86749890d2cbb6ba.jpeg",
      "jobIndustry": [
        "Copywriting &amp; Content"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "LATAM,  Brazil,  Canada,  USA",
      "jobLevel": "Any",
      "jobExcerpt": "Want to be part of an amazing team, hell-bent on crafting a better future? We’re always looking for creative people who care! We are analysts. Creators. Designers. Doers. Dreamers. Explorers. Geeks. Hipsters. Leaders. Learners. Renegades. Seekers. Strategists. Visionaries. And we fundamentally believe that we’re better together. We are looking for a Technical Writer to join our tech&#8230;",
      "jobDescription": "<p style=\"font-weight: 400;\">Want to be part of an amazing team, hell-bent on crafting a better future? We’re always looking for creative people who care!</p>\n<p style=\"font-weight: 400;\">We are analysts. Creators. Designers. Doers. Dreamers. Explorers. Geeks. Hipsters. Leaders. Learners. Renegades. Seekers. Strategists. Visionaries. And we fundamentally believe that we’re better together.</p>\n<p style=\"font-weight: 400;\">We are looking for a <strong>Technical Writer</strong> to join our tech client’s commercial enterprise services team and write content focused on Security, Compliance, and Trust.</p>\n<h2 style=\"font-weight: 400;\"><strong>Would you like to</strong></h2>\n<ul style=\"font-weight: 400;\">\n<li>Research, design, develop, and write technical content including blogs, white papers, etc.</li>\n<li>Produce documentation that complies with documentation plan requirements.</li>\n<li>Develop and test user scenarios that show how to use the product being documented.</li>\n<li>Obtain technical information from variety of project owners; convert specific feedback into documentation.</li>\n<li>Respond to editorial and reviewer feedback.</li>\n</ul>\n<h2 style=\"font-weight: 400;\"><strong>We would like you to have</strong></h2>\n<ul style=\"font-weight: 400;\">\n<li>5+ years of technical writing experience</li>\n<li>5+ years of program management experience</li>\n<li>5+ years of experience in security/compliance/trust</li>\n<li>Experience working for an enterprise technology company is preferred.</li>\n<li>Experience with Azure, Dynamics 365, Power Platform, and Microsoft 365 is a plus.</li>\n</ul>\n<h2 style=\"font-weight: 400;\"><strong>Would you like to work for an organization that</strong></h2>\n<ul style=\"font-weight: 400;\">\n<li>Embraces work-life balance – our employees’ well-being remains a top priority for us</li>\n<li>Promotes a culture of learning and advocacy across the globe &#8211; diversity will enable us to strengthen our impact</li>\n<li>Offers a comprehensive benefits package effective Day 1. Options include health, vision, &amp; dental insurance, FSAs, discounts on pet insurance, PTO, paid holidays, and more</li>\n<li>Encourages innovation and experimentation</li>\n<li>Emphasizes and rewards collaboration</li>\n<li>Works remotely. We continue to safeguard the health of our employees so our interviewing and on-boarding process will remain virtual until further notice</li>\n</ul>\n<p><em>Designit is committed to ensuring that all candidates have an equal opportunity to be considered for employment. Please let us know if you need any reasonable accommodation to participate in the job application or interview process.</em></p>",
      "pubDate": "2024-02-15 07:16:05"
    },
    {
      "id": 74537,
      "url": "https://jobicy.com/jobs/74537-senior-revenue-accountant-4",
      "jobSlug": "74537-senior-revenue-accountant-4",
      "jobTitle": "Director, Financial Data",
      "companyName": "Instacart",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/03/fe39c2bc9bb5ebb0b5e24318b1f3b60d.jpeg",
      "jobIndustry": [
        "Finance &amp; Legal"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Director",
      "jobExcerpt": "We&#8217;re seeking a talented leader who is passionate about enabling our business through data to join our team and help us build, operate, and maintain the foundational datasets and pipelines we need for robust financial reporting, analysis, and business decision-making. This is an exciting opportunity to join the team as we establish the foundation for this&#8230;",
      "jobDescription": "<p>We&#8217;re seeking a talented leader who is passionate about enabling our business through data to join our team and help us build, operate, and maintain the foundational datasets and pipelines we need for robust financial reporting, analysis, and business decision-making. This is an exciting opportunity to join the team as we establish the foundation for this critical capability.</p>\n<p>In this leadership position reporting to the Senior Director of Financial Systems &amp; Solutions within the CFO organization, you will be responsible for maintaining a strong relationship with partners in the finance team, platform engineering, and CISO, and leading a team to design, support, and scale a growing number of finance- and accounting-related data products where accuracy, completeness, immutability, and timeliness are key to success.</p>\n<h2><strong>ABOUT THE JOB:</strong></h2>\n<ul>\n<li>Manages departmental strategic plan (3yr), annual plan/forecasting, and capital budgeting process.</li>\n<li>Lead, inspire, and develop a growing team of engineers and analysts.</li>\n<li>Refine, build, and own detailed financial models that forecast and analyze operations in order to understand variances and opportunities to improve forecast accuracy.</li>\n<li>Act as the primary point of contact for internal and external auditors regarding data engineering and related SOX compliance matters.</li>\n<li>Coordinate and support audits, provide necessary documentation, evidence, and explanations of data-related controls and processes.</li>\n<li>Serve as a technical partner to CAO and VP-Strategic Finance. Provide thought leadership along with financial technology &amp; process support to effectively and efficiently deliver finance product strategy as well as establish and enforce data governance policies and standards for the finance department.</li>\n<li>Collaborate with key stakeholders to establish financial products and operational objectives. Develop and standardize reporting structures, success metrics, and KPIs to facilitate informed decision-making and promote operational excellence.</li>\n<li>Partner with the Controllership Organization to ensure a timely and accurate monthly close process, assuring Accuracy and Completeness and root-cause the origin of any variation between systems.</li>\n<li>Implement and oversee the monthly team retrospective review process. Take the lead in reporting on critical operational and financial areas of importance.</li>\n</ul>\n<h2><strong>ABOUT YOU:</strong></h2>\n<p><strong>Minimum Qualifications:</strong></p>\n<ul>\n<li>3-5+ years of hands-on experience with transactional data on AWS or similar.</li>\n<li>5+ years supporting and partnering with a fast-paced Accounting team.</li>\n<li>Experience integrating multiple software platforms and systems (e.g. Snowflake, S3, Marqeta, Oracle).</li>\n<li>Demonstrates full understanding of AWS data platform stacks.</li>\n<li>Strong analytical and problem resolution skills, including ability to research and simplify complex issues.</li>\n<li>Advanced analytical skills, report and management dashboard reporting experience (Tableau, Mode, Adaptive).</li>\n<li>Proven track record in building and managing SOX compliant financial data pipelines in cloud environments. Revenue pipeline experience on AWS is preferred.</li>\n<li>Deep knowledge of forecasting tools such as Adaptive as well as supporting forecasting models.</li>\n<li>Experience working closely with an Accounting team to improve the timing and quality of monthly financial reporting and analysis.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Experience in evaluating and selecting appropriate cloud-based technologies and tools to support the finance data infrastructure.</li>\n<li>Demonstrate expertise in financial applications such as Oracle ERP especially the ledger (General Ledger and Chart of Accounts) and subledger models (Accounts Payable, Accounts receivable, Assets) and movement of those transactions through a Data Warehouse.</li>\n<li>Possess knowledge of the gig economy and other on-line business models, including working with common payments partners such as Stripe, Braintree, and Paypal.</li>\n<li>Ability to Identify opportunities to leverage technology to solve business problems. Drive efficiency through finance processes by automating, simplifying, or eliminating routine work.</li>\n<li>Demonstrate experience as a manager of managers, overseeing and effectively managing a team of engineers.</li>\n<li>Experience in multi-unit/legal entities, multi-currency, and complex organizations.</li>\n</ul>\n<div class=\"content-pay-transparency\">\n<div class=\"pay-input\">\n<div class=\"description\">\n<p>Instacart provides highly market-competitive compensation and benefits in each location where our employees work. This role is remote and the base pay range for a successful candidate is dependent on their permanent work location.</p>\n<p>Offers may vary based on many factors, such as candidate experience and skills required for the role. Additionally, this role is eligible for a new hire equity grant as well as annual refresh grants.</p>\n<p>For US based candidates, the base pay ranges for a successful candidate are listed below.</p>\n</div>\n<div class=\"title\">CA, NY, CT, NJ $234,000<span class=\"divider\">—</span>$260,000 USD</div>\n</div>\n<div class=\"pay-input\">\n<div class=\"title\">WA $225,000<span class=\"divider\">—</span>$250,000 USD</div>\n</div>\n<div class=\"pay-input\">\n<div class=\"title\">OR, DE, ME, MA, MD, NH, RI, VT, DC, PA, VA, CO, TX, IL, HI $215,000<span class=\"divider\">—</span>$239,000 USD</div>\n</div>\n<div class=\"pay-input\">\n<div class=\"title\">All other states $194,000<span class=\"divider\">—</span>$216,000 USD</div>\n</div>\n</div>",
      "pubDate": "2024-02-15 07:14:20"
    },
    {
      "id": 8708,
      "url": "https://jobicy.com/jobs/8708-associate-editor-2",
      "jobSlug": "8708-associate-editor-2",
      "jobTitle": "Consumer Content Writer",
      "companyName": "Codeless.io",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/21f759d43ad670141fe720f4585f5363.png",
      "jobIndustry": [
        "Copywriting &amp; Content"
      ],
      "jobType": [
        "part-time"
      ],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "Hi there! Codeless is a content production agency looking to add depth to our writer bench. We&#8217;re looking for committed freelance writers with experience in the general business and HR space. You&#8217;d be writing 1000-2000-word pieces for a number of industry-leading clients, often interview guides, job descriptions, etc. Please provide links to recent examples of published&#8230;",
      "jobDescription": "<p>Hi there! Codeless is a content production agency looking to add depth to our writer bench.</p>\n<p>We&#8217;re looking for committed freelance writers with experience in the general business and HR space.</p>\n<p>You&#8217;d be writing 1000-2000-word pieces for a number of industry-leading clients, often interview guides, job descriptions, etc.</p>\n<p>Please provide links to recent examples of published content.</p>\n<h2><strong>Things to note</strong></h2>\n<ul>\n<li>If you&#8217;re hired, we&#8217;ll provide you with a clear writing process, support documentation for every client, and an awesome editorial team.</li>\n<li>We’re a virtual, remote company. There are no official work hours or vacation days. We’ll try to treat you like an adult who wants to get better every day and will hit deadlines without being babysat. In return, you can work wherever/whenever you want.</li>\n<li>We’ll give you real, hands-on work with big clients.</li>\n<li>We&#8217;re pretty flexible and casual, but we only accept high quality work. We&#8217;re not going to micromanage, so you need to be a responsible self-starter, and a fast learner with a high level of attention to detail.</li>\n</ul>\n<p><em>We look forward to hearing from you!</em><br />\n<em>&#8211; Sarah</em></p>",
      "pubDate": "2024-02-15 07:13:14"
    },
    {
      "id": 97864,
      "url": "https://jobicy.com/jobs/97864-vice-president-of-data-science",
      "jobSlug": "97864-vice-president-of-data-science",
      "jobTitle": "Global VP of Business Intelligence and Data Science",
      "companyName": "TaskUs",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/d67dccb889260879f52b261461b067ca.jpg",
      "jobIndustry": [
        "Data Science"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "TaskUs is a provider of outsourced digital services and next-generation customer experience to fast-growing technology companies, helping its clients represent, protect and grow their brands. Leveraging a cloud-based infrastructure, TaskUs serves clients in the fastest-growing sectors, including social media, e-commerce, gaming, streaming media, food delivery, ride-sharing, HiTech, FinTech, and HealthTech. The People First culture at&#8230;",
      "jobDescription": "<p>TaskUs is a provider of outsourced digital services and next-generation customer experience to fast-growing technology companies, helping its clients represent, protect and grow their brands. Leveraging a cloud-based infrastructure, TaskUs serves clients in the fastest-growing sectors, including social media, e-commerce, gaming, streaming media, food delivery, ride-sharing, HiTech, FinTech, and HealthTech.</p>\n<p>The People First culture at TaskUs has enabled the company to expand its workforce to approximately 45,000 employees globally. Presently, we have a presence in twenty-three locations across twelve countries, which include the Philippines, India, and the United States.</p>\n<p>It started with one ridiculously good idea to create a different breed of Business Processing Outsourcing (BPO)! We at TaskUs understand that achieving growth for our partners requires a culture of constant motion, exploring new technologies, being ready to handle any challenge at a moment’s notice, and mastering consistency in an ever-changing world.</p>\n<p><b><span class=\"emphasis-3\">What We Offer:</span> </b>At TaskUs, we prioritize our employees&#8217; well-being by offering competitive industry salaries and comprehensive benefits packages. Our commitment to a People First culture is reflected in the various departments we have established, including Total Rewards, Wellness, HR, and Diversity. We take pride in our inclusive environment and positive impact on the community. Moreover, we actively encourage internal mobility and professional growth at all stages of an employee&#8217;s career within TaskUs. Join our team today and experience firsthand our dedication to supporting People First.</p>\n<h2><b>Global VP of Business Intelligence and Data Science </b></h2>\n<p>So what does a Global VP of Business Intelligence and Data Science really do? Think of yourself as someone who will re-imagine and orchestrate the successful delivery of analytics practice across our customer base. You will be someone who will ensure that the right level of competency is available in order to drive best-in-class analytics and also ensure accurate and timely resource fulfillment. You are also the person who will align the team to new approaches and market direction. As a leader you will also be responsible for all standards that apply to the function and ensure that KPIs are tracked and actioned in order to drive service delivery excellence. In conjunction with the Senior Vice President for Global Service Delivery , assist with creation of, planning for and deployment of the practice roadmap and associated actions. Make recommendations to the Global SVP and Global COO on the improvement of practice processes and tools and where appropriate help to establish these. Ensuring strong insight to future direction of the capabilities and technology of analytics function to ensure currency and future proofing.</p>\n<h2>As a <b>Global VP of Business Intelligence and Data Science</b>, you will:</h2>\n<p><b>Strategic Leadership:</b> Develop and communicate a comprehensive business intelligence and data strategy aligned with the company&#8217;s overall objectives. Collaborate with senior executives to ensure the integration of data-driven insights into decision-making processes.</p>\n<p><b>Data Governance</b>: Establish and maintain robust data governance policies, procedures, and standards to ensure data accuracy, consistency, and security. Drive compliance with data protection regulations.</p>\n<p><b>Data Analysis and Reporting:</b> Lead a team of data analysts and data scientists to transform raw data into actionable insights. Create dashboards and reports for internal and client consumption, providing real-time insights into operational performance.</p>\n<p><b>Technology and Infrastructure: </b>Evaluate, select, and implement cutting-edge technologies and tools to support data collection, storage, and analysis. Ensure the scalability and efficiency of data infrastructure.</p>\n<p><b>Cross-functional Collaboration:</b> Collaborate with departments across the organization, including Operations, Sales, and IT, to identify opportunities for data-driven improvements and optimizations.</p>\n<p><b>Client Engagement: </b>Act as a subject matter expert in data strategy and business intelligence, engaging with clients to understand their specific needs and opportunities for data-driven enhancements to our services.</p>\n<p><b>Team Leadership</b>: Build and manage a high-performing team of data professionals, providing guidance, mentoring, and professional development opportunities.</p>\n<p><b>Performance Measurement:</b> Define and track key performance indicators (KPIs) to assess the impact of data-driven initiatives on business outcomes. Make data-driven recommendations for continuous improvement.</p>\n<p>Do you have what it takes to become a<b> Global VP of Business Intelligence and Data Science</b>?</p>\n<h2><b>Requirements:</b></h2>\n<ul>\n<li>Bachelor&#8217;s degree in Data Science, Business Analytics, Computer Science, or a related field. Advanced degree (MBA) is preferred.</li>\n<li>Proven experience (10+ years) in business intelligence, data strategy, and data analytics roles, with at least 5 years in a leadership capacity.</li>\n<li>Strong understanding of the BPO industry and the role of data in improving operational efficiency and client satisfaction.</li>\n<li>Proficiency in data visualization tools (e.g., Tableau, Power BI) and data analysis tools (e.g., Python, R).</li>\n<li>Excellent leadership, communication, and interpersonal skills.</li>\n<li>Demonstrated ability to translate complex data insights into actionable business strategies.</li>\n<li>In-depth knowledge of data privacy and security regulations.</li>\n<li>Can work US hours (for candidates residing outside of US)</li>\n<li>We are open to hire in any of these locations: USA, India, Philippines, Colombia. This is a remote work set-up.</li>\n</ul>\n<h2><b>About TaskUs</b></h2>\n<p>TaskUs is a leading provider of outsourced digital services and next-generation customer experience to the world’s most innovative companies, helping its clients represent, protect and grow their brands. Leveraging a cloud-based infrastructure, TaskUs serves clients in the fastest-growing sectors, including social media, e-commerce, gaming, streaming media, food delivery and ride-sharing, Technology, FinTech and HealthTech. As of March 31, 2023, TaskUs had a worldwide headcount of approximately 47,700 people across 27 locations in 13 countries, including the United States, the Philippines and India.</p>\n<p>In TaskUs we believe that innovation and higher performance are brought by people from all walks of life. We welcome applicants of different backgrounds, demographics and circumstances. Inclusive and equitable practices is our responsibility as a business.</p>\n<p>TaskUs is committed to providing equal access to opportunities. If you need reasonable accommodation in any part of the hiring process, please let us know.</p>",
      "pubDate": "2024-02-14 07:22:38"
    },
    {
      "id": 97863,
      "url": "https://jobicy.com/jobs/97863-channels-and-alliances-director-dach",
      "jobSlug": "97863-channels-and-alliances-director-dach",
      "jobTitle": "Channels and Alliances Director - DACH",
      "companyName": "Apptio",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/03/1c0a16e75ebab2d3feda5fb780f0b2f6.jpeg",
      "jobIndustry": [
        "Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Germany",
      "jobLevel": "Director",
      "jobExcerpt": "Apptio, an IBM company, is the leading technology spend and value management software provider. Its AI-powered data insights empower leaders to make smarter financial and operational decisions. A pioneer and category leader in Technology Business Management (TBM) and FinOps, Apptio works with thousands of customers, partners, and community members worldwide. Responsible for achieving customer introductions&#8230;",
      "jobDescription": "<p>Apptio, an IBM company, is the leading technology spend and value management software provider. Its AI-powered data insights empower leaders to make smarter financial and operational decisions. A pioneer and category leader in Technology Business Management (TBM) and FinOps, Apptio works with thousands of customers, partners, and community members worldwide.</p>\n<p>Responsible for achieving customer introductions that lead to sales and represent Apptio products and services to partners that our joint offerings developed with prioritized focus partners. The Channel &amp; Alliances Manager must have a background selling software solutions, effective channel recruitment, and enablement strategies, conducting in-person sales calls and having a history of educating channel partners to achieve success. The role will involve driving pre-developed GTM’s with our Partners as well as driving enabling new IBM business partners to build TBM, FinOps and Agile practices.</p>\n<p><strong>You will drive GTM initiatives and activities with all of Apptio’s partners and select IBM business partners, including:</strong></p>\n<ul>\n<li>Apptio business partners focused on TBM, FinOps and Enterprise Agile Management</li>\n<li>IBM business partners focused initially on FinOps and extending to TBM and Agile over time</li>\n<li>IBM Value added distributors</li>\n</ul>\n<p>In addition, you will be responsible for recruiting, onboarding, managing, and developing and driving business plans with regional business partners in your territory including AWS ISV partners.</p>\n<h2>Responsibilities</h2>\n<p>The Channels and Alliances Director must be able to develop and maintain senior and deep partner relations for the purpose of driving joint:</p>\n<ul>\n<li>New logo deals and top of funnel leads</li>\n<li>Practice Development – build FinOps, TBM and Enterprise Agile practices in key partners</li>\n<li>Strong, sustained marketing programs, campaigns and events</li>\n<li>Establish customer success, value and expansion through planting partners as a core part of a customer deliver</li>\n</ul>\n<p>This role will report into the Regional VP, EMEA Channels and Alliances and work closely with a Snr Director of Alliances who will own the overall success of the DACH territory, EMEA Sales, Partner Marketing and Services teams. Focusing on Partner Planning, Business Development, Enablement, Go-to-Markets, Partner Lead Generation, Partner Campaign Creation, Sales Opportunity Management and Service Delivery. This role will interface closely to Regional Vice Presidents and Strategic Sales Leaders across the DACH region</p>\n<h2>Qualifications</h2>\n<ul>\n<li>Bachelor&#8217;s degree or equivalent with proven success in channel sales, extensive experience in enterprise software and a background in a SaaS based company</li>\n<li>MBA or other advanced degree would be beneficial</li>\n<li>An extensive network of channel partners within the assigned territory</li>\n<li>Documented success of bringing new channel partners to an organization</li>\n<li>Proof of quota attainment and meeting performance objectives</li>\n<li>Worked previously for a SaaS based software company</li>\n<li>Talented cross-functional collaborator able to develop trusted relationships and rapport</li>\n<li>Excellent communication skills, including the ability to exercise assertiveness to influence others to create desired sales results</li>\n<li>Strong initiative, organization and prioritization skills with the proven ability to work in a self-directed environment</li>\n<li>Flexible, innovative, and able to respond appropriately in a time-critical environment</li>\n<li>Excellent presentation skills</li>\n<li>Ability to travel up to 50% of the time</li>\n</ul>\n<p><strong>A minimum of three years of demonstrated experience in working with similar companies as below or preferably direct experience:</strong></p>\n<p><strong>DACH Partner examples</strong></p>\n<ul>\n<li>Integres/TimetoAct</li>\n<li>Crayon/Bechtle</li>\n<li>SoftwareOne/Liquid Reply</li>\n<li>Trustmarque/Ingram</li>\n<li>Arrow/TD Synnex</li>\n<li>Nanga Systems/Detecon</li>\n<li>Amasol/MHP</li>\n</ul>",
      "pubDate": "2024-02-14 07:21:24"
    },
    {
      "id": 97861,
      "url": "https://jobicy.com/jobs/97861-principal-pricing-intelligence-analyst-lodging",
      "jobSlug": "97861-principal-pricing-intelligence-analyst-lodging",
      "jobTitle": "Principal Pricing Intelligence Analyst, Lodging",
      "companyName": "Hopper",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201020164254-931520.jpg",
      "jobIndustry": [
        "Marketing &amp; Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Canada,  USA",
      "jobLevel": "Any",
      "jobExcerpt": "In this role, you will play a pivotal role in tackling data and engineering challenges aimed at enhancing Hopper&#8217;s lodging offerings, making Hopper the best place to book hotels and vacation rentals. This role has a tremendous impact on the vision and success of the company. It&#8217;s a unique opportunity to join one of Hopper&#8217;s&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>In this role, you will play a pivotal role in tackling data and engineering challenges aimed at enhancing Hopper&#8217;s lodging offerings, making Hopper the best place to book hotels and vacation rentals.</div>\n<div></div>\n<div>This role has a tremendous impact on the vision and success of the company. It&#8217;s a unique opportunity to join one of Hopper&#8217;s strategic lodging team, and get access to fascinating and massive market and behavioural data sets.</div>\n<div></div>\n<div>Your main responsibility will revolve around taking charge of our data warehousing, ensuring data accessibility, and delivering insights that will shape our strategic direction.</div>\n<div></div>\n<div>In this role you will be part of a cross-functional team of product managers, data scientists, and engineers who work closely together to make travel easier and reach millions of users in the process.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What would your day-to-day look like:</h2>\n<ul>\n<li><b>Initiate, Develop, and Maintain Data Pipelines</b>: Independently drive the creation and maintenance of data pipelines crucial for data-driven decision-making. Ensure these pipelines are robust, efficient, and consistently updated to provide real-time insights.</li>\n<li><b>Data Warehouse Ownership</b>: Take full ownership of our data warehouse, making it an accessible and user-friendly resource for product and commercial teams. Streamline data storage, retrieval, and organization to empower teams with actionable insights.</li>\n<li><b>KPI Metrics and Reporting Frameworks</b>: Identify, refine, and track key performance indicators (KPIs) critical to assessing business performance. Develop and maintain reporting frameworks that allow for continuous monitoring and reporting of these metrics.</li>\n<li><b>Core Reporting for Decision-Making: </b>Create and manage core reporting systems that drive both daily operational decisions and long-term strategic ones. Ensure that these reports provide actionable insights and are readily available to relevant stakeholders.</li>\n<li><b>Revenue Growth Opportunities: </b>By becoming an expert in our data and understanding our customers thoroughly, proactively identify new opportunities for revenue growth. Collaborate with cross-functional teams to implement strategies that capitalize on these opportunities.</li>\n<li><b>Autonomy in Problem-Solving: </b>Identify data-related challenges and develop creative solutions independently. Demonstrate a proactive approach to problem-solving and a commitment to data quality and accuracy.</li>\n</ul>\n<div>We are looking for someone who has a real bias for action, takes ownership, thrives on autonomy and delivers results.</div>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>An ideal candidate has:</h2>\n<ul>\n<li>+5 years of experience thriving in a fast pace business intelligence focused role</li>\n<li>A proven track record of solving complex problems with an in-depth understanding of data, product, and business impact</li>\n<li>High attention to detail and ability to create scalable data solutions</li>\n<li>Fluency in using SQL for data creation, maintenance, and analysisExperience with data visualization tools (Looker, Tableau, Amplitude, Big Query)</li>\n<li>Demonstrated expertise in maintaining data quality, integrity, and compliance with data governance best practices.</li>\n<li>Worked on a consumer product and has shipped high-impact models at scale</li>\n<li>Strong experience, knowledge of, and/or keen interest in marketplace pricing and inventory.</li>\n<li>Strong creative problem-solving skills and critical thinking competencies</li>\n<li>Experience in launching, analyzing, and setting frameworks for A/B tests.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Perks of working with us:</h2>\n<ul>\n<li>Well-funded and proven startup with large ambitions, competitive salary and stock options</li>\n<li>Unlimited PTO</li>\n<li>WeWork All Access Pass OR Work-from-home stipend</li>\n<li>Entrepreneurial culture where pushing limits and taking risks is everyday business</li>\n<li>Open communication with management and company leadership</li>\n<li>Small, dynamic teams = massive impact</li>\n<li>100% employer-paid telemedicine, medical, dental, vision, disability and life insurance plans</li>\n<li>Access to a Retirement Savings Plan</li>\n</ul>\n<div>At Hopper, we are on a mission to become the leading travel platform globally – powering Hopper’s mobile app, website and our B2B business, HTS (Hopper Technology Solutions). By leveraging massive amounts of data and advanced machine learning algorithms, Hopper combines its world-class travel agency offering with proprietary fintech products to bring transparency, flexibility and savings to travelers globally. We have developed several unique fintech solutions that address everything from pricing volatility to trip disruptions – helping people travel better and save more on their trips.</div>\n</div>\n</div>",
      "pubDate": "2024-02-14 07:17:18"
    },
    {
      "id": 103032,
      "url": "https://jobicy.com/jobs/103032-customer-service-representative-18",
      "jobSlug": "103032-customer-service-representative-18",
      "jobTitle": "Customer Service Representative",
      "companyName": "Leidos",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/a037fdd7c89237d1e8378e4474d2bfa1.png",
      "jobIndustry": [
        "Customer Success"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Leidos is a Fortune 500™ company aimed at embracing and solving some of the world’s most pressing challenges. Through science and technology, Leidos makes the world safer, healthier and more efficient. Our Civil Group offers an array of exciting career opportunities for the best IT, energy, logistics and engineering professionals. POSITION SUMMARY (program supporting/general position overview): Leidos is&#8230;",
      "jobDescription": "<p>Leidos is a Fortune 500™ company aimed at embracing and solving some of the world’s most pressing challenges. Through science and technology, Leidos makes the world safer, healthier and more efficient.</p>\n<p>Our Civil Group offers an array of exciting career opportunities for the best IT, energy, logistics and engineering professionals.</p>\n<h2><b>POSITION SUMMARY (program supporting/general position overview):</b></h2>\n<p>Leidos is seeking an Entry Level Customer Service Representatives (CSRs) to respond to incoming contacts from consumers that have been victims of identity theft and consumer fraud. Must efficiently document consumer complaints into a secure database, provide educational materials/referrals, while providing A+ customer service.</p>\n<p><b>The expected shift is 9:00 am to 5:00 pm (EST) / 6:00 am &#8211; 2:00 PM (PST) Monday through Friday. </b></p>\n<h2><b>PRIMARY RESPONSIBILITIES:</b></h2>\n<p>Respond to inbound calls.  Provide excellent customer service.  Document consumer data into web application.  Provide education related to identity theft resolution, fraud prevention, and applicable federal laws.</p>\n<h2><b>MINIMUM REQUIRED QUALIFICATIONS:</b></h2>\n<ul>\n<li>HS Diploma or GED Equivalent.</li>\n<li>Excellent computer/typing skills.</li>\n<li>Excellent communication skills.</li>\n<li>Position requires the ability to obtain a Public Trust clearance; a Public Trust clearance can take anywhere from 7-60 days to obtain; chosen candidate cannot start in this role until this process is complete.</li>\n</ul>\n<h2><b>DESIRED QUALIFICATIONS:</b></h2>\n<ul>\n<li>Bilingual (Fluent in Spanish and English, both written and speech).</li>\n<li>Prior call center experience.</li>\n<li>Customer service experience.</li>\n<li>General knowledge of federal law.</li>\n<li>Professional Resume that contains the applicants contact info (phone number and email address), as well as the contact info (phone numbers and physical addresses) of previous employers should be attached to the application.</li>\n</ul>\n<p><b><i>This position is covered under the Service Contract Act and is subject to minimum wage requirements as well as the minimum Health and Welfare benefit.</i> </b><b>Leidos will ensure that all wage and benefit provisions are met as required by the Service Contract Act. <i>The salary rate for this position is $15 an hour.</i></b></p>\n<h2><b>Pay Range:</b></h2>\n<p>The Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.</p>",
      "pubDate": "2024-02-14 07:16:19"
    },
    {
      "id": 97856,
      "url": "https://jobicy.com/jobs/97856-director-growth-marketing",
      "jobSlug": "97856-director-growth-marketing",
      "jobTitle": "Director, Growth Marketing",
      "companyName": "Webflow",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/b75fa7e9-221.jpg",
      "jobIndustry": [
        "Marketing &amp; Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Director",
      "jobExcerpt": "At Webflow, our mission is to bring development superpowers to everyone. Webflow is the leading visual development platform for building powerful websites without writing code. By combining modern web development technologies into one platform, Webflow enables people to build websites visually, saving engineering time, while clean code seamlessly generates in the background. From independent designers&#8230;",
      "jobDescription": "<p>At Webflow, our mission is to bring development superpowers to everyone. Webflow is the leading visual development platform for building powerful websites without writing code. By combining modern web development technologies into one platform, Webflow enables people to build websites visually, saving engineering time, while clean code seamlessly generates in the background. From independent designers and creative agencies to Fortune 500 companies, millions worldwide use Webflow to be more nimble, creative, and collaborative. It’s the web, made better.</p>\n<p>We’re looking for a Director, Growth Marketing to play a key role in reshaping our user acquisition strategies at Webflow. In this critical position, you will spearhead inventive approaches and oversee a team of over 10 growth marketing professionals across both paid and organic channels.</p>\n<h2><strong>About the role</strong></h2>\n<ul>\n<li>Location: Remote-first (United States)</li>\n<li>Full-time</li>\n<li>Exempt</li>\n<li>Our cash compensation amount for this role ranges from $170,000 &#8211; $233,000 for most US locations and $188,000 &#8211; $259,000 for US locations with a higher cost of labor. All figures cited above are in $USD and pertain to workers located in the United States. Pay is based on several factors including market location, and may vary depending on job related experience, knowledge, qualifications, and skills.</li>\n<li>Reporting to the VP, Growth</li>\n</ul>\n<p>As a Director, Growth Marketing you’ll …</p>\n<ul>\n<li>Channel Optimization: Oversee both paid and organic growth marketing channels, optimizing performance to maximize user acquisition while staying ahead of industry trends.</li>\n<li>Strategic Leadership: Take ownership of the growth marketing team, providing strategic direction and leadership to drive innovative and effective user acquisition strategies.</li>\n<li>Team Leadership: Lead and inspire a team of 10+ growth marketing experts, fostering collaboration and ensuring the team&#8217;s alignment with overall business goals.</li>\n<li>Cross-functional collaboration: Collaborate with cross-functional teams, including product, design, and analytics, to ensure a cohesive and integrated approach in achieving acquisition goals.</li>\n<li>Upmarket Expansion: Drive initiatives to accelerate our move upmarket, developing and executing growth strategies that target higher-value customer segments, aligning with the company&#8217;s expansion goals and positioning Webflow as a leader in the evolving market landscape.</li>\n</ul>\n<p>In addition to the responsibilities outlined above, Webflow supports you in identifying where your interests and development opportunities lie and we&#8217;ll help you incorporate them into your role.</p>\n<h2><strong>About you</strong></h2>\n<p>You’ll thrive as a Director, Growth Marketing if you:</p>\n<ul>\n<li>6+ years of experience managing Growth Marketing teams</li>\n<li>Demonstrated success in developing and executing innovative, high-impact acquisition programs; ability to inspire and lead a team, fostering a collaborative and high-performance culture</li>\n<li>Data-driven decision making: experience using data insights to make informed decisions and refine strategies; familiarity with tools and platforms for data analysis and reporting.</li>\n<li>Cross-functional collaboration skills: Proven ability to collaborate effectively with cross-functional teams, including product, sales, design, finance, and analytics</li>\n</ul>\n<p>Even if you don’t meet 100% of the above qualifications, you should still seriously consider applying. Research shows that you may still be considered for a role if you meet just half of the requirements.</p>\n<h2><strong>Our Core Behaviors</strong><strong><br />\n</strong></h2>\n<ul>\n<li><strong>Obsess over customer experience.</strong> We deeply understand <em>what</em> we’re building and <em>who</em> we’re building for and serving. We define the leading edge of what’s possible in our industry and deliver the future for our customers.</li>\n<li><strong>Move with heartfelt urgency.</strong> We have a healthy relationship with impatience, channeling it thoughtfully to show up better and faster for our customers and for each other. Time is the most limited thing we have, and we make the most of every moment.</li>\n<li><strong>Say the hard thing with care.</strong> Our best work often comes from intelligent debate, critique, and even difficult conversations. We speak our minds and don’t sugarcoat things — and we do so with respect, maturity, and care.</li>\n<li><strong>Make your mark.</strong> We seek out new and unique ways to create meaningful impact, and we champion the same from our colleagues. We work as a <em>team</em> to get the job done, and we go out of our way to celebrate and reward those going above and beyond for our customers and our teammates.</li>\n</ul>\n<h2><strong>Benefits &amp; wellness</strong></h2>\n<ul>\n<li>Equity ownership (RSUs) in a growing, privately-owned company</li>\n<li>100% employer-paid healthcare, vision, and dental insurance coverage for employees and dependents (US; full-time Canadian workers working 30+ hours per week), as well as Health Savings Account/Health Reimbursement Account, dependent on insurance plan selection. Employees also have voluntary insurance options, such as life, disability, hospital protection, accident, and critical illness</li>\n<li>12 weeks of paid parental leave for both birthing and non-birthing caregivers, as well as an additional 6-8 weeks of pregnancy disability for birthing parents to be used before child bonding leave. Employees also have access to family planning care and reimbursement.</li>\n<li>Flexible PTO with a mandatory annual minimum of 10 days paid time off, and sabbatical program</li>\n<li>Access to mental wellness coaching, therapy, and Employee Assistance Program</li>\n<li>Monthly stipends to support health and wellness, as well as smart work, and annual stipends to support professional growth</li>\n<li>Professional career coaching, internal learning &amp; development programs</li>\n<li>401k plan and financial wellness benefits, like CPA or financial advisor coverage</li>\n<li>Commuter benefits for in-office workers</li>\n</ul>\n<p><em>Temporary employees are not eligible for paid holiday time off, accrued paid time off, paid leaves of absence, or company-sponsored perks.</em></p>\n<h2><strong>Be you, with us</strong></h2>\n<p>At Webflow, equality is a core tenet of our culture. We are committed to building an inclusive global team that represents a variety of backgrounds, perspectives, beliefs, and experiences. Employment decisions are made on the basis of job-related criteria without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other classification protected by applicable law.</p>",
      "pubDate": "2024-02-14 07:12:54",
      "annualSalaryMin": "170000",
      "annualSalaryMax": "233000",
      "salaryCurrency": "USD"
    },
    {
      "id": 97858,
      "url": "https://jobicy.com/jobs/97858-sr-financial-analyst-sales-finance",
      "jobSlug": "97858-sr-financial-analyst-sales-finance",
      "jobTitle": "Senior Financial Analyst - Customer Success",
      "companyName": "Splunk",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/2f9304fe9b427489507405bef9a0bb9f.jpg",
      "jobIndustry": [
        "Finance &amp; Legal"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Senior",
      "jobExcerpt": "Splunk is here to build a safer and more resilient digital world. The world&#8217;s leading enterprises use our unified security and observability platform to keep their digital systems secure and reliable. While customers love our technology, it&#8217;s our people that make Splunk stand out as an amazing career destination and why we&#8217;ve won so many&#8230;",
      "jobDescription": "<p>Splunk is here to build a safer and more resilient digital world. The world&#8217;s leading enterprises use our unified security and observability platform to keep their digital systems secure and reliable. While customers love our technology, it&#8217;s our people that make Splunk stand out as an amazing career destination and why we&#8217;ve won so many awards as a best place to work. If you become a Splunker, we want your whole, authentic self, what we call your &#8220;million data points&#8221;. So bring your work experience, problem-solving skills and talent, of course, but also bring your joy, your passion and all the things that make you, you.</p>\n<h2>Position Overview:</h2>\n<p>Are you innately curious, passionate about building impactful analyses, and a truth seeker using financial data? Splunk is looking for a Senior Financial Analyst to join its Customer Success FP&amp;A team. Candidates will have outstanding business partnership and communication skills, possess deep attention to detail, be able to balance multiple priorities, and thrive in the ambiguity that comes with a dynamic Customer Success organization.</p>\n<p>Reporting into the Senior Director of Global Customer Success FP&amp;A, this individual is a modeling guru who is excited to dive into the financial aspects of the Support organization including: customer case volumes, product support costing, cost per case metrics, headcount capacity planning and more. You will be intimately involved in planning, forecasting, budget vs. actuals analysis, and the monthly close cycles for the Customer Support team, which is a part of the broader Customer Success organization.. This is an outstanding opportunity to become a key FP&amp;A lead supporting the Customer Support organization and own critical Finance processes and workstreams.</p>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Quickly establish positive relationships and become a key advisor for our Customer Support team, allowing you to build a solid understanding of business data inputs and outputs.</li>\n<li>Build and maintain detailed financial and operating models to help predict future performance, perform scenario analyses, and guide the business on strategic decisions. Key models will include the Support headcount capacity model, cost per case and other productivity analysis that drive cost efficient customer outcomes.</li>\n<li>Perform financial month-end close activities, including headcount reconciliations, accruals, journal entries, and budget vs. actuals analysis and reporting.</li>\n<li>Roll up your sleeves and assist in developing annual operating plans and quarterly/monthly financial forecasts for bookings, revenue, expenses and headcount.</li>\n<li>Monitor key performance indicators, highlighting trends, providing recommendations for improvement, and analyzing causes of unexpected variances.</li>\n<li>Partner across the team to leverage best practices to maximize team productivity.</li>\n</ul>\n<h2>Requirements:</h2>\n<ul>\n<li>5 years of progressive finance experience, with a strong preference for those with prior experience in FP&amp;A at a software/SaaS business.</li>\n<li>Strong forecasting methods and techniques. Advanced analytical and quantitative abilities. Able to manipulate large amounts of data and summarize key outputs.</li>\n<li>Articulate with excellent verbal and written communication skills. Capable of communicating complex financial information in an easy to understand format.</li>\n<li>Collaboratively-focused and able to work well with others in a fast-paced and ever changing business.</li>\n<li>Comfortable completing projects requiring individual initiative and flexibility in tight time frames with minimal supervision.</li>\n<li>Microsoft Excel is a must.</li>\n<li>Other software and system skills (Google Suite, Salesforce, SAP, Workday, Tableau, Slack, Zoom) a plus.</li>\n<li>Proficiency in or willingness to learn Alteryx or equivalent data analytics tool.</li>\n</ul>\n<h2>Education:</h2>\n<ul>\n<li>Bachelor’s degree in Finance, Economics, Accounting, Mathematics, Computer Science, or Statistics</li>\n</ul>\n<p>Splunk is an Equal Opportunity Employer: At Splunk, we believe creating a culture of belonging isn’t just the right thing to do; it’s also the smart thing. We prioritize diversity, equity, inclusion, and belonging to ensure our employees are supported to bring their best, most authentic selves to work where they can thrive. Qualified applicants receive consideration for employment without regard to race, religion, color, national origin, ancestry, sex, gender, gender identity, gender expression, sexual orientation, marital status, age, physical or mental disability or medical condition, genetic information, veteran status, or any other consideration made unlawful by federal, state, or local laws. We consider qualified applicants with criminal histories, consistent with legal requirements.</p>\n<h2><b>Base Pay Range:</b></h2>\n<p>SF Bay Area, Seattle Metro, and New York City Metro Area</p>\n<p>Base Pay Range: $104,000.00 &#8211; 143,000.00 per year</p>\n<p>California (excludes SF Bay Area), Washington (excludes Seattle Metro), Washington DC Metro, and Massachusetts</p>\n<p>Base Pay Range: $94,400.00 &#8211; 129,800.00 per year</p>\n<p>All other cities and states excluding California, Washington, Massachusetts, New York City Metro Area and Washington DC Metro Area.</p>\n<p>Base Pay Range: $84,800.00 &#8211; 116,600.00 per year</p>\n<p>Splunk provides flexibility and choice in the working arrangement for most roles, including remote and/or in-office roles. We have a market-based pay structure which varies by location. Please note that the base pay range is a guideline and for candidates who receive an offer, the base pay will vary based on factors such as work location as set out above, as well as the knowledge, skills and experience of the candidate. <b>In addition to base pay, this role is eligible for incentive compensation and may be eligible for equity or long-term cash awards.</b></p>",
      "pubDate": "2024-02-14 07:11:55",
      "annualSalaryMin": "84800",
      "annualSalaryMax": "116600",
      "salaryCurrency": "USD"
    },
    {
      "id": 101266,
      "url": "https://jobicy.com/jobs/101266-business-development-manager-emea",
      "jobSlug": "101266-business-development-manager-emea",
      "jobTitle": "Business Development Manager",
      "companyName": "Twilio",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201023175858-722503.jpg",
      "jobIndustry": [
        "Business Development"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Ireland,  UK",
      "jobLevel": "Any",
      "jobExcerpt": "Twilio powers real-time business communications and data solutions that help companies and developers worldwide build better applications and customer experiences. Although we&#8217;re headquartered in San Francisco, we have presence throughout South America, Europe, Asia and Australia. We&#8217;re on a journey to becoming a global company that actively opposes racism and all forms of oppression and bias. At&#8230;",
      "jobDescription": "<p>Twilio powers real-time business communications and data solutions that help companies and developers worldwide build better applications and customer experiences.</p>\n<p>Although we&#8217;re headquartered in San Francisco, we have presence throughout South America, Europe, Asia and Australia. We&#8217;re on a journey to becoming a global company that actively opposes racism and all forms of oppression and bias. At Twilio, we support diversity, equity &amp; inclusion wherever we do business.</p>\n<h2><strong>About the job:</strong></h2>\n<p>Twilio is looking for a Business Development Manager to join our Global Trading team and have gross profit responsibility for a selected number of strategic accounts. You will be responsible for defining the strategy and executing upon the growth strategy of your partners. You will own both supply and demand with the ultimate goal to maximize profitability.</p>\n<h2><strong>Responsibilities:</strong></h2>\n<p>In this role, you’ll:</p>\n<ul>\n<li>Develop and drive strategy to achieve optimized profitability within account territory.</li>\n<li>Ruthlessly prioritize by identifying trading opportunities to maximize profitability.</li>\n<li>Own pricing strategy and execution, working closely with routing specialists to maximize volume aggregation and account health.</li>\n<li>Cultivate relationships with partners to drive cost efficiencies and quality improvements.</li>\n<li>Work with cross-functional stakeholders to manage rates, routes and yield.</li>\n<li>Represent Twilio and our values with partners at industry events.</li>\n</ul>\n<h2><strong>Qualifications:</strong></h2>\n<p>Not all applicants will have skills that match a job description exactly. Twilio values diverse experiences in other industries, and we encourage everyone who meets the required qualifications to apply. While having “desired” qualifications make for a strong candidate, we encourage applicants with alternative experiences to also apply. If your career is just starting or hasn&#8217;t followed a traditional path, don&#8217;t let that stop you from considering Twilio. We are always looking for people who will bring something new to the table!</p>\n<h2><strong>Required:</strong></h2>\n<ul>\n<li>5+ years in international telecom industry in a partner management role.</li>\n<li>Highly analytical and strategic attitude with proven ability to analyze and compile large amounts of data to inform decision making.</li>\n<li>Demonstrated ability to lead partnerships and exceed critical metrics.</li>\n<li>A bias for action with the ability to test and iterate on new ideas quickly with the appropriate controls and data in place to measure success and change or double down on tactics when needed.</li>\n<li>Comfortable working with highly technical, operational and other cross functional teams, while influencing their understanding, building supportive partnerships and driving expected outcome.</li>\n<li>Strong individual self drive.</li>\n<li>Strong negotiation skills.</li>\n</ul>\n<h2><strong>Desired:</strong></h2>\n<ul>\n<li>Established relationship with key regional accounts.</li>\n<li>Understanding of the SMS supplier ecosystem.</li>\n<li>Domain expertise from a highly quant industry such as investment banking, security or commodity trading especially in non-standard segments.</li>\n</ul>\n<h2><strong>Location:</strong></h2>\n<p>This role will be remote, and based in the United Kingdom.</p>\n<h2><strong>What We Offer:</strong></h2>\n<p>There are many benefits to working at Twilio, including, in addition to competitive pay, things like generous time-off, ample parental and wellness leave, healthcare, a retirement savings program, and much more. Offerings vary by location.</p>\n<h2><strong>Twilio thinks big. Do you?</strong></h2>\n<p>We like to solve problems, take initiative, pitch in when needed, and are always up for trying new things. That&#8217;s why we seek out colleagues who embody our values — something we call Twilio Magic. Additionally, we empower employees to build positive change in their communities by supporting their volunteering and donation efforts.</p>\n<p>So, if you&#8217;re ready to unleash your full potential, do your best work, and be the best version of yourself, apply now!</p>",
      "pubDate": "2024-02-14 07:10:17"
    },
    {
      "id": 101267,
      "url": "https://jobicy.com/jobs/101267-senior-product-manager-33",
      "jobSlug": "101267-senior-product-manager-33",
      "jobTitle": "Sr. Product Manager",
      "companyName": "PatientIQ",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/09/fe2c9b13-221.jpeg",
      "jobIndustry": [
        "Product &amp; Operations"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Senior",
      "jobExcerpt": "Are you passionate about building products from scratch? Are you ready to manage a product that influences healthcare and transforms the patient experience? Are you hopeful about what data and medical research can do to improve medicine? PatientIQ is looking for an experienced Senior Product Manager who can lead the development of an early stage&#8230;",
      "jobDescription": "<section>\n<div class=\"parsedHtml__content--OWD2W\" data-ui=\"job-breakdown-description-parsed-html\">\n<p>Are you passionate about building products from scratch? Are you ready to manage a product that influences healthcare and transforms the patient experience? Are you hopeful about what data and medical research can do to improve medicine?</p>\n<p>PatientIQ is looking for an experienced Senior Product Manager who can lead the development of an early stage data platform from inception to launch and through the entire product lifecycle. As a member of the PatientIQ product team, you will partner with an engineering manager and a team of engineers, to create a new core parts of our platform.</p>\n<h2><strong>Role Responsibilities:</strong></h2>\n<ul>\n<li>Develop a deep understanding of our customers and how they use our product through internal feedback, data, and regular interaction with users.</li>\n<li>Construct a product plan in a hypothesis-driven, data-informed written narrative that aligns with the business strategy and OKRs.</li>\n<li>Empower a cross-functional team of Engineers, Product Designers, Quality Assurance, Customer Success, and others to plan and execute impactful work.</li>\n<li>Lead the product development ceremonies, including sprint planning, daily stand-ups, design reviews, retrospectives, and any ad hoc meetings needed to support the team.</li>\n<li>Provide the context and information required to make product, design, and engineering decisions in written form using product proposals, product specs, and user stories.</li>\n<li>Collaborate with design on problem and solutions discovery efforts to validate product plans, including prototype testing, user testing, and user research.</li>\n<li>Organize product launch activities, including planning milestones, preparing internal teams, and gathering feedback.</li>\n<li>Monitor the impact of all efforts using quantitative and qualitative measures and actively adjust plans to optimize impact.</li>\n<li>Contribute to all product evangelism efforts, including writing release notes, demoing to internal teams, providing status updates, and attending customer calls.</li>\n</ul>\n</div>\n</section>\n<section>\n<h2 class=\"styles__h2--p4pBC jobBreakdown__section-heading--1SYpd styles__emphasis--3da4O\"><strong class=\"styles__strong--2kqW6\">Requirements:</strong></h2>\n<div class=\"parsedHtml__content--OWD2W\" data-ui=\"job-breakdown-requirements-parsed-html\">\n<ul>\n<li>Demonstrated ability taking new products to market and managing them through the full product lifecycle.</li>\n<li>Experience building modern, external (customer-facing) data products. Strong skills in data analysis, and thorough understanding of data engineering concepts.</li>\n<li>Experience working with clinical data, including a strong understanding of medical terminology, healthcare data standards (e.g., HL7, FHIR), and interoperability challenges.</li>\n<li>Experience making data-driven product decisions and owning the outcomes of those decisions.</li>\n<li>Effective communication and collaboration with executive stakeholders.</li>\n<li>Strong prioritization skills and great instincts about what matters</li>\n</ul>\n</div>\n</section>\n<section>\n<h2 class=\"styles__h2--p4pBC jobBreakdown__section-heading--1SYpd styles__emphasis--3da4O\"><strong class=\"styles__strong--2kqW6\">Benefits:</strong></h2>\n<div class=\"parsedHtml__content--OWD2W\" data-ui=\"job-breakdown-benefits-parsed-html\">\n<ul>\n<li><strong>The Works</strong> &#8211; top-notch health, dental and vision insurance. Additional perks available, including 401K.</li>\n<li><strong>We are Mission Driven</strong> &#8211; our team is motivated to solve complex problems, drive medicine forward, and ultimately improve patient outcomes.</li>\n<li><strong>True Idea Meritocracy </strong>&#8211; great ideas win out. We encourage all team members to challenge the status quo because our mission demands this.</li>\n<li><strong>Flexible Time Off &#8211;</strong> we trust you to take the time you need when you feel it is appropriate, given your workload and responsibilities. No need to track it or save up.</li>\n<li><strong>World-Class Team</strong> &#8211; we’re at the top of our industry because of our employees. They’re the best investment we can make, and we never forget that.</li>\n<li><strong>Fast Growing</strong> &#8211; we are building the largest platform for healthcare providers, industry partners, researchers, and others to collaborate on the mission to improve patient outcomes.</li>\n</ul>\n</div>\n</section>",
      "pubDate": "2024-02-14 07:05:41"
    },
    {
      "id": 95972,
      "url": "https://jobicy.com/jobs/95972-account-executive-enterprise-general-contractors",
      "jobSlug": "95972-account-executive-enterprise-general-contractors",
      "jobTitle": "Account Executive, Enterprise, General Contractors",
      "companyName": "Procore Technologies",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/c98aac6a44215dd479a6a75b2b2af625.jpeg",
      "jobIndustry": [
        "Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Canada,  USA",
      "jobLevel": "Any",
      "jobExcerpt": "We’re looking for an Account Executive, Enterprise, General Contractors to join Procore’s Sales Team. In this role, you’ll apply an understanding of Procore’s products, sales methodology, processes, prospecting techniques, and customer base while selling to strategic mid-market accounts. You’ll focus on companies that can benefit from Procore’s world-class project management tool for the construction industry. This position’s&#8230;",
      "jobDescription": "<section id=\"st-jobDescription\" class=\"job-section\">\n<div class=\"wysiwyg\">\n<section id=\"st-jobDescription\" class=\"job-section\">\n<div class=\"wysiwyg\">\n<section id=\"st-jobDescription\" class=\"job-section\">\n<div class=\"wysiwyg\">\n<p>We’re looking for an <strong>Account Executive, Enterprise, General Contractors</strong> to join Procore’s Sales Team. In this role, you’ll apply an understanding of Procore’s products, sales methodology, processes, prospecting techniques, and customer base while selling to strategic mid-market accounts. You’ll focus on companies that can benefit from Procore’s world-class project management tool for the construction industry. This position’s primary function is new account acquisition, where you’ll grow revenue with an emphasis on new product sales to our customer base. This includes following up on inbound leads, prospecting, qualifying, solution selling, negotiation, and closing.</p>\n<p>This position will report to a Director of Enterprise Sales, General Contractor and can be based remotely from a U.S. or Canadian location. We’re looking for someone to join us immediately!</p>\n<h2><strong>What you&#8217;ll do:</strong></h2>\n<ul>\n<li>Timely follow-up and qualification of new prospects from either inbound leads or customer requests generated by marketing</li>\n<li>Develop prospecting plans for territory development to build rapport and create opportunities</li>\n<li>Research accounts, identify key players, generate interest, and obtain business requirements</li>\n<li>Maintain accurate and up-to-date forecasts; provide sales management with reports on sales activities and projects as requested</li>\n<li>Pursue an increased knowledge of key competitors to communicate our value proposition to customers effectively</li>\n<li>Manage and maintain accurate leads, opportunities, and account information within Salesforce.com</li>\n<li>Achieve or exceed monthly and quarterly targets</li>\n<li>Obtain repeat business, referrals, and references by applying an understanding of the unique requirements of your customers</li>\n<li>Networking, relationship building, cold calling, lead follow-up through emails, product demonstrations, and execution of service agreements</li>\n</ul>\n<h2><strong>What we&#8217;re looking for:</strong></h2>\n<ul>\n<li>BA/BS or equivalent experience preferred</li>\n<li>7+ years of demonstrated successful SaaS software sales, preferably B2B</li>\n<li>Experience using a consultative, value-based sales methodology desired, MEDDICC experience highly desired</li>\n<li>Proven record of success in an inside sales and outside sales-based selling model</li>\n<li>Experience in both new logo sales and account management</li>\n<li>Proven ability to communicate effectively via telephone and email with customers</li>\n<li>Ability and resilience to work in a fast-paced sales environment while developing trusted relationships</li>\n<li>Proficiency in Microsoft Office products and online collaboration tools</li>\n<li>Experience with CRM and opportunity management systems, preferably Salesforce.com</li>\n<li>Proven ability to build and manage pipeline and forecasting</li>\n</ul>\n</div>\n</section>\n<section id=\"st-additionalInformation\" class=\"job-section\">\n<div>\n<h2 class=\"title\">Additional Information</h2>\n</div>\n<div class=\"wysiwyg\">\n<p>Base Pay Range $114,000-$156,750 plus commission for an estimated on-target earnings of $228,000-$313,500. This role is also eligible for Equity Compensation. Procore is committed to offering competitive, fair, and commensurate compensation, and has provided an estimated pay range for this role. Actual compensation will be based on a candidate’s job-related skills, experience, education or training, and location.</p>\n<h2><strong>Perks &amp; Benefits</strong></h2>\n<p>At Procore, we invest in our employees and provide a full range of benefits and perks to help you grow and thrive. From generous paid time off and healthcare coverage to career enrichment and development programs, learn more details about what we offer and how we empower you to be your best.</p>\n<h2><strong>About Us</strong></h2>\n<p>Procore Technologies is building the software that builds the world. We provide cloud-based construction management software that helps clients more efficiently build skyscrapers, hospitals, retail centers, airports, housing complexes, and more. At Procore, we have worked hard to create and maintain a culture where you can own your work and are encouraged and given resources to try new ideas.</p>\n</div>\n</section>\n</div>\n</section>\n</div>\n</section>",
      "pubDate": "2024-02-14 07:04:15",
      "annualSalaryMin": "114000",
      "annualSalaryMax": "156750",
      "salaryCurrency": "USD"
    },
    {
      "id": 93714,
      "url": "https://jobicy.com/jobs/93714-senior-data-analyst-product",
      "jobSlug": "93714-senior-data-analyst-product",
      "jobTitle": "Senior Data Analyst (Product)",
      "companyName": "Copy.ai",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/03/5fb63579fc981698f97d55bfecb213ea.jpeg",
      "jobIndustry": [
        "Data Science",
        "Marketing &amp; Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Canada,  USA",
      "jobLevel": "Senior",
      "jobExcerpt": "We believe AI will be embedded in today&#8217;s businesses and help people start tomorrow&#8217;s businesses. Our SaaS product allows entrepreneurs, marketers, and copywriters to use the latest natural language processing (NLP) models to improve their communication and accomplish business goals. Over 8 million users have signed up to use our application and we&#8217;re eager to&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>We believe AI will be embedded in today&#8217;s businesses and help people start tomorrow&#8217;s businesses. Our SaaS product allows entrepreneurs, marketers, and copywriters to use the latest natural language processing (NLP) models to improve their communication and accomplish business goals.</div>\n<div></div>\n<div>Over 8 million users have signed up to use our application and we&#8217;re eager to deliver more value for them. Investors in our recent $11 million Series A round include Zach DeWitt at Wing Ventures, David Sacks at Craft Ventures, Li Jin at Atelier Ventures, Alfred Lin at Sequoia, and 80+ other investors. In March 2022, Forbes identified Copy.ai as one of the language processing AI startups part of a billion-dollar wave.</div>\n<div></div>\n<div>We’re a scrappy startup so this role is what you make of it, but we’ll help you every step of the way. You’ll be able to look back and see your impact as we grow and evolve. There’s a lot to take on, but we trust that you’re up to the challenge.</div>\n<div></div>\n<div>Copy.ai is a remote company. All employees must be able to work 9am-5pm in any timezone Pacific to Eastern.</div>\n<div></div>\n<div>Do you have a passion for data? Are you excited by the prospect of using your skills to help a company grow and succeed? If so, we want to hear from you! CopyAI is looking for a data analyst to join our team. As a data analyst at CopyAI, you will be responsible for helping us understand and utilize data to drive our business forward. You will be working with large data sets, analyzing trends, and providing insights that will help us make better decisions and achieve our goals. If you are a detail-oriented problem-solver with a passion for data, then we want you on our team!</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What you&#8217;ll do:</h2>\n<ul>\n<li>Helping define and track key metrics for the business</li>\n<li>Building dashboards and creating data visualizations to effectively communicate with stakeholders</li>\n<li>Working with engineering, marketing, and product teams to implement changes based on data-driven insights</li>\n<li>Connecting third-party data enrichment tools to assist our internal marketing and sales initiatives</li>\n<li>Developing data pipelines to create datasets to achieve our AI-first mission</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>About you; You are:</h2>\n<ul>\n<li>3+ years of experience in data analysis</li>\n<li>Experience with product analytics and BI reporting tools (e.g. Mixpanel, Tableau, Lightdash)</li>\n<li>Proficiency with SQL and Python, clean coding practices</li>\n<li>Strong interpersonal communication skills, both verbal and written</li>\n<li>Familiarity with split testing concepts such as experiment design, hypothesis testing, calculating statistical confidence</li>\n<li>Passionate about data, experimentation, and PLG-startups</li>\n</ul>\n<h2><b>Nice-to-haves:</b></h2>\n<ul>\n<li>Experience being embedded in product development pods</li>\n<li>Experience with enterprise growth strategies</li>\n<li>Experience with product activation, retention, or monetization</li>\n<li>Experience analyzing with a product that has machine learning features</li>\n<li>Experience with data transformation tools such as DBT</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<div>Copy.ai is an Equal Opportunity Employer. We’re committed to building a diverse and inclusive team. We encourage applications from people of all races, religions, national origins, genders, sexual orientations, gender identities, gender expressions and ages, as well as veterans and individuals with disabilities.</div>\n<h2>What We Offer:</h2>\n<div> A close-knit and collaborative early-stage startup environment where every voice is heard and every opinion matters; 40 team members as of 08/2023</div>\n<div> Competitive salary and stock option equity packages; We&#8217;re a Series A startup</div>\n<div> Excellent Medical Plans to choose from including HSA plans, PPOs, and HMOs from Kaiser and Aetna; Dental and Vision insurance; Copy.ai pays up to $700/month per employee for monthly premiums</div>\n<div> 100% REMOTE startup! Our team is distributed all over the US and Canada</div>\n<div> UNLIMITED PTO; We truly believe in work-life balance and that hard work should be balanced with time for rest and rejuvenation</div>\n<div> 401k plan and automatic 3% employer contribution from Day 1!!!!</div>\n<div> Brand new work-sponsored computer</div>\n<div> IRL / In-Person retreats throughout the year</div>\n</div>",
      "pubDate": "2024-02-14 07:02:36"
    },
    {
      "id": 89277,
      "url": "https://jobicy.com/jobs/89277-specialist-analytics-data-science",
      "jobSlug": "89277-specialist-analytics-data-science",
      "jobTitle": "Specialist, Analytics & Data Science",
      "companyName": "Athena",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/582ca45acfd3e21caca8b786c1413850.png",
      "jobIndustry": [
        "Data Science",
        "Marketing &amp; Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "At Athena, we power possibilities through transformative delegation. True leaders reflect on what they want in life and map out the path to get there. Athena is the path. We offer rigorously-tested delegation coaching technology and an exceptional Philippines-based XP to keep our driven clients moving forward. The result is 10x more leverage, more time,&#8230;",
      "jobDescription": "<p>At Athena, we power possibilities through transformative delegation. True leaders reflect on what they want in life and map out the path to get there. Athena is the path. We offer rigorously-tested delegation coaching technology and an exceptional Philippines-based XP to keep our driven clients moving forward. The result is 10x more leverage, more time, and more impact in work and life.</p>\n<p>As a part of the Athena team, you will have an exponential opportunity, empowering the fiercely ambitious to reach the most audacious goals. Our clients are leaders, high-impact CEOs, founders, and execs. They have started 100+ companies, raised billions in venture capital, taken companies public, worked in the White House, invested in Facebook/Uber/ Airbnb, run professional sports teams, were Governor of US states, and competed in Ironman races and the World Series of Poker. As a part of the Athena team, you will have an exponential opportunity, empowering the fiercely ambitious to reach the most audacious goals.</p>\n<p>We are in need of an<strong> Analytics &amp; Data Science Specialist</strong> who will be responsible for providing business-critical insights and data, performing data analysis and creating written reports on outcomes and findings, and building dashboards and KPI-based tracking.</p>\n<h2><strong>High-level Responsibilities:</strong></h2>\n<ul>\n<li>Work directly with the Director of Data &amp; Business Operations to execute a wide variety of dynamic, high-priority strategic projects, aimed at generating insights to make our business run more efficiently, and grow our company as fast as possible</li>\n<li>Perform complex data analyses and present key takeaways and insights through detailed written reports for the functional business leaders and executive team</li>\n<li>Build executive-level and detailed team-based operational KPI dashboards using SQL/Python, and BI / analytics tools (tableau, google data studio, etc.)</li>\n<li>Create accompanying glossaries of terms/definitions for dashboards to ensure full data comprehension of functional business team members</li>\n</ul>\n<h2><strong>Skills and Experience Preferred:</strong></h2>\n<ul>\n<li>3+ years of experience in data analysis, analytics, and/or business intelligence role(s) OR post-secondary degree in Data Science and Analytics</li>\n<li>Thorough experience building with SQL and BI/analytics tools (Bonus: experience with Python)</li>\n<li>Preferred working hours: Eastern Standard Time to Pacific Standard Time (9am &#8211; 5pm)</li>\n<li>Looking for personal professional development, within a fast-moving organization that has more than doubled size and revenue in the last year</li>\n<li>Ability to own dynamic, ambiguous projects end-to-end</li>\n<li>Experience working in a fast-paced work environment and able to adapt quickly</li>\n<li>High-level organization skills and ability to prioritize key tasks</li>\n<li>Reliable and dependable teammate that holds others and themselves accountable</li>\n<li>Not afraid to voice one’s mind, or flag when things go wrong or need fixing</li>\n<li>Proactive goal-setter and self-starter: tests hypotheses, attempts first drafts, and seeks feedback from manager to collaborate on work-in-progress</li>\n<li>Structured thinker and clear communicator</li>\n<li>Willing to be wrong or fail, but diligent enough to learn from mistakes and not make the same mistake twice</li>\n<li>Bonus: Experience working with cross-cultural teams</li>\n</ul>",
      "pubDate": "2024-02-14 07:01:52"
    },
    {
      "id": 75103,
      "url": "https://jobicy.com/jobs/75103-virtual-construction-design-specialist",
      "jobSlug": "75103-virtual-construction-design-specialist",
      "jobTitle": "Virtual Construction and Design Specialist",
      "companyName": "Ferguson Enterprises",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/08/e6ea0b3f88e22276c807f9f50199057b.jpg",
      "jobIndustry": [
        "Design &amp; Creative"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Ferguson is North America’s leading value-added distributor across residential, non-residential, new construction and repair, maintenance, and improvement (RMI) end markets. Spanning 34,000 suppliers and more than one million customers, we deliver local expertise, value-added solutions, and the industry’s most extensive portfolio of products. From infrastructure, plumbing, and appliances, to HVAC, fire protection, fabrication, and more,&#8230;",
      "jobDescription": "<p>Ferguson is North America’s leading value-added distributor across residential, non-residential, new construction and repair, maintenance, and improvement (RMI) end markets. Spanning 34,000 suppliers and more than one million customers, we deliver local expertise, value-added solutions, and the industry’s most extensive portfolio of products. From infrastructure, plumbing, and appliances, to HVAC, fire protection, fabrication, and more, we make our customers’ complex projects simple, successful, and sustainable.</p>\n<p>Are you an experienced <b>Virtual Construction &amp; Design Specialist</b>? If so, Ferguson may just be the place for you! Our people are our biggest asset and share a common passion for customer service, which has helped shape us into the industry leader we are today.</p>\n<p>This is a fully remote role that can be performed anywhere in the continental U.S. and will work a corporate day shift schedule.</p>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Gathers, prepares, validates, and implements 3D data for customer/project needs within company’s growth objectives</li>\n<li>Confers with onsite project/customer engineers, architects, or owners on changes &amp; adjustments to project needs through conception &amp; completion of virtual design project</li>\n<li>Receives pre-construction specification data from customer &amp; implements the 3D project design in partnership with project Construction Engineers, Architects, or General Contractors within building construction</li>\n<li>Analyzes specifications or sample layouts to implement customer design initiatives or projects.</li>\n<li>Makes autonomous decisions of pipe routing to optimize field labor, based on trade experience and degree, Certifications, knowledge, inside of virtual construction meetings</li>\n<li>Has independent decision authority on of pipe routing to avoid clashes, based on trade experience and degree certifications, knowledge, inside of virtual construction meetings</li>\n<li>Performs recurring and ad hoc audits and analysis for errors and gaps within 3D data</li>\n<li>Ensure deliverables supports the needs from clients and stakeholder</li>\n<li>Communicates internally, with outside vendors, &amp; with clients to provide 360 feedback for business process changes</li>\n<li>Applies critical thinking in reviewing design data in various formats for accuracy and constructability changes</li>\n<li>Understands internal and external needs and expectations for information and deliverables</li>\n<li>Performs recurring and ad hoc audits and analysis for errors and gaps within 3D data</li>\n<li>Provides direction and guidance to less experienced team members</li>\n<li>May provide input into hiring decisions and performance appraisals but does not necessarily make hiring decisions or conduct performance appraisals.</li>\n<li>Supports channel-specific business needs</li>\n</ul>\n<h2>Qualifications:</h2>\n<ul>\n<li>5+ Years of work experience in engineering field (i.e., Civil, Mechanical, Architectural,) or Trades (i.e., Plumbing, General contractors, journeyman, apprenticeship, etc.) is Required</li>\n<li>Knowledge of Construction (both pre &amp; post) practices for Mechanical and Plumbing/Piping Systems.</li>\n<li>Working Knowledge of Building Codes for Mechanical and Plumbing/Piping Systems</li>\n<li>Ability to digest critical building &amp; blueprint specification data to make sound &amp; independent decisions for pre-construction virtual design team</li>\n<li>Prefer experience in computer aided software such as Revit, Glue, Navisworks Manage, Autodesk Construction Cloud, etc. and Microsoft Office, but not required</li>\n</ul>\n<p>Ferguson is dedicated to providing meaningful benefits programs and products to our associates and their families—geared toward benefits, wellness, financial protection, and retirement savings. Ferguson offers a competitive benefits package that includes medical, dental, vision, retirement savings with company match, paid leave (vacation, sick, personal, holiday, and parental), employee assistance programs, associate discounts, community involvement opportunities, and much more!</p>\n<h2><b>Pay Range:</b></h2>\n<p><i>Actual pay rate may vary depending upon location. The estimated pay range for this position is below. The specific rate will depend on a candidate’s qualifications and prior experience.</i></p>\n<p>$5,550.30 &#8211; $10,450.00</p>\n<p><b><i>Estimated Ranges displayed are Monthly for Salaried roles </i><u>OR</u><i> Hourly for all other roles.</i></b></p>",
      "pubDate": "2024-02-14 07:00:17"
    },
    {
      "id": 17439,
      "url": "https://jobicy.com/jobs/17439-technical-support-engineer-south-asia",
      "jobSlug": "17439-technical-support-engineer-south-asia",
      "jobTitle": "Technical Support Engineer - South Asia",
      "companyName": "CertiK",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/03/Jobicy-210308091023-955845.jpg",
      "jobIndustry": [
        "Software Engineering",
        "Technical Support"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "APAC",
      "jobLevel": "Any",
      "jobExcerpt": "You are fascinated by security and red teaming. The idea of studying the past attacks excites you. You can go all the way down to the byte code to understand how an attack works. You are not afraid of juggling a large codebase or byte code to unravel the mystery behind anonymous malicious actors.  We are&#8230;",
      "jobDescription": "<div class=\"section page-centered\">\n<div>You are fascinated by security and red teaming. The idea of studying the past attacks excites you. You can go all the way down to the byte code to understand how an attack works. You are not afraid of juggling a large codebase or byte code to unravel the mystery behind anonymous malicious actors.  We are seeking a detail-oriented, thorough, and organized candidate to join our growing team. You’ll require excellent communication, problem-solving,  and interpersonal skills, along with patience, and a customer-friendly attitude.</div>\n<div></div>\n<div>You are intrigued by the blockchain world and always want to know more about it, or to keep up with the latest development. You are interested in developing your understanding of this field and its security. You are committed to developing familiarity with this community to the extent that you can find most of the information you need from proprietary data sources or OSINT.</div>\n<h2>About the role</h2>\n<div>Our customer base is growing fast along with the features we are adding to support them. As a result, we have more questions, feedback, and engagement coming in than ever before. As we have just launched our Discord channel, we need a customer support specialist who can answer both new and old clients&#8217; questions. In this role, you’ll be on the front lines introducing our latest products and features to our clients and community.</div>\n<div></div>\n<div>As a customer support specialist, you’ll be the customer’s first point of contact as they encounter roadblocks. Because we are constantly adding new features to the existing stack, you are expected to have a keen knowledge of our latest products and be able to provide personalized instructions to customers via social media channels and live chat. You will act as the first point of contact for our Community, respond to the most common questions members may have, and gather all the necessary information before escalating to the higher support levels.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Requirements</h2>\n<ul>\n<li>2+ years of experience in a customer support role;</li>\n<li>Knowledge of analyzing and scaling Discord Community KPIs;</li>\n<li>Experience with Discord automation and implementation;</li>\n<li>A broad technical background and enjoy learning new technologies;</li>\n<li>Capable of explaining complex ideas in plain language;</li>\n<li>Professional live chat etiquette;</li>\n<li>Discord growth knowledge</li>\n<li>Excellent communication skills in English;</li>\n<li>Deep interest in and understanding of DeFi &amp; crypto;</li>\n<li>Bonus points for speaking other languages, particularly Mandarin;</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Responsibilities</h2>\n<ul>\n<li>Hands-on support activities;</li>\n<li>Engage with various stakeholders from our community;</li>\n<li>Analyze new trends to engage and develop the discord community;</li>\n<li>Ability to create documentation for our community;</li>\n<li>Take ownership of clients’ support questions/issues;</li>\n<li>Act as an escalation point for customer complaints/concerns about the products and service she/he is engaged with;</li>\n<li>As part of a global support team, working on establishing operational protocols and standards;</li>\n<li>Research questions using available information resources and advises users on appropriate action;</li>\n<li>Working on creating the knowledge Base Articles/FAQ for our community;</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Bonus Points</h2>\n<ul>\n<li>Knowledge of token economics, knowledge of creating interesting posts for our community.</li>\n<li>Knowledge of at least one of the following languages: Java, Python, TypeScript/Javascript, Bourne Shell.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<h2>Compensation</h2>\n<div>The exact compensation at which this job is filled will be determined by the skills and experience of qualified candidates.</div>\n</div>",
      "pubDate": "2024-02-14 06:59:20"
    },
    {
      "id": 101246,
      "url": "https://jobicy.com/jobs/101246-web-content-writer",
      "jobSlug": "101246-web-content-writer",
      "jobTitle": "Web Content Writer",
      "companyName": "Study.com",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/afe1b9a77c70df67176408a79f4fd27a.png",
      "jobIndustry": [
        "Copywriting &amp; Content"
      ],
      "jobType": [
        "contract"
      ],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "Our content team is looking for contract writers who can create a number of types of content, including short-form and long-form content, blog posts, web pages, web copy, FAQ pages, and more. Content produced for our sites works by inviting readers to learn more about a particular career path, in-person or online degree, or other higher education-focused&#8230;",
      "jobDescription": "<p>Our content team is looking for <b>contract writers</b> who can create a number of types of content, including short-form and long-form content, blog posts, web pages, web copy, FAQ pages, and more.</p>\n<p>Content produced for our sites works by inviting readers to learn more about a particular career path, in-person or online degree, or other higher education-focused topic.</p>\n<p>To that end, our content is audience-aware, focused on user intent, and easily digestible, so we’re looking for writers who can write for the average reader. At the same time, our content must strike a balance between authoritative and personable, between helpful and informative, between action-driven and service-based: our writers must wear many hats at once.</p>\n<p>The ideal candidate will have a track record of creating content that both prompts user engagement and works to generate leads. Because we run a tight publishing schedule driven by specific goals, we also need someone who is used to producing quality content with quick turnaround times, has a knack for following instructions to the letter, and a keen eye for detail.</p>\n<h2><b>Job Overview:</b></h2>\n<p>The content writer will work closely with content manager(s) and editors to produce content that is accurate, detailed, and optimized for our websites.</p>\n<p>The <b>contract writer role</b> is ideal for individuals looking to take on regular work on a contractual basis. Workload will vary depending on writer availability and writing capabilities, but our <b>freelance writers typically write seven to ten (7-10) articles per week. You must commit to a minimum of 5 articles weekly. </b>Each article typically ranges between 800 to 1,100 words.</p>\n<h2><b>The Compensation:</b></h2>\n<p>Pay rates vary based on complexity and length of content. All work is paid per piece.</p>\n<h2><b>Required Qualifications:</b></h2>\n<ul>\n<li>minimum of 1 year of writing experience</li>\n<li>desire to learn about content writing for SEO</li>\n<li>the ability to take constructive criticism</li>\n<li>full proficiency with the English language</li>\n</ul>\n<h2><b>Preferred Qualifications:</b></h2>\n<ul>\n<li>bachelor’s degree in English/writing, marketing, communications, or equivalent experience</li>\n<li>experience writing digestible content online</li>\n<li>experience working in a remote environment</li>\n<li>an understanding of the education field</li>\n<li>understands the importance of tight content deadlines</li>\n<li>works well in a remote team environment</li>\n<li>receptive to helpful criticism</li>\n</ul>\n<h2><b>How To Apply:</b></h2>\n<p>Please complete all of the following steps to submit your application:</p>\n<p>1. Submit a resume</p>\n<p>2. Include a letter of interest detailing why you would be an optimal candidate.</p>\n<p>3. If experienced in SEO content writing, <b><i>attach three links to examples of your work, or a link to an online portfolio.</i></b><i> </i>If not experienced, please send any relevant writing samples.</p>\n<p>4. Answer application screening questions.</p>\n<p>***Before you decide to submit your application with us, please be advised that you will need to complete a writing test if you’re selected for the next phase of screening.***</p>",
      "pubDate": "2024-02-13 07:56:17"
    },
    {
      "id": 97721,
      "url": "https://jobicy.com/jobs/97721-human-resources-business-partner",
      "jobSlug": "97721-human-resources-business-partner",
      "jobTitle": "Human Resources Business Partner",
      "companyName": "1Password",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/09/WRILS-200909195848-296323.png",
      "jobIndustry": [
        "HR &amp; Recruiting"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Canada,  USA",
      "jobLevel": "Any",
      "jobExcerpt": "We all have important information we need to manage, and protecting it should be easy. Over 100,000 businesses and millions of people log in to 1Password to unlock smart, simple access to everything they care about. Our vision is to create a safer, simpler digital future for everyone, and our culture values simplicity, honesty and&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>We all have important information we need to manage, and protecting it should be easy. Over 100,000 businesses and millions of people log in to 1Password to unlock smart, simple access to everything they care about. Our vision is to create a safer, simpler digital future for everyone, and our culture values simplicity, honesty and a human-centric approach to solving problems. Come help us unlock peace of mind so everyone can stay safer online.</div>\n<div></div>\n<div>1Password is nothing without the people who build, design, and support it. When it comes to our people, we embrace the unconventional, are hands-on, and support everyone to succeed. From introducing them to the company, helping them to grow in their role, and supporting them to accomplish their next big thing, the People team is here to guide their journey.</div>\n<div></div>\n<div>As a HR Business Partner, you’ll be the dedicated contact for certain teams within the company, advising on performance management and career planning, making sure people feel heard, and taking action with what you’ve learned. You’ll also help team leads and managers get more comfortable and confident in their roles, and work closely with leadership to provide a regular “health report” of the culture.</div>\n<div></div>\n<div>If you’re someone who loves being the bridge between teams, their people, and leadership, this is the role for you!</div>\n<div></div>\n<div>This is a remote opportunity within Canada and the US.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What we&#8217;re looking for:</h2>\n<ul>\n<li>5+ years experience working as an HR Business Partner, preferably within a fast-growing technology company.</li>\n<li>Strategic thinker, able to identify solutions and the associated impacts across the organization.</li>\n<li>Sound judgment, business insights partnered with a human centric approach, experience in a high-touch BP model.</li>\n<li>Bias for action: you&#8217;re willing to do what it takes to get the job done.</li>\n<li>Comfortable working with ambiguity: you don&#8217;t always have all the information but you&#8217;re resourceful and curious, but you are thoughtful in your bias for action.</li>\n<li>Capable and accountable to quickly establish credibility and influence others and resolve conflicts with leaders with a variety of experience.</li>\n<li>A strong EQ with an affinity for building relationships at the company.</li>\n<li>Proven experience as a HRBP: broad experience in a variety of employee relations situations, strong knowledge of current professional processes, trends, and compliance practices in Canada and the US. Experience at a software/technology company is preferred.</li>\n<li>An understanding of and comfort leveraging HRM data to create a narrative and inform the business of recommendations and opportunities.</li>\n<li>Proficient with HRM tools such as UKG, Lever, and Workplace, and able to quickly learn new tools, systems and processes, while identifying opportunities for improvement.</li>\n<li>Acute listening skills: People often compliment how great you are at listening and how they love your approach to tackling difficult situations.</li>\n<li>Communication skills that adapt: You can handle difficult situations and conversations with poise and professionalism, while retaining human touches. A lot of communication here happens in Slack as well, so emojis are our best friend!</li>\n<li>Self-starting, self-driven: You’ll be helping build the team from the ground up, so you need to be comfortable with working independently and asking for support when you need it.</li>\n<li>A strong level of ownership, confidentiality, attention to detail, and a knack for organizing processes using all three.</li>\n<li>A penchant for documentation and readiness to help others learn from your past experience.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What you can expect in Month 1:</h2>\n<ul>\n<li>Listen and learn; absorb all the things!</li>\n<li>Meet people you’ll be working with, from team leads and hiring managers to recruiters, getting to know our culture along the way.</li>\n<li>Read our team’s documentation, improving it as you go: The team is in its early stages so there are plenty of blind spots you’ll be finding and patching.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What you can expect in Month 2:</h2>\n<ul>\n<li>Understand the current performance and the career aspirations of your teams.</li>\n<li>Work with COE partners on to design, draft, and implement global compensation, benefits, and other employee programs, then educate the team that you’re dedicated to.</li>\n<li>Support team leads and team members throughout their experience here, from onboarding to coaching to managing performance improvement plans.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What you can expect in Month 3:</h2>\n<ul>\n<li>You&#8217;re well informed on the existing programs and can answer employee questions and point people to the right resource to learn more.</li>\n<li>Assist with driving engagement initiatives and culture programs, promoting a learning-focused culture where people are encouraged to continue growing, try new things, and learn from their mistakes.</li>\n<li>Continue building a network within the company, meeting new people often and hearing their perspectives on working here.</li>\n<li>Keep open communication channels with team leads and team members, using their feedback to improve your team and others within the company.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<div>USA-based roles only: The Annual base salary for this role is between $128,000 USD and $173,000 USD, plus immediate participation in 1Password&#8217;s benefits program (health, dental, 401k and many others), utilization of our generous paid time off, an equity grant and, where applicable, participation in our incentive programs.</div>\n<div></div>\n<div>Canada-based roles only: The Annual base salary for this role is between $105,000 CAD and $141,000 CAD, plus immediate participation in 1Password’s generous benefits program (health, dental, RRSP and many others), utilization of our generous paid time off, an equity grant and, where applicable, participation in our incentive programs.</div>\n<div></div>\n<div>At 1Password, we approach each individual&#8217;s compensation with a promise of fair market value and internal equity commensurate with experience and specific skill set.</div>\n</div>",
      "pubDate": "2024-02-13 07:54:15",
      "annualSalaryMin": "128000",
      "annualSalaryMax": "173000",
      "salaryCurrency": "USD"
    },
    {
      "id": 97736,
      "url": "https://jobicy.com/jobs/97736-seo-outreach-specialist-2",
      "jobSlug": "97736-seo-outreach-specialist-2",
      "jobTitle": "SEO Outreach Specialist",
      "companyName": "Uscreen",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201029095734-733605.jpg",
      "jobIndustry": [
        "SEO"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "Uscreen is a growing, bootstrapped, product-led SaaS business changing the way video creators and entrepreneurs launch businesses around their content and communities. Our all-in-one membership platform empowers creators to generate revenue through subscriptions, communities, apps, and live-streaming where their fans need them most (web, mobile, and TV). Over 25,000 video creators launched, manage, and grow&#8230;",
      "jobDescription": "<p>Uscreen is a growing, bootstrapped, product-led SaaS business changing the way video creators and entrepreneurs launch businesses around their content and communities. Our all-in-one membership platform empowers creators to generate revenue through subscriptions, communities, apps, and live-streaming where their fans need them most (web, mobile, and TV).</p>\n<p>Over 25,000 video creators launched, manage, and grow their membership businesses with Uscreen, generating hundreds of millions of dollars in the process.</p>\n<p>We are seeking a passionate SEO Outreach Specialist to join our team. As a key player, you will work closely with other teams, including Marketing and Product, to help us establish a powerful brand authority through networking and relationships.</p>\n<h2>What you’ll do:</h2>\n<ul>\n<li>Determine key target audience cohorts and establish the strategy to outreach to each of them successfully.</li>\n<li>Develop and pitch custom emails that resonate with target audiences.</li>\n<li>Plan, execute, and manage multiple off-site SEO campaigns.</li>\n<li>Build and nurture relationships with bloggers, journalists, and creators.</li>\n<li>Monitor and track traffic performance from achieved link placements and report to key stakeholders.</li>\n<li>Collaborate across internal teams, including SEO, Partnerships, Content, and others.</li>\n<li>Relentlessly strive for improvement, and assess the performance of your outreach to find areas for improvement.</li>\n</ul>\n<h2>Do you have what it takes?</h2>\n<ul>\n<li>A creative marketer with at least 3 years of experience working in highly effective outreach programs.</li>\n<li>A proven track record of earning powerful links, brand mentions, and relationships.</li>\n<li>Able to overlap at least 4 hours with morning to noon Eastern Time.</li>\n<li>You are a native or near-native English speaker.</li>\n<li>A knack for relationship building and a passion for networking.</li>\n<li>Excellent communication, negotiation, and project management skills.</li>\n<li>Excellent copywriting and editing skills, with an eye for detail.</li>\n<li>Experience with SEO tools such as Ahrefs, SEMrush, and BuzzStream.</li>\n<li>You can easily work both independently and cross-functionally with other teams.</li>\n<li>Strong organizational and time management skills.</li>\n<li>General SEO knowledge and experience are preferred.</li>\n<li>Experience in Creator Economy is a strong advantage.</li>\n</ul>\n<h2>Our commitment to you:</h2>\n<ul>\n<li> We know your worth and will compensate you competitively.</li>\n<li> Our unlimited PTO policy encourages every team member to take the time they need to unwind and recharge.</li>\n<li> Your growth is our growth! We’ll provide you with access to best-in-class training, workshops, and conferences to help you develop and succeed in your role.</li>\n<li> It’s a marathon, not a sprint. We make sure you have a clear growth plan to help you get to the next level at Uscreen.</li>\n<li> 100% Remote &#8211; Work from wherever your heart desires, as long as you have access to stable internet and a conducive workspace.</li>\n<li> We also offer flexible parental leave.</li>\n<li> Your home office should be ergonomic and inspirational to help you make some magic ✨. We’ll give you a generous WFH stipend to help you set one up.</li>\n<li> And if WFH is not for you, we’re happy to pay for your coworking space.</li>\n<li> We’re proud to offer personal development and mental wellness stipend.</li>\n<li> ​​ We host virtual social events and company retreats filled with fun activities to ensure you feel part of the Uscreen family.</li>\n</ul>\n<h2>Are you interested in applying?</h2>\n<p>Click the &#8220;Apply for this position&#8221; button and fill out the short form. We will review the applications and email candidates who qualify to set up a first-round interview. Uscreen is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, sexual orientation, age, disability, or veteran status. Please note that only shortlisted candidates will be contacted.</p>",
      "pubDate": "2024-02-13 07:53:55"
    },
    {
      "id": 101217,
      "url": "https://jobicy.com/jobs/101217-technical-content-developer-independent-contractor",
      "jobSlug": "101217-technical-content-developer-independent-contractor",
      "jobTitle": "Technical Content Developer - Independent Contractor",
      "companyName": "Wolfram",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/10/ab5e97ed23587138329ff60a8dd8ad95.png",
      "jobIndustry": [
        "Copywriting &amp; Content"
      ],
      "jobType": [
        "contract"
      ],
      "jobGeo": "Argentina,  Mexico,  Türkiye",
      "jobLevel": "Any",
      "jobExcerpt": "Wolfram, creator of Mathematica, Wolfram|Alpha and Wolfram Language, is seeking a Technical Content Developer to join the Technical Content Development team. This team is responsible for current and new projects on content development. The ideal candidate will have excellent communication skills and a passion for mathematics. Responsibilities: Creating and reviewing high-impact content for our various&#8230;",
      "jobDescription": "<p>Wolfram, creator of Mathematica, Wolfram|Alpha and Wolfram Language, is seeking a Technical Content Developer to join the Technical Content Development team. This team is responsible for current and new projects on content development. The ideal candidate will have excellent communication skills and a passion for mathematics.</p>\n<h2><strong>Responsibilities:</strong></h2>\n<ul>\n<li>Creating and reviewing high-impact content for our various webpages and more</li>\n<li>Creating visual content in the forms of images and animations</li>\n<li>Working with different teams, such as R&amp;D and business analytics, to prioritize content development</li>\n<li>Working with different teams or individually to deliver high-quality documentation</li>\n<li>Refining the content through customer feedback, testing and keeping current with tech</li>\n</ul>\n<h2><strong>Qualifications:</strong></h2>\n<ul>\n<li>Proficiency in English, with excellent written and verbal communication skills</li>\n<li>Bachelor’s degree in computer science, engineering, mathematics, physics or a related technical or scientific field</li>\n<li>Strong background in math or math-heavy subject matter</li>\n<li>Ability to prioritize tasks and take initiative</li>\n<li>Strong organizational and analytic skills</li>\n</ul>\n<h2><strong>Preferred qualifications:</strong></h2>\n<ul>\n<li>Experience teaching, being a teaching assistant or textbook writing</li>\n<li>Experience with a programming language, specifically Wolfram Language</li>\n</ul>\n<p><strong>Location: </strong>Fully remote and seeking candidates from Argentina, Chile, Colombia, Ecuador, Mexico, Peru, Armenia, Turkey, India and Morocco<br />\n<strong>Job type:</strong> Full time (40 hours per week)/Independent Contractor<br />\n<strong>Salary: </strong>Dependent on location, candidate’s background and experience<br />\n<strong>Reporting to:</strong> Manager of Sound &amp; Vision</p>\n<p>Wolfram is an equal opportunity employer and values diversity at its company. Women, people of color, members of the LGBTQ community, individuals with disabilities and veterans are strongly encouraged to apply.</p>",
      "pubDate": "2024-02-13 07:52:43"
    },
    {
      "id": 97724,
      "url": "https://jobicy.com/jobs/97724-account-executive-41",
      "jobSlug": "97724-account-executive-41",
      "jobTitle": "Account Executive",
      "companyName": "Hack The Box",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/08/c453babbbe049388aef67965a8f7050b.jpeg",
      "jobIndustry": [
        "Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "UK",
      "jobLevel": "Any",
      "jobExcerpt": "At the end of this thrilling journey, you&#8217;ll become a proud member of Hack The Box, with the ultimate mission to help redefine cybersecurity expertise. Get ready for an exciting adventure into the world of cybersecurity!  The core mission of the Account Executive: The main objective is generating revenue goal, bringing on new exciting&#8230;",
      "jobDescription": "<p>At the end of this thrilling journey, you&#8217;ll become a proud member of Hack The Box, with the ultimate mission to help redefine cybersecurity expertise. Get ready for an exciting adventure into the world of cybersecurity! </p>\n<h2>The core mission of the Account Executive:</h2>\n<p>The main objective is generating revenue goal, bringing on new exciting logos and driving long-term sustainable business. Manage pipeline by drive inbound and outbound opportunities to a successful and strategic close, with the help of our BDRs, SEs, product marketing team and customer success. Attend relevant events and keep abreast of industry knowledge, to aid in a more genuine, consultative, strategic approach to selling. Most importantly, work closely with a diverse team of talent, where we all help each other to succeed.</p>\n<h2>The fellowship you’ll be joining:</h2>\n<p>The current team consists of 5 sales people across the European regions, split into Enterprise and Commercial territories. The sales team is certainly interconnected with most departments in the organization, as we act as a liaison of information from the market and our customers, back internally to our teams. We work closely with those in our commercial function to support the full customer journey from prospecting to onboarding to a sustainable relationship (BDRs, SEs, Customer Success, Billing) and we also work closely with marketing, product, engineering, legal and finance to drive efficient processes. You will be reporting to the Director of Sales &#8211; Europe.</p>\n<h2>Tools &amp; weapons you’ll be using in your adventures:</h2>\n<p>Hubspot, Gong, JIRA, Leapsome, The Hack the Box platform.</p>\n<h2>The adventures that await you after becoming Account Executive at Hack The Box:</h2>\n<ul>\n<li>Acquire new logo opportunities and grow a robust pipeline of sales opportunities</li>\n<li>Develop a growth strategy/territory plan focused both on commercial growth and customer satisfaction</li>\n<li>Identify channel partners and distributors and build strong relationships with them</li>\n<li>Build long-term relationships with new and existing customers to explore upselling opportunities</li>\n<li>Conduct research to identify new markets and customer needs as well as map out the existing market landscape and industry trends</li>\n<li>Prepare sales contracts in accordance with company guidelines</li>\n<li>Partner with BDRs, Customer Success, and Sales Engineers</li>\n<li>Keep records of sales, revenue, and invoices, and update the company’s CRM</li>\n<li>Attend conferences, meetings, and industry events</li>\n</ul>\n<h2>Skills, knowledge, and experience points required to unlock the role of Account Executive at Hack The Box:</h2>\n<ul>\n<li>Substantial experience in tech sales roles i.e Account Executive, New Business Development</li>\n<li>Demonstrated results in growing a business in the European region</li>\n<li>Tenacity and drive to seek new business and meet or exceed targets</li>\n<li>Excellent interpersonal skills for making initial contact, ongoing communication with customers and business associates, and company presentations, meetings, etc.</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Ability to create, progress, and close opportunities with good CRM hygiene and accurate forecasting</li>\n</ul>\n<h2>What your Hack The Box adventure will have in store:</h2>\n<ul>\n<li>You&#8217;ll have the exhilarating opportunity to contribute to a product that is highly appreciated by users and the cybersecurity community at large.</li>\n<li> You&#8217;ll experience a highly supportive and caring environment, fostering growth, flexibility, and autonomy.</li>\n<li> You&#8217;ll embark on an exciting journey of continuous learning and problem-solving, leveling up as our organization grows.</li>\n<li> Most importantly, you&#8217;ll have a blast at HTB  because fun is an essential ingredient in our recipe for success! Just wait until you see our global meet-ups!</li>\n</ul>\n<h2>The gems you’ll be enjoying as Account Executive:</h2>\n<ul>\n<li>Private Health Care &amp; Life Insurance</li>\n<li>Home Office Allowance</li>\n<li>Ticket Restaurant Allowance</li>\n<li>Paid paternity leave</li>\n<li>Dedicated budget for training and professional development, participation in conferences</li>\n<li>State-of-the-art equipment</li>\n<li>Full access to the Hack The Box lab offerings; so you can learn how to hack </li>\n<li>Fully remote is an option. But we do have an office in London!</li>\n</ul>\n<h2>The Quest of Becoming Hack The Box’s Account Executive:</h2>\n<ul>\n<li>Level 1: Like in any game, you start as a Noob. Level one’s objective: submit your application.</li>\n<li>Level 2: Now you’re officially ranked as Hacker and you’re ready to meet the Talent Acquisition team. Level’s objective: highlight your past achievements, ambitions, and values.</li>\n<li>Level 3: As a Pro-Hacker at level 3, you’ll unlock the “boss level”, which involves meeting the hiring manager. Level’s objective: connect with the hiring manager and share with them your achievements.</li>\n<li>Level 4: Now you’re an Elite Hacker! Level’s objective: complete an assignment that aligns with day-to-day job-related tasks and responsibilities.</li>\n<li>Level 5: Congratulations, you&#8217;re now a Guru! Not many reach this level . Level’s objective: have a constructive, final conversation with senior leadership to explore the role and your future at HTB.</li>\n<li>Level 6: You&#8217;ve achieved the Omniscient rank and officially received an offer from HTB! To complete the last level and the Quest, all you need to do is accept the offer.</li>\n<li>QUEST COMPLETE. Congratulations, you’re officially one of us Your next quest: complete the onboarding.</li>\n<li>Hack Your Career, Today. Join us in this epic adventure of cybersecurity at Hack The Box! </li>\n</ul>\n<p><em>At Hack The Box, we are on a quest to find the most exceptional and enthusiastic talent to join our team. Whether or not you consider yourself a gamer, we value what makes you unique and want to know more about you. This job post provides just a glimpse of the incredible gamified experience our business and consumer customers enjoy through our platforms. So, if you&#8217;re ready to embark on a journey of disruption, growth, and adventure, we can&#8217;t wait to meet you!</em></p>",
      "pubDate": "2024-02-13 07:51:34"
    },
    {
      "id": 97723,
      "url": "https://jobicy.com/jobs/97723-people-partner-4",
      "jobSlug": "97723-people-partner-4",
      "jobTitle": "People Partner Manager",
      "companyName": "Stripe",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201011073943-272457.png",
      "jobIndustry": [
        "HR &amp; Recruiting"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Stripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have&#8230;",
      "jobDescription": "<div class=\"ArticleMarkdown\">\n<div class=\"ArticleMarkdown\">\n<p>Stripe is a financial infrastructure platform for businesses. Millions of companies—from the world’s largest enterprises to the most ambitious startups—use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone’s reach while doing the most important work of your career.</p>\n<h2 id=\"about-the-team\">About the team</h2>\n<p>One of the key drivers to our success is an exceptional emphasis on our people. We believe that our competitive advantage lies in our talent and that we can build a sustainable advantage by enabling individuals and teams to contribute their full potential. Stripe is looking for a People Partner Manager (HRBP) to drive that effort in either our GTM or Core Orgs. This includes supporting our leaders and managers through scale, creating an environment where Stripes of all backgrounds can thrive, aligning our business and technical strategy with our people strategy, using data to develop best practices from 1st principles.</p>\n<h2 id=\"what-youll-do\">What you’ll do</h2>\n<p>As a People Partner Manager, you’ll help make Stripe a great place to work and grow. You’ll work with senior business leaders, managers, and employees across Stripe to strategize and implement systems, processes, and programs to help people grow, develop and deliver exceptional impact to our users.</p>\n<h3 id=\"responsibilities\">Responsibilities</h3>\n<ul>\n<li>Lead and support either GTM or Core organizations through extraordinary global growth</li>\n<li>Act as a coach, partner, and confidant to managers and leaders in the organization(s) you’ll support</li>\n<li>Analyze people data and trends to inform decisions on strategy and programs and ensure we are building healthy orgs that are ready to grow with the business</li>\n<li>Partner with People Programs, People Development, Talent &amp; Careers, Global Mobility, Total Rewards, Recruiting, Inclusion and Diversity and People Ops to develop programs that continually elevate the caliber and kindness of Stripes</li>\n</ul>\n<h2 id=\"who-you-are\">Who you are</h2>\n<p>We’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement.</p>\n<h3 id=\"minimum-requirements\">Minimum requirements</h3>\n<ul>\n<li>15+ years of experience as an HR business partner, preferably with a mix of experience in fast-growing technology companies and more established organizations</li>\n<li>7+ years of management experience</li>\n<li>Experience partnering and influencing senior leaders to help drive and align their people strategy and increase business results</li>\n<li>Strong analytical and project management skills, proven ability to design clear processes, and a very detail-oriented yet flexible approach to problem solving</li>\n<li>Exceptional communication skills, both written and verbal</li>\n<li>Proven ability to partner and influence across diverse groups and experience levels</li>\n</ul>\n<h3 id=\"preferred-qualifications\">Preferred qualifications</h3>\n<ul>\n<li>A strategist and scaler, who can connect the dots between where we’re going and how we need to nudge the organization to get there</li>\n<li>A partner and connector who builds trusted relationships with managers and leaders by providing deep insights and helping them see around corners</li>\n<li>A business partner who deeply understands Stripe’s strategy and aligns it with the organization’s structures, processes, initiatives and processes</li>\n<li>A collaborator, who gets energy from working with leaders to create the best possible teams and organizational structures</li>\n<li>A strategic thinker whose decisions are informed by data, experience, and Stripe’s operating principles</li>\n<li>A coach who loves building and developing high-impact teams</li>\n<li>Experience supporting organizations within go-to-market or other revenue business teams</li>\n</ul>\n</div>\n<section class=\" Copy variant--Subsection \">\n<header class=\"Copy__header\">\n<h2 class=\"Copy__title\">Pay and benefits</h2>\n</header>\n<div class=\" Copy__body \">\n<p>The annual US base salary range for this role is $196,900 &#8211; $295,200. For sales roles, the range provided is the role’s On Target Earnings (&#8220;OTE&#8221;) range, meaning that the range includes both the sales commissions/sales bonuses target and annual base salary for the role. This salary range may be inclusive of several career levels at Stripe and will be narrowed during the interview process based on a number of factors, including the candidate’s experience, qualifications, and location. Applicants interested in this role and who are not located in the US may request the annual salary range for their location during the interview process.</p>\n<p>Additional benefits for this role may include: equity, company bonus or sales commissions/bonuses; 401(k) plan; medical, dental, and vision benefits; and wellness stipends.</p>\n</div>\n</section>\n</div>",
      "pubDate": "2024-02-13 07:50:26",
      "annualSalaryMin": "196900",
      "annualSalaryMax": "295200",
      "salaryCurrency": "USD"
    },
    {
      "id": 97720,
      "url": "https://jobicy.com/jobs/97720-business-development-representative-amer",
      "jobSlug": "97720-business-development-representative-amer",
      "jobTitle": "Business Development Representative (German Speaking)",
      "companyName": "GitLab",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/12/WRILS-201207055737-109952.jpg",
      "jobIndustry": [
        "Business Development",
        "Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "EMEA,  Europe",
      "jobLevel": "Any",
      "jobExcerpt": "GitLab is looking for an enthusiastic and strategic Business Development Representative (BDR), to join our growing Revenue Marketing team. As a BDR at GitLab, you get the opportunity to lead the initial outreach to targeted Enterprise accounts working in conjunction with the Field and Digital Marketing teams as well as the Sales and Customer Success&#8230;",
      "jobDescription": "<div class=\"content-intro\">\n<div class=\"page\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<div class=\"page\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<p>GitLab is looking for an enthusiastic and strategic Business Development Representative (BDR), to join our growing Revenue Marketing team. As a BDR at GitLab, you get the opportunity to lead the initial outreach to targeted Enterprise accounts working in conjunction with the Field and Digital Marketing teams as well as the Sales and Customer Success teams. In this role you will leverage creative marketing and sales tactics to prospect and engage with multiple buyer personas and roles to introduce GitLab’s value. You will be responsible for generating qualified meetings and pipeline for the GitLab’s Sales organization. Our BDRs come from a diverse background many have worked closing roles previously or managed teams.</p>\n<p>We have an extensive onboarding and training program at GitLab and you will be provided with necessary DevOps and GitLab knowledge to fulfill your role.</p>\n<h2><strong>What you&#8217;ll do in this role</strong></h2>\n<ul>\n<li>Effectively execute outbound prospecting initiatives</li>\n<li>Conduct high-level discovery conversations in target accounts</li>\n<li>Meet or exceed BDR sourced Sales Accepted Opportunity (SAO) volume targets</li>\n<li>Collaborate with and leverage teammates to develop targeted lists, call strategies, and messaging to drive opportunities</li>\n<li>Utilize business and industry knowledge to research accounts, identify key players, generate interest, create/identify compelling events, and develop accounts</li>\n<li>Work to have a variety of touches (call, email, social, etc.) on all prospects in your assigned territory using Outreach.io</li>\n<li>Manage, track, and report on all activities and results using Salesforce</li>\n<li>Participate in documenting all processes in the GitLab handbook and update as needed with your Business Development Manager</li>\n<li>Work in collaboration with Field and Corporate Marketing to drive attendance at regional marketing events</li>\n<li>Attend field marketing events to engage with participants identify opportunities, and to schedule meetings</li>\n<li>Act as a mentor for new BDR hires in helping them navigate their key accounts</li>\n<li>Work in collaboration with Digital Marketing to develop targeted marketing tactics against your assigned target accounts</li>\n<li>Actively partners with the Sales Team to strategically prospect in their respective territories.</li>\n</ul>\n<h2><strong>We&#8217;re looking for</strong></h2>\n<ul>\n<li>Fluency in German</li>\n<li>Positive and energetic phone skills, excellent listening skills, strong writing skills</li>\n<li>Meet or exceed daily, weekly and monthly KPIs</li>\n<li>A self-starter with a track record of successful, credible achievements</li>\n<li>You share our values, and work in accordance with those values</li>\n<li>Knowledge of business process, roles, and organizational structure</li>\n<li>Determined personality with a desire to grow and win</li>\n<li>Passionate about being a part of GitLab’s journey</li>\n<li>Proficient in using Salesforce and LinkedIn Sales Navigator</li>\n<li>Previous tech industry experience or experience in sales development, marketing and/or sales is a plus</li>\n<li>Globally we require excellent written and spoken English which is our company language</li>\n</ul>\n<p>Please note that we welcome interest from candidates with varying levels of experience; many successful candidates do not meet every single requirement. Additionally, studies have shown that people from underrepresented groups are less likely to apply to a job unless they meet every single qualification. If you&#8217;re excited about this role, please apply and allow our recruiters to assess your application</p>\n<p><strong>Country Hiring Guidelines: </strong>GitLab hires new team members in countries around the world. All of our roles are remote, however some roles may carry specific location-based eligibility requirements. Our Talent Acquisition team can help answer any questions about location after starting the recruiting process.</p>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>",
      "pubDate": "2024-02-13 07:48:19"
    },
    {
      "id": 97719,
      "url": "https://jobicy.com/jobs/97719-corporate-account-executive-dach",
      "jobSlug": "97719-corporate-account-executive-dach",
      "jobTitle": "Corporate Account Executive - DACH",
      "companyName": "Postman",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/6f061e1cad5e2783cea0b2976ed2f4c3.png",
      "jobIndustry": [
        "Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Germany,  Netherlands,  UK",
      "jobLevel": "Any",
      "jobExcerpt": "Postman is the world&#8217;s leading collaboration platform for API development. Postman&#8217;s features simplify each step of building an API &amp; streamline collaboration to help create better APIs—faster. More than 20 million developers &amp; 500,000 organizations worldwide use Postman today. After receiving Series D funding in 2021 &amp; releasing our biggest &amp; best version ever of Postman in September 2022, we continue&#8230;",
      "jobDescription": "<p>Postman is the world&#8217;s leading collaboration platform for API development. Postman&#8217;s features simplify each step of building an API &amp; streamline collaboration to help create better APIs—faster. More than 20 million developers &amp; 500,000 organizations worldwide use Postman today. After receiving Series D funding in 2021 &amp; releasing our biggest &amp; best version ever of Postman in September 2022, we continue to strive humbly towards our mission of 100 million connected developers &amp; serving companies as they seek to innovate in an API-first world.</p>\n<p>P.S: We highly recommend reading The &#8220;API-First World&#8221; graphic novel to understand the bigger picture &amp; our vision at Postman.</p>\n<h2><strong>The Opportunity:</strong></h2>\n<p>Each Corporate Account Executive has an assigned territory, containing existing Postman users on all levels of Postman. The goal is to build strategies to manage target accounts while working new inbound leads, with the intention of understanding how they are using Postman, and introduce them to all the capabilities of our Enterprise Suite. This is a unique opportunity to join the rapidly growing sales team at Postman and we are looking for passionate, energetic people to further scale our fast-growing business. The ideal candidate has personally driven significant sales growth at Technical SaaS companies.</p>\n<h2><strong>What You&#8217;ll Do:</strong></h2>\n<ul>\n<li>Given a portfolio or group of organizations with the most promising growth opportunities, build a credible funnel for Postman Enterprise adoption</li>\n<li>Take ownership of the full sales cycle from lead to close</li>\n<li>Build a strategic outbound motion for your territory</li>\n<li>Convert inbound leads to closed opportunities</li>\n<li>Execute a land and expand sales strategy to drive widespread adoption and larger deployments</li>\n<li>Help educate customers on the value of Postman throughout the evaluation and adoption cycle</li>\n<li>Navigate key decision makers to build Postman Enterprise awareness within organizations</li>\n<li>Leverage data to understand your customers and prospects to gain insight into their business challenges</li>\n<li>Be a great listener, identify customer needs and collaborate with Postman teammates to ensure customer success</li>\n<li>Communicate and organize/escalate issues appropriately including: billing, legal, security, on-boarding, and technical inquiries</li>\n<li>Provide a detailed, accurate forecast</li>\n<li>Collaborate and work with Solutions Engineering, Customer Success Managers, Account Development representatives Leadership, etc. to build strategic adoption plans for customers in large accounts</li>\n<li>Provide recommendations based on customers’ business needs and usage patterns</li>\n</ul>\n<h2><strong>About You:</strong></h2>\n<ul>\n<li>A top performer with 3-5 years experience hunting and closing net new logos</li>\n<li>Native German and fluent English speaker</li>\n<li>Experienced with creatively sourcing companies outside of your CRM</li>\n<li>Able to strategically map out and break into accounts</li>\n<li>Relevant sales experience preferably in an Enterprise SaaS organization</li>\n<li>Experience selling developer and/or technical products a strong plus</li>\n<li>Excellent communication skills both with customers and within an organization</li>\n<li>Proven negotiation and closing skills, as demonstrated by regularly exceeding sales targets while selling right-fit customers.</li>\n<li>Strong track record of navigating organizations</li>\n<li>Ability to develop senior level relationships quickly and effectively</li>\n<li>Experience presenting to senior managers and the C-suite</li>\n<li>Ability to manage multiple opportunities simultaneously at various stages of the buying process</li>\n<li>Takes an active interest in increasing customer satisfaction and deepening customer relationships</li>\n<li>Lots of smiles!</li>\n<li>You are a Recruiter! Postman hires company builders and we want you to always be on the lookout for awesome talent to help us build out one of the best companies in the world!</li>\n</ul>\n<h2><strong>Our Values:</strong></h2>\n<p>At Postman, we create with the same curiosity that we see in our users. We value transparency &amp; honest communication about not only successes, but also failures. In our work, we focus on specific goals that add up to a larger vision. Our inclusive work culture ensures that everyone is valued equally as important pieces of our final product. We are dedicated to delivering the best products we can.</p>\n<h2><strong>What Else?</strong></h2>\n<p>Postman has an informal and fun working team environment. We believe in a hybrid workplace, and although this role is remote, there will be opportunities for you to meet and collaborate with teammates from around the globe. We offer a competitive salary and equity package, comprehensive medical, dental, and vision insurance, and cool perks. Our employees enjoy unlimited PTO because we believe everyone should take the time off needed to refresh, relax, and reflect. Our wellness program offers fitness-related reimbursements, a meal stipend, home office set-up reimbursement, internet reimbursement, book reimbursements for professional development,  and a training platform for continued learning and education for personal growth. Also, our donation-matching program can support causes you care about. We’re creating a long-term company, and we want you to be part of it. Join us and become a Postmanaut.</p>\n<h2><strong>Equal Opportunity:</strong></h2>\n<p>Postman is an Equal Employment Opportunity and Affirmative Action Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Postman does not accept unsolicited headhunter and agency resumes. Postman will not pay fees to any third-party agency or company that does not have a signed agreement with Postman.</p>",
      "pubDate": "2024-02-13 07:46:56"
    },
    {
      "id": 97718,
      "url": "https://jobicy.com/jobs/97718-senior-platform-engineer",
      "jobSlug": "97718-senior-platform-engineer",
      "jobTitle": "Senior Platform Engineer",
      "companyName": "Copy.ai",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/03/5fb63579fc981698f97d55bfecb213ea.jpeg",
      "jobIndustry": [
        "Software Engineering"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Canada,  USA",
      "jobLevel": "Senior",
      "jobExcerpt": "We believe AI will be embedded in today&#8217;s businesses and help people start tomorrow&#8217;s businesses. Our SaaS product allows entrepreneurs, marketers, and copywriters to use the latest natural language processing (NLP) models to improve their communication and accomplish business goals. Over 8 million users have signed up to use our application and we&#8217;re eager to&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>We believe AI will be embedded in today&#8217;s businesses and help people start tomorrow&#8217;s businesses. Our SaaS product allows entrepreneurs, marketers, and copywriters to use the latest natural language processing (NLP) models to improve their communication and accomplish business goals.</div>\n<div></div>\n<div>Over 8 million users have signed up to use our application and we&#8217;re eager to deliver more value for them. Investors in our recent $11 million Series A round include Zach DeWitt at Wing Ventures, David Sacks at Craft Ventures, Li Jin at Atelier Ventures, Alfred Lin at Sequoia, and 80+ other investors. In March 2022, Forbes identified Copy.ai as one of the language processing AI startups part of a billion-dollar wave.</div>\n<div></div>\n<div>We’re a scrappy startup so this role is what you make of it, but we’ll help you every step of the way. You’ll be able to look back and see your impact as we grow and evolve. There’s a lot to take on, but we trust that you’re up to the challenge.</div>\n<div></div>\n<div>Copy.ai is a remote company. All employees must be able to work 9am-5pm in any timezone Pacific to Eastern.</div>\n<div></div>\n<div>At Copy.ai, we’re building the interface for every day people to interact with AI — we believe it’s an opportunity to do career-defining work. As a platform engineer, you’ll work on the engine that powers our AI Workflows product. You will help us continue to scale our platform by building internal tooling and libraries, while also improving system reliability. This role is crucial in making the product easier to use, more performant, and reliable for our users- both internally and externally.</div>\n<div></div>\n<div>Already following the AI space with a close eye? This role would be perfect for you if you already know what &#8220;prompt chaining&#8221; means, why JSON coercion would be useful in building AI agents, or you&#8217;ve put any thought into the best way to chunk data for a RAG system! You will be part of a small, collaborative team at the forefront of AI, making sure our customers are able to have the best-in-class experience in harnessing its power.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What You&#8217;ll Do:</h2>\n<ul>\n<li>Stay on top of advances in the AI space (new models, new techniques)</li>\n<li>Work with product, data science, design, and our enterprise solutions team to ship new capabilities for the workflows platform</li>\n<li>Work on overall system reliability (from unit tests, to back-up service providers, to inventing new ways of interacting with LLMs that solve a use case more reliably)</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>About You, You Have:</h2>\n<ul>\n<li>4+ years of software engineering experience</li>\n<li>Experience with SaaS, marketing tools, creator tools, and/or machine learning products is a plus</li>\n<li>Experience solving large-scale problems on a variety of databases and job queuing systems.</li>\n<li>Familiarity with Typescript/React/Node/Jest is a plus. This is primarily a backend role, but all engineers at Copy.ai are full-stack and you will occasionally need to build out front-end components or internal tools.</li>\n</ul>\n</div>\n</div>",
      "pubDate": "2024-02-13 07:46:00"
    },
    {
      "id": 101219,
      "url": "https://jobicy.com/jobs/101219-sales-trainer-2",
      "jobSlug": "101219-sales-trainer-2",
      "jobTitle": "Sales Trainer",
      "companyName": "Varsity Tutors",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/03/Jobicy-210313085850-559044.jpg",
      "jobIndustry": [
        "Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Nerdy is seeking a talented Sales Trainer to join our team and help us in the ongoing training and development of our quickly growing national and international sales and customer service force. The Sales Trainer will continue to design and implement effective sales and customer service training programs for an inside, B2C sales force. The&#8230;",
      "jobDescription": "<p>Nerdy is seeking a talented Sales Trainer to join our team and help us in the ongoing training and development of our quickly growing national and international sales and customer service force. The Sales Trainer will continue to design and implement effective sales and customer service training programs for an inside, B2C sales force. The individual in this role will work directly with our sales leaders and company executives in developing and executing high-quality training strategies and processes that will improve the effectiveness of the sales organization and drive sales productivity with new and existing employees.</p>\n<h2><strong>About Nerdy</strong></h2>\n<p>Nerdy (NYSE: NRDY), the publicly traded parent company of Varsity Tutors, is a leading platform for live online learning, with a mission to transform the way people learn through technology. The Company’s purpose-built proprietary platform leverages technology, including AI, to connect learners of all ages to experts, delivering superior value on both sides of the network. Nerdy’s comprehensive learning destination provides learning experiences across 3,000+ subjects and multiple formats—including one-on-one instruction, small group classes, large format group classes, and adaptive self-study. Nerdy’s flagship business, Varsity Tutors, is one of the nation’s largest platform for live online tutoring and classes. Its solutions are available directly to students and consumers, as well as through schools and other institutions. Nerdy is a publicly traded company on the New York Stock Exchange. Learn more about Nerdy at https://www.nerdy.com/.</p>\n<h2><strong>Qualifications</strong></h2>\n<ul>\n<li>2+ years minimum experience in a sales management or sales training role for inside sales teams required</li>\n<li>5+ years of experience in customer service, client relations, business development, or B2C/inside sales, required.</li>\n<li>Proven track record of developing effective sales or customer service training processes and programs by implementing knowledge of sales principles, techniques, and different sales methodologies</li>\n<li>High proficient and experienced in professional training or learning &amp; development</li>\n<li>Strong interpersonal skills with a passion for people development, training, and teaching</li>\n<li>Knowledge of eLearning tools and training software, including the implementation and management of an LMS</li>\n<li>Understand and appreciate that Nerdy is an apolitical company and that we can have the largest impact if we are united in our focus on helping people learn and not divided or distracted by advancing unrelated causes</li>\n</ul>\n<h2><strong>Responsibilities</strong></h2>\n<ul>\n<li>Collaborate on the design, implementation, management, and continuous improvement of the sales training process and program for new and existing sales representatives, account managers, and customer care specialists</li>\n<li>Build and improve existing training organization to better support a rapidly growing inside sales and customer service team</li>\n<li>Assist in the implementation and management of self-guided content</li>\n<li>Continuously analyze and evaluate training processes and identify ways to optimize training quality and efficacy</li>\n<li>Create and develop effective training materials, modules, and eLearning tools</li>\n<li>Provide ongoing training and development support to existing sales force and work closely with company executives to achieve operational objectives</li>\n<li>Help build a sales training culture that fosters a culture of continuous learning and improvement within the sales team, encouraging feedback and collaboration among team members.</li>\n</ul>\n<h2><strong>Varsity Tutors Leadership Principles</strong></h2>\n<p>Relentless Focus on Customers | Comfort with Ambiguity | Ownership | Simplify | Intellectual Curiosity | Build Teams | Think Big | Insist on High Standards | Bias for Action | Build Trust | Go Deep | Have Conviction | Deliver Results | Are Right, a Lot</p>\n<h2><strong>Benefits/Culture</strong></h2>\n<ul>\n<li>Competitive Salary and Equity in the company</li>\n<li>Healthcare Plans (Medical, Dental, Vision, Life)</li>\n<li>401k Company Matching Plan</li>\n<li>Maternity, Paternal, and Adoption Leave</li>\n<li>Fully Remote Position</li>\n<li>PTO and Paid Holidays</li>\n<li>Free Learning Membership for you and your household (1-1 tutoring hours, unlimited use of on-demand services, and access to our online classes)</li>\n<li>Unique opportunity to help transform how the world learns!</li>\n<li>Fun, collaborative, and team-oriented work environment with plenty of training and a feedback-rich culture</li>\n</ul>\n<p><em>Varsity Tutors is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. (INDHP)</em></p>",
      "pubDate": "2024-02-13 07:45:41"
    },
    {
      "id": 95913,
      "url": "https://jobicy.com/jobs/95913-account-executive-39",
      "jobSlug": "95913-account-executive-39",
      "jobTitle": "Account Executive",
      "companyName": "Uscreen",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201029095734-733605.jpg",
      "jobIndustry": [
        "Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Anywhere",
      "jobLevel": "Any",
      "jobExcerpt": "Uscreen is the leading video membership platform for creators.  We’re on a mission to help creators and their fans prosper through meaningful connection.  Our #1 video membership platform serves 25,000+ creators and 9+ million members while generating $20m+ in ARR. Uscreen is growing, profitable, and bootstrapped. Our vision is composed of four parts: Independence – No&#8230;",
      "jobDescription": "<p>Uscreen is the leading video membership platform for creators.  We’re on a mission to help creators and their fans prosper through meaningful connection.  Our #1 video membership platform serves 25,000+ creators and 9+ million members while generating $20m+ in ARR.</p>\n<h2>Uscreen is growing, profitable, and bootstrapped. Our vision is composed of four parts:</h2>\n<ul>\n<li>Independence – No investors, no board members, no nonsense.  We answer to our creators and their members.</li>\n<li>Profitability – Staying profitable while we grow encourages us to make sustainable business decisions every day while reinvesting in our customers, employees, &amp; product.</li>\n<li>$1,000,000,000+ of revenue generated for creators – We are successful when our creators are successful.</li>\n<li>$100,000,000+ of annual recurring revenue – We are here to make a lasting impact on the broader market of digital creators &amp; communities.</li>\n</ul>\n<h2>What you’ll do:</h2>\n<p>As an Account Executive, you will be an integral part of our Sales Team. We are a remote-first company, so we value highly the ability to work autonomously, be self-driven, and stay productive.</p>\n<ul>\n<li>Sell Uscreen’s solution to creators, founders, &amp; CEOs to help them launch and grow their online video membership businesses</li>\n<li>Manage an inbound pipeline of deals from prospect through demo and negotiation</li>\n<li>Qualify prospects based on their ‘customer readiness’ &#8212; i.e. social media presence, audience size, and quality/size of existing content library</li>\n<li>Source new business using an outbound sales motion while multi-threading the conversation with key stakeholders in the ecosystem (such as business managers &amp; talent agents)</li>\n<li>Advise the customer on our all-in-one marketing platform (lead pages, churn reduction, cart abandonment tools) and video monetization strategies (subscriptions, VOD sales, live-streamed events)</li>\n<li>Partner cross-functionally with Product, Marketing, and Customer Success to deliver a best-in-class customer experience</li>\n<li>Ability to hit and exceed monthly sales goals</li>\n<li>Maintain and update an accurate log of activity in the CRM system</li>\n</ul>\n<h2>Who you are:</h2>\n<ul>\n<li>2+ years of new Sales experience in SaaS</li>\n<li>Proven track record of exceeding sales targets</li>\n<li>Professional, detail-oriented, &amp; structured work style</li>\n<li>Excellent written &amp; verbal communicator</li>\n<li>Growth mindset and a positive attitude</li>\n<li>Graduate of a four-year university</li>\n</ul>\n<h2>Nice to haves:</h2>\n<ul>\n<li>Passion for the creator economy, digital video creators, and digital communities</li>\n<li>Previous sales methodology training (e.g. Challenger Sales, MEDDICC, SPIN)</li>\n<li>Prior success selling video platforms, membership software, and/or OTT video software</li>\n</ul>\n<h2>Our Commitment to You:</h2>\n<ul>\n<li>We will compensate you competitively.</li>\n<li>Your growth is our growth! We’ll provide you with access to best-in-class training and workshops to help you develop and succeed in your role.</li>\n<li>It’s a marathon, not a sprint. We make sure you have a clear growth plan to help you get to the next level at Uscreen.</li>\n<li>100% Remote – Work from wherever your heart desires, as long as you have access to a stable internet and a conducive workspace.</li>\n<li>Our flexible, unlimited PTO policy encourages every team member to take the time they need to unwind and recharge.</li>\n<li>We also offer flexible parental leave.</li>\n<li>Your home office should be ergonomic and inspirational to help you make some magic. We’ll give you a generous WFH stipend to help you set one up.</li>\n<li>And if WFH is not for you, we’re happy to pay for your coworking space.</li>\n<li>We’re proud to offer personal development and mental wellness stipend.</li>\n<li>We host virtual social events and company retreats filled with fun activities to ensure you feel part of the Uscreen team.</li>\n</ul>\n<h2>Are you interested in applying?</h2>\n<ul>\n<li>Click the “Apply for this position” button</li>\n<li>Fill out the short form</li>\n<li>We will review the applications and email candidates who qualify to set up a first-round interview</li>\n</ul>",
      "pubDate": "2024-02-13 07:44:22"
    },
    {
      "id": 102990,
      "url": "https://jobicy.com/jobs/102990-strategy-and-operations-manager-go-to-market",
      "jobSlug": "102990-strategy-and-operations-manager-go-to-market",
      "jobTitle": "Strategy and Operations Manager - Go To Market",
      "companyName": "Proof",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/aae5d762-221.jpeg",
      "jobIndustry": [
        "Marketing &amp; Sales",
        "Product &amp; Operations"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Proof is the world&#8217;s first identity-assured transaction management platform and we are on a mission to digitize trust for all of life’s most critical transactions. Developed by the same market leaders and experts who brought notarization online with Notarize℠, Proof offers trust in a digital world by verifying identities and securing transactions to protect businesses&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>Proof is the world&#8217;s first identity-assured transaction management platform and we are on a mission to digitize trust for all of life’s most critical transactions. Developed by the same market leaders and experts who brought notarization online with Notarize℠, Proof offers trust in a digital world by verifying identities and securing transactions to protect businesses and their customers. Since 2015, we’ve completed many of the world’s first digital commerce transactions, including the first online real estate closing, online mortgage closing, online auto sale, and online will and we&#8217;re still just getting started!</div>\n<div></div>\n<div>We are seeking a dynamic Strategy &amp; Operations Manager to join our Go to Market team and manage and optimize the structure, processes, and operational model of our high-growth sales team. The ideal candidate will have a passion for sales operations and a keen business acumen. With a solution driven attitude, a bias for action and focus on process improvement, the Strategy &amp; Operations Manager, GTM will play a key role in driving Proof’s success.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What you’ll do as the Strategy &amp; Operations Manager, GTM at Proof:</h2>\n<ul>\n<li>Provide timely sales analytics including weekly pipeline analysis, forecasting, and sales results</li>\n<li>Drive business change by developing a keen understanding of the business, identifying core focus areas through data driven insights, and building trust with business partners</li>\n<li>Partner with Sales leadership to establish GTM strategy, own the modeling and implementation of sales territories and quota setting</li>\n<li>Actively identify operational issues and design solutions to make business flow better for the sales teams</li>\n<li>Special projects that support sales and broader executive leadership</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What we’re looking for:</h2>\n<ul>\n<li>At least three years of experience working in a SAAS company</li>\n<li>5+ years related work experience in Sales Operations, Sales Strategy, Go-to-Market or like functions</li>\n<li>Be able to work effectively across functional teams, in particular Marketing, Customer Success, and Product</li>\n<li>Have the creativity and curiosity required to help us fundamentally reshape an industry</li>\n<li>Bachelor&#8217;s degree or equivalent practical experience</li>\n<li>Strong strategy, planning and organizational skills</li>\n<li>Ability to turn data into insights &amp; actions</li>\n<li>Ability to analyze data and identify trends to inform strategic decisions</li>\n<li>Must be self-managed, responsive and able to work in a virtual team environment</li>\n<li>Highly proficient in Salesforce (preference for Certified Administrator), Excel, and other analytical tools</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"salary-range\">\n<div>$175,000 &#8211; $225,000 a year</div>\n<div></div>\n<div>This is the expected cash compensation range for this position. The salary offered within this range will be determined based on factors including but not limited to skills, qualifications, experience and location. The total compensation package for this role includes benefits such as medical, dental, vision, life insurance, disability coverage, flexible paid time off, Carrot Fertility, participation in a 401(k) with company match and more!</div>\n<div></div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<div>Proof is committed to building an inclusive environment for people of all backgrounds and everyone is encouraged to apply. We are an equal opportunity employer and do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We&#8217;d love to hear from you.</div>\n</div>",
      "pubDate": "2024-02-13 07:43:18",
      "annualSalaryMin": "175000",
      "annualSalaryMax": "225000",
      "salaryCurrency": "USD"
    },
    {
      "id": 101220,
      "url": "https://jobicy.com/jobs/101220-revenue-optimization-specialist-hotels",
      "jobSlug": "101220-revenue-optimization-specialist-hotels",
      "jobTitle": "Revenue Optimisation Specialist, International marketplace",
      "companyName": "Hopper",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201020164254-931520.jpg",
      "jobIndustry": [
        "Business Development"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Australia",
      "jobLevel": "Any",
      "jobExcerpt": "The Revenue Optimization Specialist (ROS) is the main point of contact for the hotel for all operational needs. The ROSs are in constant communication with hoteliers to discuss revenue enhancing opportunities: rate shops, rate plans, promotions, product updates, etc. Operations: Ease to follow and improve processes. Maintaining a fluent and well-organized task list is key to&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>The Revenue Optimization Specialist (ROS) is the main point of contact for the hotel for all operational needs. The ROSs are in constant communication with hoteliers to discuss revenue enhancing opportunities: rate shops, rate plans, promotions, product updates, etc.</div>\n<div></div>\n<div>Operations: Ease to follow and improve processes. Maintaining a fluent and well-organized task list is key to success in this role. Technical aptitude and knowledge. It is crucial for the ROS to understand the Hopper Hotels Product fully. As a result, the attention to detail skill has to be spot on &#8211; our product is constantly evolving and changing (e.g. experiments, new app experience updates, fintech, etc)</div>\n<div></div>\n<div>Account Management: Personable and able to explain their position. Even though this is not an acquisitions role, the ideal candidate is comfortable negotiating, using data to back up their claims, and creatively looking into solutions to accommodate the hotelier’s needs while maintaining a positive outcome for Hopper</div>\n<div></div>\n<div>Good written and verbal communication skills since many hoteliers will require thorough explanations on different topics: connectivity, product, rates, etc. The ideal candidate can vocalize and explain different topics in a simple and effective manner.</div>\n<div></div>\n<div>Analytics:Rapid ability to understand analytics software (e.g. Tableau and Amplitude) and ability to solve problems independently. If you do not know how to do something, attempt to find the answer with little guidance from others.</div>\n<div></div>\n<div>Ability to interpret and analyze data. Easily identify patterns and root causes as to why things are happening (e.g. a hotel provides higher priced rates which in turn reflects in the direct hotel win rate)</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What would your day-to-day look like</h2>\n<ul>\n<li>Support hotel business growth and be targeted on boosting your large portfolio’s performance within the Hopper distribution channels</li>\n<li>Understand pricing and availability metrics and ensure your partners are taking their fair share of sales</li>\n<li>Analyze hotel performance and provide recommendations for improvement through the Hopper distribution channels</li>\n<li>Create partner specific account development plans and reporting</li>\n<li>Build high touch, consultative and strong relationships with our hotels through regular and open communications</li>\n<li>Deliver quantitative results, business understanding and strategic insights to partners</li>\n<li>Track hotel performance and interactions within SalesForce</li>\n<li>Share ideas and feedback on local trends including competitor insights, customer needs, sales, product and marketing information</li>\n<li>Take a proactive approach on customer success items and problem solving</li>\n<li>Own and develop the day to day relationships with your hotel partners and support the Hotel Supply Market Management team</li>\n<li>Work with Market Management to negotiate ad hoc promotions, marketing funds and discounts from your partners</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>An ideal candidate has:</h2>\n<ul>\n<li>Previous experience in team lead roles will be an advantage. An understanding of the accommodation landscape across ANZ.</li>\n<li>Have both commercial and data skills.</li>\n<li>Driven and have a can-do attitude knowing we are still at the discovery stage in APAC.</li>\n<li>Strong prioritization logic, data driven, no bias.</li>\n<li>No ego.</li>\n<li>Strong focus on doing what is right for the customer and the company.</li>\n<li>Experience with Salesforce or similar CRM ; Knowledge of SQL, Tableau, or similar data visualisation tools.</li>\n<li>Proven ability to communicate across a large portfolio of hotel partners.</li>\n<li>The ability to work with minimal guidance, be proactive, handle ambiguity and the challenge of quickly evolving goals.</li>\n<li>A “can-do” mindset and enthusiasm to own a series of varied problems, thrives in a dynamic and entrepreneurial environment where pushing limits is everyday business.</li>\n<li>A solid educational background and graduate degree.</li>\n<li>Fluency in one other APAC language in addition to English would be advantageous.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Perks of working with us:</h2>\n<ul>\n<li>Well-funded and proven startup with large ambitions, competitive salary, and stock options</li>\n<li>Quarterly performance bonus</li>\n<li>Unlimited PTO</li>\n<li>Monthly health insurance allowance</li>\n<li>WeWork All Access Pass OR Work-from-home stipend</li>\n<li>Entrepreneurial culture where pushing limits and taking risks is everyday business</li>\n<li>Open communication with management and company leadership</li>\n<li>Small, dynamic teams = massive impact</li>\n</ul>\n</div>\n</div>\n</div>",
      "pubDate": "2024-02-13 07:41:00"
    },
    {
      "id": 102989,
      "url": "https://jobicy.com/jobs/102989-business-solution-analyst",
      "jobSlug": "102989-business-solution-analyst",
      "jobTitle": "Business Solution Analyst",
      "companyName": "Deloitte",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/370c2482dacb3fffbd4043cfca5674fe.png",
      "jobIndustry": [
        "Marketing &amp; Sales"
      ],
      "jobType": [
        "contract"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "The Work You’ll Do as a contractor Under a Deloitte Project Team includes assisting the Deloitte Engagement Manager in leading, directing, and reviewing all activities associated with delivering technology products. Responsible for product quality, project timeliness, and customer satisfaction. Interfaces with clients to define and document requirements for a named set of custom developed or vendor&#8230;",
      "jobDescription": "<div class=\"article--detail-item view--subtitle--alt view--block\" data-map=\"basic-section\">\n<div class=\"article__content\">\n<div class=\"article__view\">\n<div class=\"article__view__item view--row no-field-title view--rich-text\">\n<div>\n<p>The Work You’ll Do as a contractor Under a Deloitte Project Team includes assisting the Deloitte Engagement Manager in leading, directing, and reviewing all activities associated with delivering technology products. Responsible for product quality, project timeliness, and customer satisfaction. Interfaces with clients to define and document requirements for a named set of custom developed or vendor software products. Creates documentation including requirements, user stories, acceptance criteria, feature description PowerPoint decks, user guides, process flows, and wireframes. Responsible for conducting Design Thinking sessions to gain insights into end user and customer needs. Assists in managing the Product Backlog for a Product, working with the Engagement Manager to prioritize requirements, define and manage scope and sprints for a project.</p>\n<h2><strong>Key Responsibilities as a Contractor:</strong></h2>\n<ul>\n<li>Defines and analyzes business and user requirements for new and enhanced products.</li>\n<li>Collaborates with the Engagement Manager in creating and presenting the appropriate project on-boarding processes and materials (Charter, SOW).</li>\n<li>Leads and is responsible for all Testing and QA activities within the project lifecycle. Works with and directs offshore QA resources to develop and execute Test Plans, Test Scripts and all other deliverables and activities related to Quality Assurance of the Products.</li>\n<li>Works with the Engagement Manager and clients to plan and execute User Acceptance Testing.</li>\n<li>Assists Engagement Manager with status reporting as required by Deloitte Applications Studio leadership.</li>\n<li>Responds proactively to both business and project issues and escalates appropriately.</li>\n<li>Performs other job-related duties as assigned.</li>\n</ul>\n<h2><strong>Qualifications:</strong></h2>\n<p><em><strong>Required:</strong></em></p>\n<ul>\n<li>Business solutions experience</li>\n<li>Strong working experience with Visio and creating business workflows.</li>\n<li>Certified Business Analysis Professional or Certification of Competency in Business Analysis</li>\n<li>Experience working with Microsoft VSTS/ADO</li>\n<li>Scrum Master Certification</li>\n</ul>\n<p><strong>Candidates interested in applying for this opportunity must be geographically based in the United States </strong><strong>and must be legally authorized to work in the United States without the need for employer sponsorship</strong></p>\n<p><strong>We do not accept agency resumes and are not responsible for any fees related to unsolicited resumes.</strong></p>\n<p><strong>Deloitte is not the employer for this role. This work is contracted through a third-party whose employees provides services to Deloitte.</strong></p>\n</div>\n</div>\n</div>\n</div>\n</div>\n<div class=\"article--detail-item view--subtitle--alt view--block\" data-map=\"basic-section\">\n<div class=\"article__header\">\n<div class=\"article__header__text\">\n<h3 class=\"article__header__text__title article__header__text__title--2\">Expected Work Schedule</h3>\n</div>\n</div>\n<div class=\"article__content\">\n<div class=\"article__view\">\n<div class=\"article__view__item view--row no-field-title\"><span class=\"field-value\" data-map=\"item-value\">During team’s core business hours</span></div>\n</div>\n</div>\n</div>\n<div class=\"article--detail-item view--subtitle--alt view--block\" data-map=\"basic-section\">\n<div class=\"article__header\">\n<div class=\"article__header__text\"></div>\n</div>\n</div>",
      "pubDate": "2024-02-13 07:38:45"
    },
    {
      "id": 93616,
      "url": "https://jobicy.com/jobs/93616-sales-support-representative-2",
      "jobSlug": "93616-sales-support-representative-2",
      "jobTitle": "Sales Support Representative",
      "companyName": "Ferguson Enterprises",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/08/e6ea0b3f88e22276c807f9f50199057b.jpg",
      "jobIndustry": [
        "Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Power Equipment Direct has a unique culture and a tradition of supporting civic, cultural, educational, and environmental activities. The company is committed to the highest standards of ethics, from helping customers select green product solutions to providing a safe and secure workplace environment. Power Equipment Direct is committed to the growth &#8211; of their business,&#8230;",
      "jobDescription": "<p>Power Equipment Direct has a unique culture and a tradition of supporting civic, cultural, educational, and environmental activities. The company is committed to the highest standards of ethics, from helping customers select green product solutions to providing a safe and secure workplace environment. Power Equipment Direct is committed to the growth &#8211; of their business, their people, and their support of the communities in which they do business.</p>\n<p>We are currently seeking the right individual to fill an immediate need for a full-time Sales Support Representative within our<b> Bolingbrook, IL</b> Sales Center. The hours are 8am to 5pm Central, Monday-Friday. This is a hybrid position, allowing the flexibility to work from home when onsite presence is not required (typically 2-3 days/month)</p>\n<p>Earn a comprehensive compensation package which includes a competitive base salary starting at $18.71/hr, eligibility to participate in our annual bonus program, and an excellent benefit package.</p>\n<p>If you enjoy working in a fun, customer-focused environment where success as a team is promoted, celebrated, and rewarded, this is the opportunity for you!</p>\n<h2><b>Responsibilities</b></h2>\n<ul>\n<li>Handle approximately 25-40 inbound phone and electronically interactions per day.</li>\n<li>Consult with customers to aid in the appropriate selection and purchase of merchandise that meet their needs.</li>\n<li>Resolve issues and concerns regarding sales and customer service.</li>\n<li>Maintain quality, productivity and sales metrics communicated by management.</li>\n</ul>\n<h2><b>Qualifications</b></h2>\n<ul>\n<li>Live local to the Bolingbrook, Naperville, or Greater Chicago area and can commute to the Bolingbrook, IL office with ease.</li>\n<li>Have at least 1-2 years of prior sales, retail, and/or customer service experience, preferably in electrical, plumbing, and/or HVAC (but not required).</li>\n<li>Be a goal-oriented, self-motivated individual with an ambition to succeed.</li>\n<li>Demonstrate the aptitude to build rapport and trust with their customers.</li>\n<li>Communicate effectively both verbally and in writing, conveying professionalism, enthusiasm, and courtesy.</li>\n<li>Thrive in a fast-paced, time-sensitive environment by multi-tasking, efficiently using all tools and resources, maintaining outstanding time management and interpersonal skills.</li>\n</ul>\n<p>We are dedicated to providing meaningful benefits programs and products to our associates and their families—geared toward benefits, wellness, financial protection, and retirement savings. We offer a competitive benefits package that includes medical, dental, vision, retirement savings with company match, paid leave (vacation, sick, personal, holiday, and parental), employee assistance programs, associate discounts, community involvement opportunities, and much more!</p>\n<h2><b>Pay Range</b></h2>\n<p><i>Actual pay rate may vary depending upon location. The estimated pay range for this position is below. The specific rate will depend on a candidate’s qualifications and prior experience.</i></p>\n<p>$18.71 &#8211; $29.92</p>\n<p><b><i>Estimated Ranges displayed are Monthly for Salaried roles </i><u>OR</u><i> Hourly for all other roles.</i></b></p>",
      "pubDate": "2024-02-13 07:36:10"
    },
    {
      "id": 93614,
      "url": "https://jobicy.com/jobs/93614-account-management-specialist",
      "jobSlug": "93614-account-management-specialist",
      "jobTitle": "Director - Sales",
      "companyName": "Radial Inc.",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/08/fdc32a55217f1ca054f1f2b51ef4f6ec.png",
      "jobIndustry": [
        "Sales"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Director",
      "jobExcerpt": "We are Radial, the leader in Omnichannel commerce technologies and operations. We enable our clients to profitably exceed customer expectations by taking on the complexity of their Omnichannel retail business and transforming it into a seamlessly orchestrated customer experience. To bring order to ordering. To make fulfillment more fulfilling. To keep commerce clicking. When we&#8230;",
      "jobDescription": "<p>We are Radial, the leader in Omnichannel commerce technologies and operations. We enable our clients to profitably exceed customer expectations by taking on the complexity of their Omnichannel retail business and transforming it into a seamlessly orchestrated customer experience. To bring order to ordering. To make fulfillment more fulfilling. To keep commerce clicking. When we partner with our clients to execute their orders, payments, fulfillment, or customer care, our clients’ promises become ours. Learn more at www.radial.com.</p>\n<p>The Sales Director is responsible for driving sales for our north American portfolio of solutions which include fulfillment, transportation, customer care, order management, and payments tax &amp; fraud solutions. This role will interface with key stakeholders across the Supply Chain including Operations, Sales, Account Management, Customer Care, Transportation, and Senior Management. The Sales Director will develop and implement a strategy to acquire new logo clients and cross-sell into existing clients to achieve and exceed your target revenue goals. This is a “hunting” role focused on securing new customers.</p>\n<p><strong><em>This posting is not open to residents in CA, WA, NY and CO</em></strong></p>\n<h2><strong>Essential Responsibilities</strong></h2>\n<ul>\n<li>Manages the sales cycle to acquire new retail and brand logos</li>\n<li>Works to develop target named account strategies and tactical penetration plans</li>\n<li>Develops and maintains relationships at the “C” and “VP” levels of the defined target accounts</li>\n<li>Develops compelling value propositions based on ROI cost/benefit analysis</li>\n<li>Executes against the major steps of the sales process including finding new business opportunities, qualifying new opportunities, and closing new business</li>\n<li>Sells against annual revenue targets for products and services</li>\n<li>Coordinates with pre-sales and professional services teams</li>\n<li>Provides accurate and timely sales forecasts</li>\n<li>Nurtures third party relationships</li>\n</ul>\n<h2><strong>Required Knowledge, Skills, and Abilities</strong></h2>\n<ul>\n<li>Demonstrated sales track record with Tier 1 and Tier 2 retailers with 3-5 years of experience and above is preferred.</li>\n<li>Understanding of retail industry dynamics, business challenges, related cost drivers, and customer needs</li>\n<li>Understanding of fulfillment and technology solutions for the retail marketplace is preferred</li>\n<li>Ability to rapidly assimilate and then clearly articulate value propositions</li>\n<li>Ability to work cross functionally and collaboratively bringing in the right resources to bear at the right stage in the selling process.</li>\n<li>Experience and success in selling high value, long lead time solutions</li>\n<li>Proven new business development skills and sales quota attainment track record</li>\n<li>Mentality of a creative self-starter; ability to work independently and find a way into prospects through existing relationships and experience</li>\n<li>Must have strong communication, presentation skills, negotiation, organizational, and attention to detail skills.</li>\n<li>Proficient networker</li>\n<li>Ability to develop and leverage relationships with senior industry leaders and key influencers</li>\n<li>An accomplished track record of selling multi-level to business, technical, operations, IT people, and C-level executives</li>\n<li>Bachelor’s degree or related area preferred</li>\n</ul>\n<p>Regional travel is required for this role by land and/or air.</p>\n<p><em>Radial is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations, and ordinances.</em></p>\n<p>Radial is committed to ensuring that its online application process provides an equal employment opportunity to all job seekers, including individuals with disabilities. If you believe you need a reasonable accommodation in order to search for a job opening or to submit an application, please contact us by emailing hroperations@radial.com. We will work to assist disabled job seekers whose disability prevents them from being able to apply online.</p>",
      "pubDate": "2024-02-13 07:35:59"
    },
    {
      "id": 102988,
      "url": "https://jobicy.com/jobs/102988-mental-health-therapist-telehealth",
      "jobSlug": "102988-mental-health-therapist-telehealth",
      "jobTitle": "Mental Health Therapist - Telehealth",
      "companyName": "Lyra Health",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/1594f6d9649b131ca2414928bd60caac.jpeg",
      "jobIndustry": [
        "Product &amp; Operations"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "USA",
      "jobLevel": "Any",
      "jobExcerpt": "Lyra is transforming mental health care through technology with a human touch to help people feel emotionally healthy at work and at home. We work with industry leaders, such as Morgan Stanley, Uber, Amgen, and other Fortune 500 companies, to improve access to effective, high-quality mental health care for their employees and their families. With&#8230;",
      "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>Lyra is transforming mental health care through technology with a human touch to help people feel emotionally healthy at work and at home. We work with industry leaders, such as Morgan Stanley, Uber, Amgen, and other Fortune 500 companies, to improve access to effective, high-quality mental health care for their employees and their families. With our innovative digital care platform and global provider network, 10 million people can receive the best care and feel better, faster. Founded by David Ebersman, former CFO of Facebook and Genentech, Lyra has raised more than $900 million in funding to support our mission of improving access to high quality mental healthcare.</div>\n<div></div>\n<div><b>FURTHER EXPANDING ACCESS</b>: We are currently prioritizing hiring clinicians, counselors, mental health providers, psychologists, and therapists in Oregon, Tennessee, Massachusetts, Maryland, Indiana, Arizona, Kansas and Wisconsin.</div>\n<div></div>\n<div>We will continue to welcome applications from all other states, and sponsor cross-licensure across selected states to ensure clinicians are set up for success to support caseload goals. As always, thank you for your continued interest in Lyra Health!</div>\n<h2><b>About the Role</b></h2>\n<div>Lyra developed an innovative video therapy program called Lyra Care Therapy: blending live video sessions with between-session digital psychoeducation and customizable skill building tools. With this program, you’ll have the resources and support you need to ensure that your clients get better—all while improving access to mental health care from your home or preferred setting.</div>\n<div></div>\n<div><b>Daily:</b> As a Lyra Care Therapist, you’ll provide short-term, evidence-based treatment via live video. You’ll assign digital lessons, videos, and assessments to your clients to enhance learnings and monitor outcomes between sessions. <b>An important note: </b>Lyra&#8217;s clients come from a multitude of different backgrounds and experiences, and have varying needs and abilities. We strive to continue to meet their unique needs by delivering culturally responsive care—an approach that accounts for the impact of cultural backgrounds on each person’s care experience.</div>\n<div></div>\n<div><b>Regularly:</b> Our therapists enjoy connecting with their peers, who share a passion for providing evidence-based care. You’ll attend one-on-one and peer group clinical consultation meetings, conduct peer-based quality assurance reviews, and attend robust training to enhance your clinical skills. You always have a team behind you if a crisis comes up. You’re never alone, even while working remotely within the U.S.</div>\n<div></div>\n<div><b>This role is a great fit</b> if you&#8217;re a licensed clinician with excellent interpersonal skills, who wants continuous growth and development in their professional career, and thrives in a feedback rich environment. If you&#8217;re comfortable with evolving processes and excited by a rapidly growing business, then this role is for you!</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Requirements:</h2>\n<ul>\n<li>Master’s degree from a clinical track (e.g., MSW, MFT, MC, MMHC)</li>\n<li><b>Unrestricted LCSW, LMFT, LPC, PsyD, PhD, or equivalent license (i.e., able to work independently, without supervision from a licensed supervisor) without current, past, or pending disciplinary action</b></li>\n<li>Experience and commitment to providing evidence-based treatments (e.g., ACT, CBT, CPT, DBT) and clinical best practices (e.g., measurement based care, promoting skills practice)</li>\n<li>Experience providing video therapy</li>\n<li>Experience maintaining a full clinical caseload of adult and/or adolescent clients/week</li>\n<li>Access to a stable and reliable internet connection is necessary to perform all work activities</li>\n<li>Ability to work full-time, approximately 40 hours per week</li>\n<li>Full-time resident of the United States</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>As a full-time Licensed Mental Health Therapist, you will be employed by Lyra Clinical Associates P.C. We manage the business operations so you can focus on providing high-quality mental health care. Here are just some of our perks and benefits:</h2>\n<ul>\n<li>Competitive compensation for your session work and administrative work</li>\n<li>Comprehensive healthcare coverage (including medical, dental, and vision, FSA/HSA life and disability insurance)</li>\n<li>Lyra for Lyrians; coaching and therapy services</li>\n<li>Flexible scheduling to set your own availability for full-time hours/week</li>\n<li>Competitive time off with pay policies, including 4 weeks vacation, sick days, and company holidays</li>\n<li>Paid Parental Leave</li>\n<li>401K</li>\n<li>Retirement benefits</li>\n<li>Equity in the company through discretionary restricted stock units</li>\n<li>Free live and recorded webinars with CE approval from APA, ASWB, and NBCC</li>\n<li>Malpractice liability insurance policy</li>\n<li>Licensure renewal reimbursement—up to 5 state licenses</li>\n<li>Opportunity for cross-licensure sponsorship and support, if eligible</li>\n<li>A caseload of motivated clients from diverse industries and backgrounds</li>\n<li>A new Chromebook, dedicated business support from Operations, HR, and IT professionals, and  a monthly technology stipend</li>\n<li>We like to spread joy throughout the year with well-being perks and activities, surprise swag, regular community celebration…and more!</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<div>The anticipated starting base salary range for a full-time Licensed Mental Health Therapist at Lyra is between $62,000 &#8211; $84,000 annually. The base salary is determined by role, and placement within the range and will depend on a number of job-related factors, including but not limited to your skills, qualifications and location.</div>\n<div></div>\n</div>\n<div>\n<div><b>At Lyra, base salary is only one aspect of an employee&#8217;s total compensation package, which may additionally include annual variable performance-based compensation earnings of on average $23,000</b>, discretionary restricted stock unit awards, comprehensive healthcare coverage, retirement benefits and time off with pay. The role may also be eligible for a discretionary bonus.</div>\n</div>",
      "pubDate": "2024-02-13 07:34:52",
      "annualSalaryMin": "62000",
      "annualSalaryMax": "84000",
      "salaryCurrency": "USD"
    },
    {
      "id": 102987,
      "url": "https://jobicy.com/jobs/102987-senior-product-designer-customer-growth",
      "jobSlug": "102987-senior-product-designer-customer-growth",
      "jobTitle": "Senior Product Designer, Customer Growth",
      "companyName": "Thumbtack",
      "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/05/Jobicy-210503180426-842530.jpg",
      "jobIndustry": [
        "Web &amp; App Design"
      ],
      "jobType": [
        "full-time"
      ],
      "jobGeo": "Canada,  USA",
      "jobLevel": "Senior",
      "jobExcerpt": "A home is the biggest investment most people make, and yet, it doesn’t come with a manual. That&#8217;s why we’re building the only app homeowners need to effortlessly manage their homes —  knowing what to do, when to do it, and who to hire. With Thumbtack, millions of people care for what matters most, and&#8230;",
      "jobDescription": "<div class=\"content-intro\">\n<p>A home is the biggest investment most people make, and yet, it doesn’t come with a manual. That&#8217;s why we’re building the only app homeowners need to effortlessly manage their homes —  knowing what to do, when to do it, and who to hire. With Thumbtack, millions of people care for what matters most, and pros earn billions of dollars through our platform. And as one of the fastest-growing companies in a $600B+ industry — we must be doing something right.</p>\n<p>We are driven by a common goal and the deep satisfaction that comes from knowing our work supports local economies, helps small businesses grow, and brings homeowners peace of mind. We’re seeking people who continually put our purpose first: advocating for pros and customers, embracing change, and choosing teamwork every day.</p>\n<p>At Thumbtack, we&#8217;re creating a new era of home care. If making an impact and the chance to do good inspires you, join us. Imagine what we’ll build together.</p>\n<h2><strong>Thumbtack by the Numbers</strong></h2>\n<ul>\n<li>Available nationwide in every U.S. county</li>\n<li>80 million projects started on Thumbtack</li>\n<li>10 million 5-star reviews fand counting</li>\n<li>Pros earn billions on our platform</li>\n<li>1000+ employees</li>\n<li>$3.2 billion valuation (June, 2021)</li>\n</ul>\n</div>\n<h2><strong>About the Design Team</strong></h2>\n<p>We&#8217;re a tight-knit team of product designers, researchers, and content designers working closely with engineers and product managers to research, explore, and iterate on well-crafted user experiences that are innovative, engaging, and delightful. We collaborate regularly through design reviews, work sessions, and presentations to inspire and influence the direction of the product and company as a whole.</p>\n<h2><strong>About the Role</strong></h2>\n<p>As a Senior Product Designer on the Customer Growth team, you’ll work collaboratively and iteratively to turn complex problems into intuitive user experiences. You’ll own projects from conception to launch and measure success through data and user research. You’ll play a key role in roadmapping, feature design, and the quality of our products, and your work will impact both user and business goals.</p>\n<h2><strong>Responsibilities</strong></h2>\n<ul>\n<li>Design customer-centric experiences with measurable business impact</li>\n<li>Partner closely with fellow designers, product managers, engineers, and marketers to lead product visions, define growth strategies, shape the product roadmap, and develop design solutions</li>\n<li>Use research and qualitative data to guide design and development decisions</li>\n<li>Develop a deep understanding of our customers while focusing on key metrics</li>\n<li>Rapidly produce multiple concepts and prototypes; knowing when to apply pixel-perfect attention to detail, and when to make low-fi sketches and prototypes</li>\n<li>Test, learn, and iterate; solve existing problems and discover new opportunities through experimentation</li>\n</ul>\n<h2><strong>What you&#8217;ll need </strong></h2>\n<p><em><strong>If you don&#8217;t think you meet all of the criteria below but still are interested in the job, please apply. Nobody checks every box, and we&#8217;re looking for someone excited to join the team.</strong></em></p>\n<ul>\n<li>6+ years of overall design experience, 2+ years of experience working on a Growth team</li>\n<li>Portfolio with a history of impactful projects that showcase your design process</li>\n<li>Demonstrate strong UX, interaction, and visual design skills along with a human-centric approach to designing products</li>\n<li>Ability to balance high-quality craft and crisp execution with agility, speed to learning, and iterative experimentation</li>\n<li>A bias for action and understanding of how your work impacts users and the business</li>\n<li>Experience designing and implementing customer experiences that have led to measurable and sustainable growth results</li>\n<li>Strong cross-functional collaboration and stakeholder management skills</li>\n</ul>\n<h2><strong>Bonus points if you have </strong></h2>\n<ul>\n<li>Experience with helping set product strategy through methods like design sprints, quarterly or yearly planning, and team brainstorms</li>\n<li>Experience with SEO principles and collaborating closely with Marketing.</li>\n<li>Experience designing for a two-sided marketplace</li>\n<li>Fluent prototyping in Figma</li>\n</ul>\n<p><span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;For candidates living in San Francisco / Bay Area, New York City, or Seattle metros, the expected salary range for the role is currently $___,___ - $___,___. Actual offered salaries will vary and will be based on various factors, such as calibrated job level, qualifications, skills, competencies, and proficiency for the role.&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:39425,&quot;3&quot;:{&quot;1&quot;:0},&quot;12&quot;:0,&quot;14&quot;:{&quot;1&quot;:2,&quot;2&quot;:0},&quot;15&quot;:&quot;Montserrat, sans-serif&quot;,&quot;18&quot;:1}\">Thumbtack is a virtual-first company, meaning you can live and work from any one of our approved locations across the United States, Canada or the Philippines.* </span></p>\n<div class=\"content-conclusion\">\n<h2 class=\"p-rich_text_section\"><strong data-stringify-type=\"bold\">Benefits &amp; Perks</strong></h2>\n<ul class=\"p-rich_text_list p-rich_text_list__bullet\" data-stringify-type=\"unordered-list\" data-indent=\"0\" data-border=\"0\">\n<li>Virtual-first working model coupled with in-person events</li>\n<li>20 company-wide holidays including a week-long end-of-year company shutdown</li>\n<li data-stringify-indent=\"0\" data-stringify-border=\"0\">Libraries (optional use collaboration &amp; connection hubs)<strong data-stringify-type=\"bold\"> </strong>in San Francisco and Salt Lake City</li>\n<li>WiFi reimbursements</li>\n<li>Cell phone reimbursements (North America)</li>\n<li>Employee Assistance Program for mental health and well-being</li>\n</ul>\n<p>Thumbtack embraces diversity. We are proud to be an equal opportunity workplace and do not discriminate on the basis of sex, race, color, age, pregnancy, sexual orientation, gender identity or expression, religion, national origin, ancestry, citizenship, marital status, military or veteran status, genetic information, disability status, or any other characteristic protected by federal, provincial, state, or local law. We also will consider for employment qualified applicants with arrest and conviction records, consistent with applicable law.</p>\n</div>",
      "pubDate": "2024-02-13 07:30:39"
    }
  ]
